<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>AutoHotkey Danksagungen</title>
<meta name="keywords" content="">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>

<body>
<div id="wrapper">
<div id="content">
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>

<h1>Danksagungen</h1>
<p>Zus&auml;tzlich zu den bereits <a href="../index.htm">genannten</a> Autoren von AutoIt:</p>
<p><strong>Robert Yaklin</strong>: Viele unerm&uuml;dliche &Uuml;berpr&uuml;fungen von einzelnen Fehlern, einen guten ersten Entwurf des Installers, sowie tolle Anregungen, wie Befehle funktionieren <strong>sollten</strong> :)</p>
<p><strong>Jason Payam Ahdoot</strong>: F&uuml;r das Vorschlagen und Beschreiben der Flie&szlig;komma-Unterst&uuml;tzung.</p>
<p><strong>Jay D. Novak</strong>: F&uuml;r die Entdeckung vieler Win9x-Probleme mit dem Send-Befehl, Feststelltaste und Hotkey-Modifikatoren; und f&uuml;r die gro&szlig;z&uuml;gige Verbreitung seiner Codes und Weisheit &uuml;ber Hotkeys, Hotstrings, Hook-Verwendung und Beschleunigung des Schreibens.</p>
<p><strong>Rajat</strong>: F&uuml;r die Erstellung stilvoller Ersatz-Icons f&uuml;r AHK; ein gro&szlig;artiges Produkt-Logo; Syntax-Anpassungen f&uuml;r TextPad; Entdeckung einiger Fehler mit den Registrierungsbefehlen und der AutoIt-v2-Kompatibilit&auml;t; die Erstellung vom SmartGUI-Creator; und viele andere Dinge.</p>
<p><strong>Beardboy</strong>: F&uuml;r das Testen mit NT4, um GetKeyState und den Send-Befehl auszubessern; f&uuml;r das viele Helfen im Forum; und f&uuml;r viele Vorschl&auml;ge und Fehlerberichte.</p>
<p><strong>Gregory F. Hogg of Hogg's Software</strong>: F&uuml;r das Schreiben des Quellcodes f&uuml;r die Multi-Monitor-Unterst&uuml;tzung im <a href="../commands/SysGet.htm">SysGet</a>-Befehl.</p>
<p><strong>Aurelian Maga</strong>: F&uuml;r das Schreiben des Quellcodes f&uuml;r <a href="../commands/ImageSearch.htm">ImageSearch</a> und das schnellere <a href="../commands/PixelSearch.htm">PixelSearch</a>.</p>
<p><strong>Joost Mulders</strong>: Sein Quellcode bildete die Grundlage f&uuml;r <a href="../Variables.htm#Expressions">Ausdr&uuml;cke</a>.</p>
<p><strong>Laszlo Hars</strong>: F&uuml;r die Beratung &uuml;ber Datenstrukturen und Algorithmen, um Arrays und dynamische Variablen stark zu beschleunigen.</p>
<p><strong>Marcus Sonntag (Ultra)</strong>: F&uuml;r die Erforschung, das Design, die Programmierung und das Testen von <a href="../commands/DllCall.htm">DllCall</a>.</p>
<p><strong>Gena Shimanovich</strong>: F&uuml;r das Debuggen und Assistieren beim Programmieren; und f&uuml;r einige erweiterte Prototyp-Scripts, die auf zuk&uuml;nftige Funktionen beruhen k&ouml;nnen.</p>
<p><strong>Eric Morin (numEric)</strong>: F&uuml;r die Beratung zur Mathematik; f&uuml;r standhaftes Debuggen von Bereichen wie <a href="../commands/OnMessage.htm">OnMessage</a>, Flie&szlig;komma-Berechnungen und Mausbewegungen; und f&uuml;r die Verbesserung der Gesamtqualit&auml;t.</p>
<p><strong>Philip Hazel</strong>: F&uuml;r <a href="http://www.pcre.org/">Perl-kompatible regul&auml;re Ausdr&uuml;cke (PCRE)</a>.</p>
<p><strong>Titan</strong>: F&uuml;r die Bereitstellung der Community-Datenbewahrung auf autohotkey.net; die Erstellung vieler n&uuml;tzlicher Scripts und Bibliotheken; die Erstellung des JavaScripts, um Code-Kommentare im Forum farblich darzustellen; und viele andere Dinge.</p>
<p><strong>Philippe Lhoste (PhiLho)</strong>: F&uuml;r die unerm&uuml;dliche Moderation und Unterst&uuml;tzung im Forum, RegEx-Beratung und -Pr&uuml;fung, Syntax- und Entwurfsideen, und viele andere Dinge.</p>
<p><strong>John Biederman</strong>: F&uuml;r die umfassende Verbesserung der Darstellung und Ergonomie in der Dokumentation.</p>
<p><strong>Jonathan Rennison (JGR)</strong>: F&uuml;r die Entwicklung von <a href="../commands/RegisterCallback.htm">RegisterCallback()</a> und f&uuml;r n&uuml;tzliche Anregungen.</p>
<p><strong>Steve Gray (Lexikos)</strong>: F&uuml;r die Entwicklung von dynamischen Funktionsaufrufen und andere neue Funktionalit&auml;ten; Analysieren und Beheben von Fehlern; und wertvolle Unterst&uuml;tzung und Beratung f&uuml;r Hunderte von Besuchern im Forum.</p>
<p><u>AutoHotkey_L:</u></p>
<p><strong>jackeiku</strong>: F&uuml;r die Entwicklung von Unicode-Unterst&uuml;tzung und weitere neue Funktionen.</p>
<p><strong>fincs</strong>: F&uuml;r die Entwicklung nativer 64-Bit-Unterst&uuml;tzung und Try/Catch/Throw, Ersatz des alten Compilers, Analyse und Behebung von Fehlern.</p>
<p><strong>Sean</strong>: F&uuml;r die Entwicklung eingebauter COM-Funktionalit&auml;t und das Liefern wertvoller Einblicke in COM.</p>
<p><strong>TheGood</strong>: F&uuml;r die Zusammenlegung der Dokumentation und Anpassung des Installer-Scripts.</p>
<p><strong>ac</strong>: F&uuml;r die Entwicklung von #Warn.</p>
<p><strong>Russell Davis</strong>: F&uuml;r die Entwicklung von A_PriorKey und ahk_path (die Grundlage von ahk_exe in Fenstertitel-Parameter).</p>
<p>&nbsp;</p>
<p><em>Und allen anderen, die Fehlerberichte oder Vorschl&auml;ge beigetragen oder eingesendet haben: Vielen Dank!</em></p>
</div>
</div>
</body>
</html>