<!DOCTYPE HTML>
<html>
<head>
<title>AutoIt-v2-Kompatibilit&auml;t</title>
<meta name="keywords" content="Grundlage">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
<h1>AutoIt-v2-Kompatibilit&auml;t</h1>
<p>In AutoHotkey v1.1.09 und h&ouml;her werden AutoIt-v2-Scripts (.aut) <strong>nicht l&auml;nger unterst&uuml;tzt</strong>. &Auml;ltere Versionen von AutoHotkey unterst&uuml;tzen AutoIt-v2-Scripts, indem die Standardeinstellungen und Verhalten einiger Befehle ge&auml;ndert werden. Diese Seite enth&auml;lt Informationen, die auf den anderen Seiten der Dokumentation entfernt wurden.</p>

<p><strong>Folgendes gilt nur f&uuml;r .aut-Dateien, und nur bei v1.1.08.01 oder niedriger.</strong></p>
<table class="info">
  <tr><td><a href="../commands/_AllowSameLineComments.htm">#AllowSameLineComments</a></td><td>Standardm&auml;&szlig;ig d&uuml;rfen Kommentare nicht neben einen Befehl vorkommen.</td></tr>
  <tr><td>A_ScriptDir</td><td>Ein letzter Backslash ist enthalten.</td></tr>
  <tr><td>DetectHiddenText</td><td>Standardeinstellung ist OFF.</td></tr>
  <tr><td>#EscapeChar</td><td>Standardeinstellung ist Backslash (\).</td></tr>
  <tr><td>FileCopy</td><td>ErrorLevel wird auf 1 gesetzt, falls eine Datei nicht kopiert werden konnte.</td></tr>
  <tr><td>IniDelete</td><td>ErrorLevel bleibt unver&auml;ndert.</td></tr>
  <tr><td>IniRead</td><td>Der <em>Standardwert</em>-Parameter wird nicht unterst&uuml;tzt; der String ERROR wird immer in <em>Ausgabevariable</em> gespeichert, falls der Wert nicht gelesen werden kann.</td></tr>
  <tr><td>IniWrite</td><td>ErrorLevel bleibt unver&auml;ndert.</td></tr>
  <tr><td>InputBox</td><td>Wenn der Benutzer die Schaltfl&auml;che CANCEL dr&uuml;ckt, wird <em>Ausgabevariable</em> leer gemacht. <a href="../misc/ErrorLevel.htm">ErrorLevel</a> bleibt unver&auml;ndert, solange das Dialogfenster die Zeit nicht &uuml;berschreitet.</td></tr>
  <tr><td>SetBatchLines</td><td>Standardeinstellung ist 1, wodurch das Script nach jeder Zeile eine Pause macht.</td></tr>
  <tr><td>SetKeyDelay</td><td>Standardeinstellung f&uuml;r <em>Druckdauer</em> beim traditionellen SendEvent-Modus ist 20.</td></tr>
  <tr><td>Send</td><td>Das Zeichen <code>#</code> wird ignoriert.</td></tr>
  <tr><td>SplashTextOn</td><td><em>H&ouml;he</em> schlie&szlig;t die Titelleiste des Fensters mit ein.</td></tr>
</table>

<h2>Schutzzeichenumwandlung</h2>
<p>Das Starten einer Script-Datei mit der Erweiterung <code>.aut.ahk</code> bei AutoHotkey v1.1.08.01 oder niedriger f&uuml;hrt das Script nicht aus; stattdessen wird das Standardschutzzeichen von AutoIt v2 (Backslash) in das Standardschutzzeichen von AutoHotkey (Backtick) umgewandelt.</p>

<h2>Veraltete Befehle</h2>
<p>Die folgenden Befehle wurden automatisch in den entsprechenden AutoHotkey-Befehlen &uuml;bersetzt (das zuvor nicht dokumentiert war): LeftClick, LeftClickDrag, RightClick, RightClickDrag, HideAutoItWin, Repeat, EndRepeat. Diese automatische &Uuml;bersetzung wurde in v1.1.09 entfernt.</p>
  </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>