<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Clipboard, ClipboardAll und OnClipboardChange</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>

<body>
<h1>Clipboard, ClipboardAll und OnClipboardChange</h1>

<p><em>Clipboard</em> ist eine interne <a href="../Variables.htm">Variable</a>, die den aktuellen Inhalt der Zwischenablage von Windows widerspiegelt, wenn dieser Inhalt als Text bezeichnet werden kann. Im Gegensatz dazu enth&auml;lt <a href="#ClipboardAll"><em>ClipboardAll</em></a> alles von der Zwischenablage, wie z. B. Bilder und Formatierung.</p>
<p><a name="CopiedFiles"></a>Jede Textzeile in <em>Clipboard</em> endet normalerweise mit einem CR- und LF-Zeichen, die im Script als <code>`r`n</code> ausgedr&uuml;ckt werden k&ouml;nnen. Dateien (die z. B. im Explorer-Fenster mit Steuerung+C kopiert wurden) werden als Text betrachtet: Solche Dateien werden automatisch in ihren Dateinamen umgewandelt (mit vollst&auml;ndigem Pfad), sobald <em>Clipboard</em> im Script verwendet wird. Um die Dateien einzeln zu extrahieren, befolgt dieses Beispiel:</p>
<pre>Loop, parse, clipboard, `n, `r
{
    MsgBox, 4, , Dateinummer %A_Index% ist %A_LoopField%.`n`nWeiter?
    IfMsgBox, No, break
}</pre>
<p>Um die Dateinamen in alphabetischer Reihenfolge zu sortieren, verwendet den <a href="../commands/Sort.htm">Sort</a>-Befehl. Um die Dateinamen der Zwischenablage in eine Datei zu schreiben, verwendet <code><a href="../commands/FileAppend.htm">FileAppend</a>, %clipboard%`r`n, C:\Eigene Datei.txt</code>. Um die Versuchsdauer zu &auml;ndern, wie oft die Zwischenablage ge&ouml;ffnet werden soll (wenn sie z. B. von einer anderen Anwendung verwendet wird), verwendet <a href="../commands/_ClipboardTimeout.htm">#ClipboardTimeOut</a>.</p>
<strong>Einfache Beispiele:</strong>
<pre>clipboard = eigener Text   <em>; Ersetzt die Zwischenablage mit neuem Inhalt.</em>
clipboard =   <em>; Leert die Zwischenablage.</em>
clipboard = %clipboard%   <em>; Wandelt jede kopierte Datei, HTML oder anders formatierter Text in Klartext um.</em>
clipboard = %clipboard% angef&uuml;gter Text.   <em>; F&uuml;gt etwas Text an die Zwischenablage.</em>
StringReplace, clipboard, clipboard, ABC, DEF, All   <em>; Ersetzt alle Vorkommen von ABC mit DEF (und wandelt die Zwischenablage in Klartext um).</em></pre>

<p><strong>ClipWait verwenden, um die Zuverl&auml;ssigkeit des Scripts zu verbessern:</strong></p>
<pre>clipboard =  <em>; Beginnt leer, damit ClipWait erkennt, wenn der Text angekommen ist.</em>
Send ^c
<a href="../commands/ClipWait.htm">ClipWait</a>  <em>; Wartet, bis die Zwischenablage Text enth&auml;lt.</em>
MsgBox Steuerung+C hat folgenden Inhalt in die Zwischenablage kopiert:`n`n%clipboard%</pre>
<h2 id="ClipboardAll">ClipboardAll<span class="ver"> (alles in der Zwischenablage speichern und wiederherstellen)</span></h2>
<p><em>ClipboardAll</em> enth&auml;lt alles von der Zwischenablage (z. B. Bilder und Formatierung). Wird h&auml;ufig verwendet, um den aktuellen Inhalt der Zwischenablage zu sichern, damit das Script die Zwischenablage vor&uuml;bergehend f&uuml;r andere Operationen verwendet. Wenn die Operation abgeschlossen ist, dann kann das Script den originalen Inhalt der Zwischenablage wie folgt wiederherstellen:</p>
<pre>ClipSaved := ClipboardAll   <em>; Speichert die gesamte Zwischenablage in eine beliebige Variable.
; ... hier kann vor&uuml;bergehend die Zwischenablage anderweitig verwendet werden, z. B. das Einf&uuml;gen von Unicode-Text mit <a href="../commands/Transform.htm#Unicode">Transform Unicode</a> ...</em>
Clipboard := ClipSaved   <em>; Originale Zwischenablage wiederherstellen. Beachtet die Verwendung von <i>Clipboard</i> (nicht <i>ClipboardAll</i>).</em>
ClipSaved =   <em>; Speicher freigeben, falls die Zwischenablage sehr gro&szlig; ist.</em></pre>
<p><em>ClipboardAll</em> kann auch in einer Datei gespeichert werden (im diesen Modus &uuml;berschreibt FileAppend immer die vorhandene Datei):</p>
<pre><a href="../commands/FileAppend.htm">FileAppend</a>, %ClipboardAll%, C:\Firmenlogo.clip <em>; Die Dateierweiterung spielt keine Rolle.</em></pre>
<p>Um die Datei sp&auml;ter wieder in die Zwischenablage zu laden (oder in eine Variable), befolgt dieses Beispiel:</p>
<pre><a href="../commands/FileRead.htm">FileRead</a>, Clipboard, <strong>*c</strong> C:\Firmenlogo.clip <em>; Beachtet die Verwendung von *c, dass vor dem Dateinamen stehen muss. </em></pre>
<p><strong><u>Hinweise</u></strong></p>
<p><em>ClipboardAll</em> ist leer, wenn es nicht wie oben beschrieben verwendet wird. Dar&uuml;ber hinaus wird <em>ClipboardAll</em> nicht in <a href="../Variables.htm#comma">kommagetrennte Ausdr&uuml;cken</a> unterst&uuml;tzt; das hei&szlig;t, es sollte auf einer Zeile zugewiesen werden, wie z. B. <code>ClipSaved := ClipboardAll</code>.</p>
<p>Variablen, denen <em>ClipboardAll</em> zugewiesen wurden ist, sind im Bin&auml;rformat und somit Wortsalat, wenn sie z. B. in einer <a href="../commands/MsgBox.htm">MsgBox</a> angezeigt werden. Auch das &Auml;ndern einer Variable mit bin&auml;rer Zwischenablage (z. B. mithilfe von <a href="../commands/StringReplace.htm">StringReplace</a>) wandelt es in eine normale Variable um und verliert folglich Daten von der Zwischenablage. Seit v1.0.46 k&ouml;nnen Variablen mit bin&auml;rer Zwischenablage an einer <a href="../Functions.htm#ByRef">Funktion</a> als Wert &uuml;bergeben werden (vorher hat das nur mit <a href="../Functions.htm#ByRef">ByRef</a> funktioniert).</p>
<p>Wenn <em>ClipboardAll</em> keine beliebigen Datenobjekte (Formate) von der Zwischenablage abrufen kann, dann werden sie weggelassen, die restlichen Objekte jedoch gespeichert. Die H&auml;ufigkeit der Abfrage ist von <a href="../commands/_ClipboardTimeout.htm">#ClipboardTimeOut</a> abh&auml;ngig (anstatt es nur einmal zu versuchen).</p>
<p>Eine Variable mit Daten aus der Zwischenablage kann in eine andere Variable wie im folgenden Beispiel kopiert werden: <code>ClipSaved2 := ClipSaved</code></p>
<p><a href="../commands/ClipWait.htm">ClipWait</a> kann verwendet werden, um festzustellen, wann die Zwischenablage Daten enth&auml;lt (schlie&szlig;t optional Daten ohne Text ein).</p>
<p><a href="../commands/StringLen.htm">StringLen</a> oder <a href="../Functions.htm#StrLen">StrLen</a> k&ouml;nnen verwendet werden, um die Gesamtgr&ouml;&szlig;e einer Variable zu ermitteln, der <em>ClipboardAll</em> zugewiesen wurden ist. Um die Gr&ouml;&szlig;e von Unicode-Versionen abzurufen, muss die L&auml;nge mit 2 multipliziert werden. <a href="../Variables.htm#IsUnicode">A_IsUnicode</a> kann wie in diesem Beispiel als Unterst&uuml;tzung f&uuml;r ANSI- und Unicode-Versionen verwenden werden: <code>size := StrLen(ClipSaved) * (A_IsUnicode ? 2 : 1)</code></p>
<p>Variablen, denen <em>ClipboardAll</em> zugewiesen wurden ist, k&ouml;nnen mithilfe der Operatoren "&lt;&gt;" und "=" miteinander verglichen werden (aber nicht direkt mit <em>ClipboardAll</em>). Im folgenden Beispiel wird zuerst die L&auml;nge jeder Variable &uuml;berpr&uuml;ft. Wenn das nicht gen&uuml;gt, eine Entscheidung zu treffen, dann k&ouml;nnen die Variablen verglichen werden, um ein Unentschieden abzuwenden:</p>
<pre>If ClipSaved1 &lt;&gt; %ClipSaved2%   <em>; <u>Muss</u> eine IF-Anweisung im alten Stil sein, kein Ausdruck.</em>
    MsgBox Die zwei gespeicherten Zwischenablagen sind unterschiedlich.</pre>
<p>Das Speichern von <em>ClipboardAll</em> in eine Variable wird nicht durch das Speicherlimit von <a href="../commands/_MaxMem.htm">#MaxMem</a> eingeschr&auml;nkt.</p>
<p>Eine gespeicherte Zwischenablagedatei besteht intern aus einem 4-Byte-Formattyp, gefolgt von einer 4-Byte-Datenblockgr&ouml;&szlig;e und einem Datenblock f&uuml;r das Format. Wenn die Zwischenablage mehrere Formate enth&auml;lt (was fast immer der Fall ist), dann werden diese drei Elemente so oft wiederholt, bis alle Formate enthalten sind. Die Datei endet mit einem 4-Byte-Formattyp, der eine 0 enth&auml;lt.</p>
<p>Bekannte Einschr&auml;nkung: Das Abrufen von <em>ClipboardAll</em>, w&auml;hrend Zellen von MS Excel in der Zwischenablage sind, zeigt in Excel ein Dialogfenster mit "Keine Drucker" an.</p>
<p>Zwischenablage-Tools, geschrieben in AutoHotkey:</p>
<ul>
  <li>Deluxe Clipboard: Bietet eine unbegrenzte Anzahl an privaten, benannten Zwischenablagen zum Kopieren, Ausschneiden, Einf&uuml;gen, Anh&auml;ngen oder Ausschneiden/Anh&auml;ngen des ausgew&auml;hlten Textes. <a href="http://www.autohotkey.com/forum/topic2665.html">www.autohotkey.com/forum/topic2665.html</a></li>
  <li>ClipStep: Kontrolliert mehrere Zwischenablagen, nur in Verwendung mit Strg+X+C+V. <a href="http://www.autohotkey.com/forum/topic4836.html">www.autohotkey.com/forum/topic4836.html</a></li>
</ul>
<h2 id="OnClipboardChange">OnClipboardChange</h2>
<p>Ein Label namens OnClipboardChange (falls vorhanden) wird automatisch gestartet, sobald eine beliebige Anwendung (auch das Script selbst) den Inhalt der Zwischenablage ge&auml;ndert hat. Das Label wird auch einmal ausgef&uuml;hrt, wenn das Script gestartet wird.</p>
<p>Die interne Variable A_EventInfo enth&auml;lt:<br> 0, wenn die Zwischenablage nun leer ist;<br> 1, wenn sie etwas enth&auml;lt, dass als Text bezeichnet werden kann (schlie&szlig;t auch <a href="#CopiedFiles">Dateien</a> ein, die in einem Explorer-Fenster kopiert wurden);<br> 2, wenn sie etwas enth&auml;lt, dass kein Text wie z. B. ein Bild ist.</p>
<p>Das folgende Beispiel ist ein funktionierendes Script. Sobald es ausgef&uuml;hrt wird, wird kurz ein ToolTip f&uuml;r jede &Auml;nderung der Zwischenablage angezeigt.</p>
<pre>#Persistent
Return

OnClipboardChange:
ToolTip Datentyp der Zwischenablage: %A_EventInfo%
Sleep 1000
ToolTip  <em>; ToolTip deaktivieren.</em>
Return</pre>
<p>Wenn die Zwischenablage ge&auml;ndert wird, w&auml;hrend das Label OnClipboardChange l&auml;uft, dann geht das Benachrichtigungsereignis verloren. Wenn das unerw&uuml;nscht ist, verwendet <a href="../commands/Critical.htm">Critical</a> in der ersten Zeile des Labels. Allerdings werden dadurch auch andere <a href="../misc/Threads.htm">Threads</a> zwischengespeichert/aufgeschoben (z. B. das Dr&uuml;cken eines Hotkeys), w&auml;hrend der OnClipboardChange-Thread l&auml;uft.</p>
<p>Wenn das Script selbst die Zwischenablage &auml;ndert, dann wird das Label OnClipboardChange nicht sofort ausgef&uuml;hrt, daher werden Befehle nach dem Befehl, der die Zwischenablage &auml;ndert, wahrscheinlich vorher ausgef&uuml;hrt. Damit das Label sofort ausgef&uuml;hrt wird, verwendet eine kurze Verz&ouml;gerung wie <a href="../commands/Sleep.htm">Sleep 20</a>, nachdem die Zwischenablage ge&auml;ndert wurde.</p>
<p>Verwandte Befehle: <a href="../commands/OnExit.htm">OnExit</a>, <a href="../commands/OnMessage.htm">OnMessage()</a>, <a href="../commands/RegisterCallback.htm">RegisterCallback()</a></p>
</body>
</html>