<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Erstellung eines Tastatur- oder Maus-Makros</title>
<meta name="keywords" content="Grundlage">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<meta name="description" content="Mit dieser freien Scriptsprache k&ouml;nnen Tastatur- oder Maus-Makros aufgenommen und abgespielt werden. Jedes Makro kann optional einem Hotkey zugewiesen werden.">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>

<body>
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>

<h1>Erstellung eines Tastatur- oder Maus-Makros</h1>

<p>Ein Makro besteht aus mehreren programmierten Aktionen, die auf Anfrage ausgef&uuml;hrt werden. Makros werden haupts&auml;chlich dazu verwendet, <a href="../commands/Send.htm">k&uuml;nstliche Tastatureingaben</a> und <a href="../commands/Click.htm">Mausklicks</a> an beliebig vielen Fenstern zu senden. Solche Fenster reagieren auf Tastatureingaben und Mausklicks, als h&auml;tte der Benutzer sie manuell durchgef&uuml;hrt, wodurch wiederholende Aufgaben schnell und zuverl&auml;ssig automatisiert werden k&ouml;nnen.</p>
<p>Obwohl Makros manuell geschrieben werden k&ouml;nnen, ist es wahrscheinlich einfacher, umfassende Makros mithilfe des Makro-Rekorders zu erstellen, wie z. B. mit dem <a href="http://www.autohotkey.com/forum/topic23671.html">Rekorder-Script</a> von Titan/polyethene. Das Script &uuml;berwacht die Tastatur- und Mauseingabe des Benutzers sowie die Fenster, die <a href="../commands/WinActivate.htm">aktiv</a> sind. Es &uuml;bertr&auml;gt diese Aktionen in einen funktionierenden Makro, dass sp&auml;ter schnell ausgef&uuml;hrt werden kann.</p>
<p>Ein Makro sollte einem <a href="../Hotkeys.htm">Hotkey</a> oder <a href="../Hotstrings.htm">Hotstring</a> zugewiesen werden, um ihn auf einfach Weise auszuf&uuml;hren.  Zum Beispiel erstellt der folgende Hotkey eine leere E-Mail-Nachricht f&uuml;r einen bestimmten Empf&auml;nger, die vorher angepasst werden kann:</p>
<pre>^!s::  <em>; Hotkey Steuerung+Alt+S.</em>
IfWinNotExist Posteingang - Microsoft Outlook
    Return  <em>; Das gew&uuml;nschte Fenster von Outlook ist nicht offen, daher ignorieren.</em>
WinActivate  <em>; Aktiviert das zuletzt gefundene Fenster.</em>
Send ^n  <em>; Erstellt eine neue/leere E-Mail mit Steuerung+N.</em>
WinWaitActive Unbenannt - Nachricht
Send {Tab 2}Produktr&uuml;ckruf f&uuml;r ACME Rocket Skates  <em>; Bestimmt die Betreffszeile.</em>
Send {Tab}Sehr geehrte Damen und Herren,{Enter 2}Wir haben vor Kurzem einen kleinen Fehler entdeckt ...  <em>; etc.</em>
Return  <em>; Mit dieser Zeile wird der Hotkey beendet.</em></pre>
<p>Hotkey-Makros sind besonders f&uuml;r Aufgaben n&uuml;tzlich, die mehrmals am Tag durchgef&uuml;hrt werden. Weniger verwendete Makros k&ouml;nnen hingegen in einzelne Scripts aufbewahrt werden, die mithilfe einer Verkn&uuml;pfung im Startmen&uuml; oder auf dem Desktop zug&auml;nglich sind.</p>
<p>F&uuml;r die Erstellung eigener Makros und Hotkeys, siehe <a href="../Tutorial.htm">Schnellstart-Tutorial</a>.</p>
<p>&nbsp;</p>
<p><a href="../index.htm">-- Home --</a></p>
</body></html>