<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>&Uuml;berschreiben von Hotkeys</title>
<meta name="keywords" content="Grundlage">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>

<body>
<div id="wrapper">
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>

<h1>&Uuml;berschreiben oder Deaktivieren von Hotkeys</h1>

<p>Alle internen Windows-Hotkeys au&szlig;er <kbd>Win</kbd>+<kbd>L</kbd> und <kbd>Win</kbd>+<kbd>U</kbd> k&ouml;nnen deaktiviert werden, wenn folgende &Auml;nderungen an der Registrierung vorgenommen werden (sollte normalerweise in allen Betriebssystemen funktionieren, erfordert aber m&ouml;glicherweise ein Neustart):</p>
<pre>HKEY_CURRENT_USER\Software\Microsoft\Windows\CurrentVersion\Policies\Explorer
NoWinKeys REG_DWORD 0x00000001 (1)</pre>
<p>Lest weiter, wenn Hotkeys mehr als nur deaktiviert werden sollen. Beachtet, dass die meisten folgenden Beispiele nicht in Windows Me/98/95 unterst&uuml;tzt werden.</p>
<p>Hotkeys von anderen Anwendungen k&ouml;nnen einfach &uuml;berschrieben oder deaktiviert werden, wenn ihnen eine Aktion im Script zugewiesen wird. Mit dieser Funktion werden am h&auml;ufigsten Hotkeys ge&auml;ndert, die in Windows selbst integriert sind. Wenn zum Beispiel der Wunsch besteht, <kbd>Win</kbd>+<kbd>E</kbd> (Windows Explorer starten) neu zu belegen, verwendet folgendes:</p>
<pre>#e::
MsgBox Dieser Hotkey geh&ouml;rt nun zum Script.
Return</pre>
<p>Im n&auml;chsten Beispiel wird der Hotkey <kbd>Win</kbd>+<kbd>R</kbd>, der zum &Ouml;ffnen des Ausf&uuml;hren-Fensters gedacht ist, vollst&auml;ndig deaktiviert:</p>
<pre>#r::Return</pre>
<p>Auf &auml;hnliche Weise k&ouml;nnen die beiden Windows-Tasten wie folgt deaktiviert werden:</p>
<pre>Lwin::Return
Rwin::Return</pre>
<p>Um einen nicht-globalen Hotkey einer Anwendung zu deaktivieren oder zu &auml;ndern (das hei&szlig;t, eine Tastenkombination, die nur funktioniert, wenn die Anwendung das aktive Fenster ist), verwendet folgendes Beispiel, das <kbd>Strg</kbd>+<kbd>P</kbd> (Drucken) nur f&uuml;r den Editor deaktiviert, aber nicht f&uuml;r die restlichen Fenster:</p>
<pre>$^p::
IfWinActive ahk_class Notepad
    Return  <em>; nichts tun, damit Steuerung+P im Editor deaktiviert ist.</em>
Send ^p
Return</pre>
<p>Im oberen Beispiel wird das $-Pr&auml;fix ben&ouml;tigt, damit der Hotkey sich selbst senden kann, ohne dabei aktiviert zu werden (ansonsten wird eine Fehlermeldung wegen einer Endlosschleife ausgel&ouml;st). Siehe auch: <a href="../Hotkeys.htm#Context">kontextabh&auml;ngige Hotkeys</a>.</p>
<p>Die oben genannten Beispiele k&ouml;nnen ausprobiert werden, indem sie in einer neuen Textdatei z. B. namens "Override.ahk" kopiert werden und die Datei danach ausgef&uuml;hrt wird.</p></div>
</body></html>