<!DOCTYPE HTML>
<html>
<head>
<title>PostMessage/SendMessage-Einf&uuml;hrung</title>
<meta name="keywords" content="Grundlage">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>

<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
    <h1>Nachrichten an ein Fenster oder Steuerelement senden - <span class="small80">von Rajat</span></h1>
    <p>Auf dieser Seite werden die Befehle <a href="../commands/PostMessage.htm">PostMessage</a> und <a href="../commands/PostMessage.htm">SendMessage</a> n&auml;her beschrieben und dabei einige Fragen gekl&auml;rt:</p>
    <p>"Wie kann ich bei einem minimierten Fenster eine Schaltfl&auml;che dr&uuml;cken?" <br>
      "Wie kann ich einen Men&uuml;punkt ausw&auml;hlen, falls <a href="../commands/WinMenuSelectItem.htm">WinMenuSelectItem</a> nicht funktioniert?!"<br>
      "Das ist ein Fenster mit anpassbarem Skin ... wie sende ich einen Befehl, der immer funktioniert?"<br>
      "und was ist mit <strong>versteckten</strong> Fenstern?!" </p>
    <h2>Verwendung</h2>
    <p>Anforderungen: AutoHotkey v1.0.09+ und Winspector Spy (<a href="http://www.softpedia.com/get/Security/Security-Related/Winspector.shtml">http://www.softpedia.com/get/Security/Security-Related/Winspector.shtml</a>)</p>
    <p>Beachtet beim ersten Beispiel, dass <a href="../commands/WinMenuSelectItem.htm">WinMenuSelectItem</a> nicht mit der Men&uuml;leiste des Outlook-Fensters "Neue Nachricht" funktioniert. Das hei&szlig;t, dass das folgende Beispiel nicht funktionieren wird:</p>
    <pre>WinMenuSelectItem, Neue Nachricht,, E&amp;inf&uuml;gen, &amp;Bild...</pre>
    <p>Mit <a href="../commands/PostMessage.htm">PostMessage</a> funktioniert das ohne Probleme:</p>
    <pre>PostMessage, 0x111, 40239, 0, , Neue Nachricht</pre>
    <p>Das klappt hervorragend! Aber was zum Teufel ist das? 0x111 ist der hexadezimale Code f&uuml;r die Nachricht <a href="SendMessageList.htm">WM_COMMAND</a>. Der Code 40239 bewirkt, dass bei diesem bestimmten Fenster der Men&uuml;punkt 'Einf&uuml;gen Bild' ausgew&auml;hlt wird. Dieser Wert kann wie folgt ermittelt werden:</p>
    <ol>
      <li>&Ouml;ffnet 'Winspector Spy' und das Fenster "Neue Nachricht".</li>
      <li>Zieht das Fadenkreuz von 'Winspector Spy' zur Titelleiste des Fensters 'Neue Nachricht'.</li>
      <li>Klickt mit der rechten Maustaste auf das ausgew&auml;hlte Fenster in der Liste und w&auml;hlt 'Messages' aus.</li>
      <li>Klickt mit der rechten Maustaste auf das leere Fenster und w&auml;hlt 'Edit message filter' aus.</li>
      <li>Dr&uuml;ckt die Schaltfl&auml;che 'filter all' und klickt in der linken Liste doppelt auf 'WM_COMMAND'. Auf diese Weise wird nur diese Nachricht &uuml;berwacht.</li>
      <li>W&auml;hlt in der Men&uuml;leiste des Fensters 'Neue Nachricht' folgenden Men&uuml;punkt aus: Einf&uuml;gen -&gt; Bild.</li>
      <li>Geht zur&uuml;ck zu 'Winspector Spy' und dr&uuml;ckt die Ampel-Schaltfl&auml;che, um die &Uuml;berwachung zu pausieren.</li>
      <li>Klappt die angesammelten WM_COMMAND-Nachrichten auf (alle anderen ignorieren, falls vorhanden).</li>
      <li>Sucht in diesem Fall eine Nachricht mit Code 0. Manchmal sind auch WM_COMMAND-Nachrichten vorhanden, die so etwas wie 'win activated' oder 'win destroyed' melden ... einfach ignorieren. Irgendwann findet man eine Nachricht mit 'Control ID: 40239' ... Fertig!</li>
      <li>Setzt anschlie&szlig;end diese Zahl in den oberen Befehl. Das ist der wParam-Wert.</li>
    </ol>
    <p>F&uuml;r das n&auml;chste Beispiel habe ich Paint genommen, das wahrscheinlich jeder hat. Sagen wir mal, es ist eine Anwendung, in der ein Werkzeug in der Werkzeugleiste mithilfe von AutoHotkey ausgew&auml;hlt werden muss, wie z. B. die Farbauswahl.</p>
    <p>Was muss getan werden? H&ouml;chstwahrscheinlich ein Mausklick auf die Schaltfl&auml;che der Werkzeugleiste, oder? Aber viele Werkzeugleisten, wie auch die von Paint, k&ouml;nnen verschoben und versteckt werden! In diesem Fall w&uuml;rde unser Script fehlschlagen. Mit dem folgenden Befehl w&uuml;rde das aber weiterhin funktionieren:</p>
    <pre> PostMessage, 0x111, 639,,, Unbenannt - Paint</pre>
    <p>Ein weiterer Vorteil von <a href="../commands/PostMessage.htm">PostMessage</a> ist, dass sich das Fenster im Hintergrund befinden kann. Mausklicks hingegen ben&ouml;tigen ein aktiviertes Fenster. </p>
    <h3>Beispiele</h3>
    <p>Hinweis: Ich verwende WinXP Pro (SP1) ... Falls sich euer Betriebssystem von meinem unterscheidet, k&ouml;nnten die ben&ouml;tigten Parameter abweichen (gilt nur bei Windows-Anwendungen wie Wordpad und Editor, bei anderen Anwendungen m&uuml;ssten die Parameter gleich sein):</p>
    <pre><em>; Erm&ouml;glicht das Schreiben in t&uuml;rkiser Farbe im Worpad </em>
<a href="../commands/PostMessage.htm">PostMessage</a>, 0x111, 32788, 0, , Dokument - WordPad

<em>; &Ouml;ffnet das Info-Fenster vom Editor </em>
<a href="../commands/PostMessage.htm">PostMessage</a>, 0x111, 65, 0, , Unbenannt - Editor

<em>; Schaltet Zeilenumbruch im Editor um </em>
<a href="../commands/PostMessage.htm">PostMessage</a>, 0x111, 32, 0, , Unbenannt - Editor

<em>; Wiedergabe/Anhalten im Windows Media Player </em>
<a href="../commands/PostMessage.htm">PostMessage</a>, 0x111, 32808, 0, , Windows Media Player

<em>; Sperrt die Hotkeys eines laufenden AHK-Scripts!</em>
DetectHiddenWindows, on<br> SetTitleMatchMode, 2
PostMessage, 0x111, 65305,,, EigenesScript.ahk - AutoHotkey <em>; Verwendet 65306 f&uuml;r Pause anstelle von Suspend.</em></pre>
    <h3>SendMessage</h3>
    <p>Das oben genannte galt f&uuml;r PostMessage. <a href="../commands/PostMessage.htm">SendMessage</a> funktioniert nicht nur auf dieselbe Weise, sondern wartet zus&auml;tzlich auf einen R&uuml;ckgabewert, mit dem zum Beispiel der aktuelle Track von Winamp abgerufen werden kann (siehe <a href="Winamp.htm">Winamp automatisieren</a> f&uuml;r ein Beispiel).</p>
    <h2>Bemerkungen</h2>
    <p>Der oben genannte Hinweis in Bezug auf Windows XP und das &Auml;ndern der Nachrichtenwerte dient nur als Warnung. Falls ihr eine Nachricht findet, die auf eurem Betriebssystem funktioniert (mit einer bestimmten Software-Version), dann k&ouml;nnt ihr euch sicher sein, dass diese Nachricht auch auf andere Systeme mit der gleichen Software-Version funktionieren wird. Dar&uuml;ber hinaus sind die Nachrichtenwerte bei den meisten Anwendungen gleich, sogar bei unterschiedlichen Versionen (z. B. Windows Media Player und Winamp).</p>
    <p>Falls ihr den Filter gesetzt habt, um nur WM_COMMAND im 'Winspector Spy' anzuzeigen, aber dabei weiterhin eine Flut an Nachrichten erhaltet, dann klickt mit der rechten Maustaste auf diese ungewollte Nachricht und w&auml;hlt hide (msg name) aus.</p>
    <p>Die Pfeile nach rechts im Winspector Spy kennzeichnen die Nachrichtenwerte und die verschwommenen Pfeile nach links die R&uuml;ckgabewerte. Ein 0-Wert kann standardm&auml;&szlig;ig ohne Bedenken als 'kein Fehler' genommen werden (bei SendMessage befindet sich der R&uuml;ckgabewert in <a href="ErrorLevel.htm">ErrorLevel</a>).</p>
    <p>Mithilfe von <code>SetTitleMatchMode 2</code> kann eine PostMessage-Nachricht auch dann an ein Fenster gesendet werden, falls die Titel nur teilweise &uuml;bereinstimmen.</p>
    <p>Mithilfe von <code>DetectHiddenWindows On</code> kann eine PostMessage-Nachricht auch dann an ein Fenster gesendet werden, falls das Fenster versteckt ist.</p>
    <p>Es gibt Anwendungen, bei denen diese Technik nicht funktioniert. Ich hatte gemischtes Gl&uuml;ck bei VB- und Delphi-Anwendungen. Diese Technik sollte am besten bei Anwendungen benutzt werden, die mit C oder C++ programmiert wurden. Bei VB-Anwendungen wird der "LParam" vom gleichnamigen Befehl daran gehindert, von einer Ausf&uuml;hrung zur n&auml;chsten zu wechseln. Bei einigen Delphi-Anwendungen verwendet ein GUI nicht einmal WM_COMMAND. Es verwendet wahrscheinlich Positionen und Klicks der Maus.</p>
    <p>Geht und erkundet .... und teilt eure Erfahrungen mit der Community von AutoHotkey. Feedbacks sind erw&uuml;nscht!</p>
    <p>Diese Einf&uuml;hrung ist nicht f&uuml;r totale Anf&auml;nger gedacht (nichts f&uuml;r ungut), da diese Befehle als erweiterte Funktionen betrachtet werden. Also, wenn ihr daraus nicht schlau werdet, vergesst es.</p>
    <p>- Rajat</p>
  </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>