<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Threads</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>

<body>
<h1>Threads</h1>

<p>Der <em>aktuelle Thread</em> wird als Ausf&uuml;hrungsablauf definiert, der vom aktuellsten Ereignis aufgerufen wird; Beispiele sind <a href="../Hotkeys.htm">Hotkeys</a>, <a href="../commands/SetTimer.htm">SetTimer-Subroutinen</a>, <a href="../commands/Menu.htm">benutzerdefinierte Men&uuml;punkte</a> und <a href="../commands/Gui.htm#Events">GUI-Ereignisse</a>. Der <em>aktuelle Thread</em> kann Befehle innerhalb der eigenen Subroutine oder innerhalb anderer aufgerufenen Subroutinen ausf&uuml;hren.</p>
<p>Obwohl AutoHotkey zurzeit mehrere Threads gleichzeitig nicht unterst&uuml;tzt, wird das Verhalten simuliert: Wenn ein zweiter Thread gestartet wird (z. B. durch Dr&uuml;cken eines anderen Hotkeys, w&auml;hrend der vorherige Hotkey weiterhin l&auml;uft), dann wird der <em>aktuelle Thread</em> unterbrochen (vor&uuml;bergehend angehalten), damit der neue Thread zum <em>aktuellen Thread</em> wird. Wenn ein dritter Thread gestartet wird, w&auml;hrend das zweite noch l&auml;uft, dann sind sowohl der Zweite als auch der Erste im Ruhezustand und so weiter.</p>
<p>Wenn der <em>aktuelle Thread</em> beendet wird, dann wird der aktuellste unterbrochene Thread fortgesetzt und so weiter, bis alle Threads fertig sind. Wenn ein Thread fortgesetzt wird, dann werden seine Einstellungen wie <a href="ErrorLevel.htm">ErrorLevel</a> und <a href="../commands/SendMode.htm">SendMode</a> automatisch wiederhergestellt; das hei&szlig;t, dass ein Thread keine Nebeneffekte von der Unterbrechung erf&auml;hrt (au&szlig;er bei einer m&ouml;glichen &Auml;nderung im <a href="../commands/WinActivate.htm">aktiven Fenster</a>).</p>
<p>Hinweis: Der <a href="../commands/KeyHistory.htm">KeyHistory</a>-Befehl /-Men&uuml;punkt zeigt an, wie viele Threads im unterbrochenen Zustand sind, und der <a href="../commands/ListHotkeys.htm">ListHotkeys</a>-Befehl/-Men&uuml;punkt zeigt an, welche Hotkeys Threads haben.</p>
<p>Ein Script kann mehrere <a href="../commands/MsgBox.htm">MsgBox</a>-, <a href="../commands/InputBox.htm">InputBox</a>-, <a href="../commands/FileSelectFile.htm">FileSelectFile</a>- und <a href="../commands/FileSelectFolder.htm">FileSelectFolder</a>-Dialogfenster gleichzeitig enthalten. Das kann mit der Ausf&uuml;hrung eines neuen Threads erreicht werden (mithilfe von <a href="../Hotkeys.htm">Hotkey</a>, <a href="../commands/SetTimer.htm">zeitlich festgelegte Subroutine</a>, <a href="../commands/Menu.htm">benutzerdefinierter Men&uuml;punkt</a>, usw.), w&auml;hrend ein vorheriger Thread bereits ein Dialogfenster anzeigt.</p>
<p>Standardm&auml;&szlig;ig kann ein angegebener <a href="../Hotkeys.htm">Hotkey</a> oder <a href="../Hotstrings.htm">Hotstring</a> nicht zweimal ausgef&uuml;hrt werden, falls er bereits l&auml;uft. Verwendet <a href="../commands/_MaxThreadsPerHotkey.htm">#MaxThreadsPerHotkey</a>, um das Verhalten zu &auml;ndern.</p>
<h2>Thread-Priorit&auml;t</h2>
<p>Jeder Thread <a href="../Hotkeys.htm">(Hotkey</a>, <a href="../commands/SetTimer.htm">zeitlich festgelegte Subroutine</a>, <a href="../commands/Menu.htm">benutzerdefinierter Men&uuml;punkt</a>, usw.) mit einer Priorit&auml;t niedriger als die Priorit&auml;t des <em>aktuellen Threads</em> kann nicht unterbrochen werden. In dieser Zeit werden solche Timer nicht ausgef&uuml;hrt, au&szlig;erdem kann der Benutzer weder einen Thread erstellen noch einen zwischenspeichern (z. B. das Dr&uuml;cken eines <a href="../Hotkeys.htm">Hotkeys</a> oder einer <a href="../commands/GuiControls.htm#Button">GUI-Schaltfl&auml;che</a>). Deshalb sollten Threads mit hoher Priorit&auml;t so gestaltet werden, dass sie schnell beendet werden k&ouml;nnen, oder verwendet <a href="../commands/Critical.htm">Critical</a> anstelle der hohen Priorit&auml;t.</p>
<p>Die Standard-Priorit&auml;t ist 0. Alle Threads verwenden die Standard-Priorit&auml;t, solange diese Priorit&auml;t nicht von einer folgenden Methode ge&auml;ndert wird:<br> 1) Die Priorit&auml;t einer zeitlich festgelegten Subroutine wird mithilfe von <a href="../commands/SetTimer.htm">SetTimer</a> ge&auml;ndert.<br> 2) Die Priorit&auml;t eines Hotkeys wird mithilfe des <a href="../commands/Hotkey.htm">Hotkey</a>-Befehls ge&auml;ndert.<br> 3) Die Priorit&auml;t eines Hotstrings wird mithilfe des <a href="../Hotstrings.htm">Hotstring</a>-Befehls oder der <a href="../commands/_Hotstring.htm">#Hotstring</a>-Anweisung ge&auml;ndert. <br> 4) Die Priorit&auml;t eines benutzerdefinierten Men&uuml;punkts wird mithilfe des <a href="../commands/Menu.htm">Menu</a>-Befehls ge&auml;ndert.<br> 5) Der <em>aktuelle Thread</em> bestimmt seine eigene Priorit&auml;t mithilfe des <a href="../commands/Thread.htm">Thread</a>-Befehls.</p>
<p>Die <a href="../commands/OnExit.htm">OnExit</a>-Subroutine (falls vorhanden) wird immer bei Aufruf ausgef&uuml;hrt, unabh&auml;ngig von der Priorit&auml;t des <em>aktuellen Threads</em>.</p>
</body>
</html>