<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Threads</title>
<meta name="keywords" content="Grundlage">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>

<body>
<div id="wrapper">
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>

<h1>Threads</h1>

<p>Der <em>aktuelle Thread</em>, auch bezeichnet als Ausf&uuml;hrungsablauf, wird vom aktuellsten Ereignis aufgerufen; dazu z&auml;hlen <a href="../Hotkeys.htm">Hotkeys</a>, <a href="../commands/SetTimer.htm">SetTimer-Subroutinen</a>, <a href="../commands/Menu.htm">benutzerdefinierte Men&uuml;punkte</a> und <a href="../commands/Gui.htm#Events">GUI-Ereignisse</a>. Der <em>aktuelle Thread</em> kann Befehle ausf&uuml;hren, die in der eigenen oder in einer anderen Subroutine, aufgerufen durch die eigene Subroutine, enthalten sind.</p>
<p>AutoHotkey ist eigentlich nicht in der Lage, mehrere Threads gleichzeitig auszuf&uuml;hren, trotzdem wird dieses Verhalten teilweise nachgeahmt: Sobald ein zweiter Thread gestartet wird (wenn beispielsweise ein weiterer Hotkey gedr&uuml;ckt wird, w&auml;hrend der vorherige noch ausgef&uuml;hrt wird), wird der <em>aktuelle Thread</em> unterbrochen (vor&uuml;bergehend angehalten), damit der neue Thread zum <em>aktuellen Thread</em> wird. Sobald ein dritter Thread gestartet wird, w&auml;hrend der zweite noch ausgef&uuml;hrt wird, dann ist sowohl der zweite als auch der erste Thread im Ruhezustand, und so weiter.</p>
<p>Sobald der <em>aktuelle Thread</em> endet, wird der gerade unterbrochene Thread fortgesetzt und so weiter, bis alle Threads abgeschlossen sind. Wenn ein Thread fortgesetzt wird, werden seine Einstellungen wie <a href="ErrorLevel.htm">ErrorLevel</a> und <a href="../commands/SendMode.htm">SendMode</a> automatisch auf die Werte wiederhergestellt, die vor der Unterbrechung galten; das hei&szlig;t, dass ein Thread keine Nebeneffekte von der Unterbrechung erf&auml;hrt (au&szlig;er bei einer m&ouml;glichen &Auml;nderung im <a href="../commands/WinActivate.htm">aktiven Fenster</a>).</p>
<p>Hinweis: Der Befehl bzw. Men&uuml;punkt <a href="../commands/KeyHistory.htm">KeyHistory</a> zeigt an, wie viele Threads im unterbrochenen Zustand sind. Zudem verdeutlicht der Befehl bzw. Men&uuml;punkt <a href="../commands/ListHotkeys.htm">ListHotkeys</a>, welche Hotkeys Threads haben.</p>
<p>Ein Script kann mehrere Dialogfenster wie <a href="../commands/MsgBox.htm">MsgBox</a>, <a href="../commands/InputBox.htm">InputBox</a>, <a href="../commands/FileSelectFile.htm">FileSelectFile</a> und <a href="../commands/FileSelectFolder.htm">FileSelectFolder</a> gleichzeitig anzeigen. Das wird erreicht, indem ein neuer Thread ausgef&uuml;hrt wird (via <a href="../Hotkeys.htm">Hotkey</a>, <a href="../commands/SetTimer.htm">zeitlich festgelegte Subroutine</a>, <a href="../commands/Menu.htm">benutzerdefinierter Men&uuml;punkt</a> und so weiter), w&auml;hrend ein vorheriger Thread bereits ein Dialogfenster anzeigt.</p>
<p>Standardm&auml;&szlig;ig kann eine bereits laufende <a href="../Hotkeys.htm">Hotkey</a> oder <a href="../Hotstrings.htm">Hotstring</a>-Subroutine nicht zum zweiten Mal ausgef&uuml;hrt werden. Verwendet <a href="../commands/_MaxThreadsPerHotkey.htm">#MaxThreadsPerHotkey</a>, um dieses Verhalten zu &auml;ndern.</p>
<h2>Thread-Priorit&auml;t</h2>
<p>Jeder Thread <a href="../Hotkeys.htm">(Hotkey</a>, <a href="../commands/SetTimer.htm">zeitlich festgelegte Subroutine</a>, <a href="../commands/Menu.htm">benutzerdefinierter Men&uuml;punkt</a> und so weiter) mit einer Priorit&auml;t niedriger als die Priorit&auml;t des <em>aktuellen Threads</em> kann nicht unterbrochen werden. In dieser Zeit werden solche Timer nicht ausgef&uuml;hrt, dabei kann der Benutzer weder einen Thread erstellen noch einen zwischenspeichern (z. B. durch Dr&uuml;cken eines <a href="../Hotkeys.htm">Hotkeys</a> oder einer <a href="../commands/GuiControls.htm#Button">GUI-Schaltfl&auml;che</a>). Deshalb sollten Threads mit hoher Priorit&auml;t so schnell wie m&ouml;glich zum Abschluss kommen oder <a href="../commands/Critical.htm">Critical</a> anstelle der hohen Priorit&auml;t verwenden.</p>
<p>Die Standard-Priorit&auml;t ist 0. Alle Threads verwenden die Standard-Priorit&auml;t, es sei denn, sie wird durch eine der folgenden Methoden ge&auml;ndert:<br></p>
<ol>
<li> Die Priorit&auml;t einer zeitlich festgelegten Subroutine wird mittels <a href="../commands/SetTimer.htm">SetTimer</a> ge&auml;ndert.</li>
<li>Die Priorit&auml;t eines Hotkeys wird mithilfe des <a href="../commands/Hotkey.htm">Hotkey</a>-Befehls ge&auml;ndert.</li>
<li>Die Priorit&auml;t eines Hotstrings wird mithilfe des <a href="../Hotstrings.htm">Hotstring</a>-Befehls oder der <a href="../commands/_Hotstring.htm">#Hotstring</a>-Direktive ge&auml;ndert.&nbsp;</li>
<li>Die Priorit&auml;t eines benutzerdefinierten Men&uuml;punkts wird mithilfe des <a href="../commands/Menu.htm">Menu</a>-Befehls ge&auml;ndert.</li>
<li>Der <em>aktuelle Thread</em> bestimmt seine eigene Priorit&auml;t mithilfe des <a href="../commands/Thread.htm">Thread</a>-Befehls.</li></ol>
<p>Die <a href="../commands/OnExit.htm">OnExit</a>-Subroutine (falls vorhanden) wird bei Bedarf immer ausgef&uuml;hrt, unabh&auml;ngig von der Priorit&auml;t des <em>aktuellen Threads</em>.</p>
</div>
</body></html>