<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Debugging-Funktionen</title>
<meta name="keywords" content="Grundlage, Debugging">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>Debugger-Clients</h1>

<p>AutoHotkey_L unterst&uuml;tzt mithilfe von <a href="http://xdebug.org/docs-dbgp.php">DBGp</a> zus&auml;tzliche Debugging-Funktionen - ein g&auml;ngiges Debugger-Protokoll f&uuml;r Sprachen und Debugger-UI-Kommunikation. Siehe <a href="Scripts.htm#idebug">Interaktives Debugging</a> f&uuml;r mehr Details. Auf dieser Seite sind einige Benutzeroberfl&auml;chen oder "Clients" aufgelistet, die kompatibel mit AutoHotkey_L sind.</p>

<h2>SciTE4AutoHotkey</h2>
<p><a href="http://www.autohotkey.net/~fincs/SciTE4AutoHotkey_3/web/">SciTE4AutoHotkey</a> ist ein freier, <a href="http://www.scintilla.org/SciTE.html">SciTE</a>-basierter Editor f&uuml;r AutoHotkey-Scripts. Dieser Editor unterst&uuml;tzt neben DBGp auch Syntaxhervorhebung, Calltips/Parameterinformation, automatische Vervollst&auml;ndigung und weitere n&uuml;tzliche Bearbeitungsfunktionen und Script-Werkzeuge.</p>
<p>Folgende Debbuging-Funktionen sind enthalten:</p>
<ul>
  <li>Haltepunkte.</li>
  <li>Ausf&uuml;hren, Betreten, &Uuml;berspringen, Verlassen.</li>
  <li>Aufrufliste anzeigen.</li>
  <li>Namen und Inhalte von lokalen/globalen Variablen auflisten.</li>
  <li>Sobald sich die Maus &uuml;ber einer Variable befindet, wird deren Inhalt angezeigt.</li>
  <li>Variableninhalte &uuml;berwachen und bearbeiten.</li>
  <li>Strukturen und Objekte anzeigen.</li>
</ul>
<p><a href="http://www.autohotkey.net/~fincs/SciTE4AutoHotkey_3/web/">http://www.autohotkey.net/~fincs/SciTE4AutoHotkey_3/web/</a></p>

<h2>XDebugClient</h2>
<p><a href="http://code.google.com/p/xdebugclient/">XDebugClient</a> ist ein einfacher Open-Source-Frontend-DBGp-Client auf Basis von <b>.NET Framework 2.0</b>. XDebugClient wurde urspr&uuml;nglich f&uuml;r PHP mit Xdebug entwickelt, jedoch ist eine benutzerdefinierte Version weiter unten erh&auml;ltlich, die mit AutoHotkey_L kompatibel ist.</p>
<p><b>&Auml;nderungen:</b></p>
<ul>
  <li>Erlaubt der Debugger-Engine, auch andere Sprachen zu benachrichtigen.</li>
  <li>Syntax-Hervorhebung f&uuml;r AutoHotkey hinzugef&uuml;gt.</li>
  <li>&Uuml;berwacht automatisch eine Verbindung von der Debugger-Engine, anstatt darauf zu warten, bis der Benutzer <em>Start Listening</em> anklickt.</li>
  <li>Eigenschaftswerte werden beim ersten Null-Zeichen gek&uuml;rzt, da AutoHotkey_L derzeit den gesamten Variableninhalt zur&uuml;ckgibt und XDebugClient keine geeignete Schnittstelle f&uuml;r die Anzeige von bin&auml;ren Inhalten hat.</li>
</ul>
<p><b>Download:</b> <a href="http://l.autohotkey.net/XDebugClient.zip">Bin&auml;rdateien</a>; <a href="http://l.autohotkey.net/XDebugClient_src.zip">Quellcode</a> (siehe auch <a href="http://www.icsharpcode.net/">SharpDevelop</a>, <a href="http://sourceforge.net/projects/dockpanelsuite/">Dockpanel Suite</a> und <a href="http://www.codeproject.com/cs/miscctrl/treeviewadv.asp">Advanced Treeview</a>)</p>
<p><b>Verwendung:</b></p>
<ul>
  <li>XDebugClient starten.</li>
  <li>AutoHotkey_L /Debug ausf&uuml;hren. XDebugClient sollte automatisch die Script-Datei &ouml;ffnen.</li>
  <li>Auf den linken Rand klicken, um zumindest einen Haltepunkt zu setzen.</li>
  <li>Run im Debug-Men&uuml; ausw&auml;hlen oder F5 dr&uuml;cken.</li>
  <li>Wenn die Ausf&uuml;hrung an einem Haltepunkt ankommt, verwendet das Debug-Men&uuml; oder Tastenkombinationen, um das Script zu durchlaufen oder wiederaufzunehmen.</li>
</ul>
<p><b>Funktionen:</b></p>
<ul>
  <li>Syntax hervorgehoben, schreibgesch&uuml;tzte Ansicht des Quellcodes.</li>
  <li>Haltepunkte.</li>
  <li>Ausf&uuml;hren, Betreten, &Uuml;berspringen, Verlassen.</li>
  <li>Aufrufliste anzeigen.</li>
  <li>Variablen &uuml;berpr&uuml;fen - Variablenname ausw&auml;hlen, Rechtsklick, Inspect.</li>
</ul>
<p><b>Probleme:</b></p>
<ul>
  <li>Die Benutzeroberfl&auml;che reagiert nicht auf die Benutzereingaben, w&auml;hrend das Script ausgef&uuml;hrt wird.</li>
  <li>Keine Mechanismen verf&uuml;gbar, Variablen aufzulisten oder deren Werte zu setzen.</li>
</ul>

<h2>DBGp-Plugin f&uuml;r Notepad++</h2>
<p>Ein DBGp-Client ist als Plugin f&uuml;r <a href="http://notepad-plus-plus.org/">Notepad++</a> verf&uuml;gbar. Es wurde f&uuml;r PHP entwickelt, aber funktioniert auch gut mit AutoHotkey_L.</p>
<p><b>Download:</b> Siehe <a href="http://sourceforge.net/apps/mediawiki/notepad-plus/index.php?title=Plugin_Central#D">Verzeichnis f&uuml;r Notepad++-Plugins</a>.</p>
<p><b>Verwendung:</b></p>
<ul>
  <li>Notepad++ starten.</li>
  <li>DBGp-Plugin mittels <i>Erweiterungen</i>, <i>DBGp</i>, <i>Config ...</i> konfigurieren.
    <p><b>Hinweis:</b> Dateizuordnung muss konfiguriert werden. Die meisten Benutzer werden nicht aus der Ferne Debuggen, deshalb einfach ein H&auml;kchen auf <i>Bypass all mapping (local windows setup)</i> setzen.</p>
  </li>
  <li>Debugger-Fenster mithilfe der Werkzeugleiste oder <b>Erweiterungen</b>, <b>DBGp</b>, <b>Debugger</b> anzeigen lassen.</li>
  <li>Script-Datei f&uuml;rs Debuggen &ouml;ffnen.</li>
  <li>Mindestens einen Haltepunkt setzen.</li>
  <li>AutoHotkey_L /Debug ausf&uuml;hren.</li>
  <li>Verwendet die Debugger-Werkzeugleiste oder Tastenkombinationen, um den Debugger zu steuern.</li>
</ul>
<p><b>Funktionen:</b></p>
<ul>
  <li>Syntax-Hervorhebung, wenn vom Benutzer konfiguriert.</li>
  <li>Haltepunkte.</li>
  <li>Run, Step Over/Into/Out, Run to cursor, Stop.</li>
  <li>Lokale und globale Variablen anzeigen.</li>
  <li>Benutzerdefinierte Variablen &uuml;berwachen.</li>
  <li>Aufrufliste anzeigen.</li>
  <li>Maus &uuml;ber einer Variable positionieren, um deren Inhalt einzusehen.</li>
  <li>Frei konfigurierbare Tastenkombinationen - Einstellungen, Tastatur ..., Plugin commands.</li>
</ul>
<p><b>Probleme:</b></p>
<ul>
  <li>Der Inhalt einer Variable kann nicht mit der Maus abgerufen werden, wenn der Variablenname nur aus einem Buchstaben besteht - Bei dem Variablennamen "a" beispielsweise versucht das Plugin, " a" oder "a " abzurufen.</li>
  <li>Beim Positionieren einer Maus auf ein Text versucht das Plugin, eine Variable abzurufen, selbst wenn der Text ung&uuml;ltige Zeichen enth&auml;lt.</li>
  <li>Notepad++ wird instabil, wenn property_get fehlschl&auml;gt, was besonders problematisch im Hinblick auf oben ist. Als &Uuml;bergangsl&ouml;sung sendet AutoHotkey_L eine leere Eigenschaft anstelle eines Fehlercodes, wenn eine nicht vorhandene oder ung&uuml;ltige Variable angefordert wird.</li>
</ul>

<h2>Script-basierte Clients</h2>
<p>Es ist eine script-basierte <a href="http://l.autohotkey.net/DBGP.ahk">DBGp-Bibliothek</a> und zwei einfache Clients f&uuml;r Entwicklungszwecke verf&uuml;gbar:</p><ul>
  <li><a href="http://l.autohotkey.net/dbgp_console.ahk">dbgp_console.ahk</a>: Einfacher Kommandozeilen-Client.</li>
  <li><a href="http://l.autohotkey.net/dbgp_test.ahk">dbgp_test.ahk</a>: Veranschaulicht asynchrones Debuggen.</li>
</ul>

<h2>Kommandozeilen-Client</h2>
<p>Ein Kommandozeilen-Client ist bei <a href="http://xdebug.org/">xdebug.org</a> erh&auml;ltlich, das jedoch nicht f&uuml;r die meisten Benutzer geeignet ist, da es ein angemessenes Verst&auml;ndnis f&uuml;r DBGp (das Protokoll) erfordert.</p>

<h2>Andere</h2>
<p>Es stehen eine Reihe von anderen DBGp-Clients zur Verf&uuml;gung, die jedoch noch nicht mit AutoHotkey_L getestet wurden. Eine Liste kann bei <a href="http://xdebug.org/docs/remote">Xdebug: Dokumentation</a> gefunden werden.</p>

</body>
</html>