<!DOCTYPE HTML>
<html>
<head>
<title>Changelog von AutoHotkey Basic</title>
<meta name="keywords" content="Grundlage">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
  <div id="content"> 
    <script src="navbar/NavScript.js" type="text/javascript"></script> 
    <script type="text/javascript">WriteNavLink(0);</script>
    <h1>&Auml;nderungen und neue Funktionen</h1>
    <p>Dieses Changelog betrifft nur AutoHotkey. Siehe <a href="AHKL_ChangeLog.htm">Changelog von AutoHotkey_L</a>.</p>
    <h2>1.0.48.05 - 25. September 2009</h2>
    <p>Absturz von <a href="commands/PostMessage.htm">SendMessage und PostMessage</a> behoben, wenn wParam oder lParam weggelassen wird (fehlerhaft seit 1.0.48.04). [Danke, Lexikos]</p>
    <h2>1.0.48.04 - 25. September 2009</h2>
    <p>Fehler in <a href="commands/StringSplit.htm">StringSplit</a> behoben, damit er wieder richtig in <a href="Functions.htm">Funktionen</a> eines <a href="Scripts.htm#ahk2exe">kompilierten Scripts</a> funktioniert (fehlerhaft seit 1.0.35.01). [Danke, engunneer &amp; Lexikos]</p>
    <p>Fehler in <a href="commands/Send.htm#SendPlayDetail">SendPlay</a> behoben, damit er nicht mehr auf das Loslassen der Win-Taste warten muss, bevor eine L-Tasteneingabe gesendet wird (fehlerhaft seit 1.0.48.01). [Danke, Lexikos]</p>
    <p>Fehler mit <a href="Variables.htm#EndChar">A_EndChar</a> behoben, damit sie g&uuml;ltig ist, wenn die <a href="Hotstrings.htm#b0">B0-Option</a> vorhanden ist, und leer ist, wenn kein <a href="Hotstrings.htm#EndChars">Endzeichen</a> vorhanden ist (fehlerhaft seit 1.0.44.09). [Danke, Al2000]</p>
    <p>Fehler mit <a href="commands/FormatTime.htm">FormatTime</a> behoben, damit ein g&uuml;ltiger Zeitstempel zur&uuml;ckgegeben wird, selbst wenn der angegebene Monat au&szlig;erhalb des Bereichs liegt (fehlerhaft seit 1.0.48.00). [Danke, silveredge78]</p>
    <p>Fehler mit <a href="commands/FileCreateDir.htm">FileCreateDir</a> behoben, damit ein f&uuml;hrender Backslash unterst&uuml;tzt wird, selbst wenn es nur der eine Backslash ist; z. B. \Verzeichnis. [Danke, jaco0646]</p>
    <p>Fehler mit <a href="commands/GuiControl.htm">GuiControl</a>/<a href="commands/GuiControlGet.htm">GuiControlGet</a>/<a href="commands/Gui.htm">Gui</a>/<a href="commands/PostMessage.htm">SendMessage</a> behoben, damit sie zuverl&auml;ssig funktionieren, selbst wenn sie eine <a href="commands/RegisterCallback.htm">Callback</a>- oder <a href="commands/OnMessage.htm">OnMessage</a>-Funktion ausl&ouml;sen. [Danke, Lexikos]</p>
    <p>Fehler mit <a href="commands/RegExMatch.htm">RegExMatch()</a> behoben, damit nicht zu wenige Ersetzungen erzeugt werden, falls nach einer &Uuml;bereinstimmung mit einem leeren String eine &Uuml;bereinstimmung mit einem nicht leeren String erfolgt.</p>
    <p>"While()" wird nun als <a href="commands/While.htm">Schleife</a> erkannt und nicht mehr als <a href="Functions.htm">Funktion</a>. [Danke, Crash&amp;Burn]</p>
    <p><a href="commands/URLDownloadToFile.htm">URLDownloadToFile</a> verbessert, um FTP und Gopher zu unterst&uuml;tzen. [Danke, Lexikos]</p>
    <p><a href="commands/FileAppend.htm#stdout">stdout/Sternchen-Modus</a> von FileAppend verbessert, um sofort in die Standardausgabe zu schreiben. [Danke, Lexikos]</p>
    <p>Zus&auml;tzliche Unterst&uuml;tzung f&uuml;r "If % Ausdruck". [Danke, kenomby]</p>
    <h2>1.0.48.03 - 3. Mai 2009</h2>
    <p>Fehler mit "<a href="commands/ListLines.htm">ListLines On</a>" behoben, damit der aktuellste Log-Eintrag im Zeilenverlauf nicht gel&ouml;scht wird. [Danke, Lexikos]</p>
    <p>Fehler mit <a href="commands/ListView.htm">ListView</a> behoben, damit es richtig auf das Ziehen der Maus reagiert, falls der <a href="commands/SetTimer.htm">Timer</a> l&auml;uft. [Danke, Solar]</p>
    <p>Fehler mit <a href="Hotkeys.htm#keyup">Up-Tasten-Hotkeys</a> behoben: Wenn eins davon erstellt wird, w&auml;hrend seine Tasten gedr&uuml;ckt gehalten werden, dann l&ouml;st das Loslassen der Taste nicht den falschen Hotkey aus. [Danke, Peter &amp; engunneer]</p>
    <h2>1.0.48.02 - 19. April 2009</h2>
    <p><a href="commands/Gosub.htm">Gosub</a> und <a href="commands/GroupActivate.htm">GroupActivate</a> ge&auml;ndert und deren Fehler behoben, d. h. wenn eine Funktion eine <a href="Functions.htm#GosubPublic">externe/&ouml;ffentliche Subroutine</a> aufruft, dann wird diese Subroutine alle dynamischen Variablen als globale Variablen behandeln, sowie das GUI-Verhalten au&szlig;erhalb der Funktion erhalten. [Danke, kenomby &amp; Lexikos]</p>
    <p>Performance von <a href="Variables.htm#True">True</a>/<a href="Variables.htm#False">False</a>/<a href="Variables.htm#EventInfo">A_EventInfo</a> in <a href="Variables.htm#Expressions">Ausdr&uuml;cken</a> verbessert, indem sie als Integer anstelle von Strings behandelt werden.</p>
    <h2>1.0.48.01 - 15. April 2009</h2>
    <p>Ge&auml;ndert: Windows Vista und h&ouml;her: Hotkeys mit einer Win-Taste (z. B. #a) warten auf LWin und RWin, bis sie losgelassen werden, bevor ein beliebiger Text mit einer L-Tastatureingabe gesendet wird. Dadurch wird solch ein Hotkey daran gehindert, den PC zu sperren. Dieses Verhalten gilt f&uuml;r jeden Send-Modus, au&szlig;er <a href="commands/Send.htm#SendPlayDetail">SendPlay</a> (weil es das nicht braucht) und <a href="commands/Send.htm#blind">Blind-Modus</a>.</p>
    <p>Fehler mit <a href="commands/LoopFile.htm#LoopFileExt">A_LoopFileExt</a> behoben, damit sie leer ist, falls ein Dateiname keine Erweiterung, aber ein Punkt im Pfadnamen hat. [Danke, Yek-Toho-Tua].</p>
    <p>Fehler mit der <a href="Variables.htm#AssignOp">Zuweisung</a> von Integer behoben, die 19 oder 20 Zeichen lang sind, damit sie wie vor v1.0.48 funktionieren. [Danke, Laszlo &amp; Lexikos]</p>
    <p>Fehler mit <a href="Functions.htm#define">Funktionsdefinitionen</a> behoben, damit sie richtig in einem <a href="commands/Block.htm">Block</a> funktionieren. [Danke, rmarko]</p>
    <p>Performance von <a href="Variables.htm#Index">A_Index</a> in <a href="Variables.htm#Expressions">Ausdr&uuml;cken</a> verbessert, indem es als ein Integer anstelle eines Strings behandelt wird.</p>
    <p>Performance von <a href="commands/IfIn.htm">If Variable [not] in/contains</a> verbessert. [von Lexikos entwickelt]</p>
    <p><a href="commands/ListLines.htm">ListLines</a> mit der Option zum Aktivieren oder Deaktivieren der Zeilenerfassung erweitert. [Danke, kenomby &amp; ruespe]</p>
    <h2>1.0.48 - 25. Februar 2009</h2>
    <p><strong>Kompatibilit&auml;t:</strong> Flie&szlig;kommazahlen in Variablen sind nun genauer, dass am ehesten die Abw&auml;rtskompatibilit&auml;t beeinflusst. Scripts, die sich auf kleine Unterschiede in der Genauigkeit verlassen, m&uuml;ssen jeweils nachgepr&uuml;ft und aktualisiert werden, oder deren Kompatibilit&auml;t mithilfe von "<a href="commands/SetFormat.htm">SetFormat Float</a>" (z. B. SetFormat, Float, 0.6) <em>irgendwo</em> im Script verbessert werden. "SetFormat Float" deaktiviert die h&ouml;here Genauigkeit, verliert aber dadurch die neue schnellere Performance f&uuml;r Flie&szlig;kommazahlen.</p>
    <p><strong>Performance:</strong> Das Hauptthema dieser Version ist es, die Performance zu erh&ouml;hen. Fast alle Scripts sollten schneller laufen, besonders solche, die h&auml;ufig <a href="Variables.htm#Expressions">Ausdr&uuml;cke</a> verwenden und Integer-Berechnungen/Vergleiche durchf&uuml;hren (kann bis zu dreimal schneller sein). Um die volle Leistung zu erreichen, sollte die Verwendung von SetFormat vermieden oder der <a href="commands/SetFormat.htm#Fast">Fast-Modus von SetFormat</a> verwendet werden.</p>
    <h3>Performance-Verbesserungen</h3>
    <p><a href="Variables.htm#Expressions">Ausdr&uuml;cke</a> und <a href="Functions.htm">Funktionsaufrufe</a> sind st&auml;rker kompiliert, damit sie schneller sind (besonders komplexe Integer-Ausdr&uuml;cke, einschlie&szlig;lich solche mit <a href="Variables.htm#comma">Kommas</a>).</p>
    <p>Bin&auml;rzahlen werden f&uuml;r Variablen zwischengespeichert, um Umwandlungen von/in Strings zu verhindern. Dadurch werden numerische Operationen mit Variablen viel schneller ausgef&uuml;hrt.</p>
    <p>Direkt vorhandene Integer in Ausdr&uuml;cken und Mathematik-/Vergleichsbefehle werden mit Bin&auml;rzahlen ersetzt, damit sie schneller sind; z. B. X+5 und "If x &gt; 5"..</p>
    <p><a href="commands/Loop.htm">LOOPs</a>, <a href="commands/IfExpression.htm">IFs</a> und <a href="commands/Else.htm">ELSEs</a> mit Bl&ouml;cke (geschweifte Klammern) sind schneller, weil sie die &ouml;ffnende Klammer '{' &uuml;berspringen. Nebeneffekt: die Klammer '{' wird in <a href="commands/ListLines.htm">ListLines</a> weggelassen.</p>
    <p>Die Performance von der <a href="misc/Threads.htm">Thread-Erstellung</a> ist verbessert, um schnell ausf&uuml;hrende Threads in <a href="commands/OnMessage.htm">OnMessage()</a>, <a href="commands/RegisterCallback.htm">RegisterCallback()</a> und <a href="commands/Gui.htm#Events">GUI events</a> zu unterst&uuml;tzen.</p>
    <h3>&Auml;nderungen, die vorhandenen Scripts beeinflussen k&ouml;nnten (au&szlig;er die oben genannten genaueren Flie&szlig;kommazahlen)</h3>
    <p>Wenn "<a href="commands/SetFormat.htm#Integer">SetFormat, Integer, Hex</a>" aktiv ist, dann wird der zuweisende direkt vorhandene Dezimal-Integer auch in hexadezimal umgewandelt. Normalerweise ist das nur ein Anzeigeproblem.</p>
    <p>F&uuml;r die Performance von <a href="commands/OnMessage.htm">OnMessage()</a> wird die Nachrichtennummer und HWND als Standardnummer empfangen, anstatt bedingungslos als Hex-Wert angezeigt zu werden. Normalerweise ist das nur ein Anzeigeproblem.</p>
    <p>Um verschiedene Verbesserungen in der Performance zu erreichen, verwenden Scripts nun etwas mehr Speicher (im Verh&auml;ltnis zur Anzahl der Variablen und Ausdr&uuml;cke).</p>
    <p>"<a href="commands/IfIs.htm#time">If Variable is time</a>" und andere Verwendungen von YYYYMMDDHHMISS-Zeitstempel ge&auml;ndert und deren Fehler behoben, damit Monate au&szlig;erhalb des Bereichs von 1 bis 12 erkannt werden. [Danke, Nick]</p>
    <p><a href="Functions.htm#DynCall">Dynamische Funktionsaufrufe</a> ge&auml;ndert und deren Fehler behoben, damit mehr Parameter, als von der Funktion definiert, &uuml;bergeben werden k&ouml;nnen, wodurch die Parameter ausgewertet, anstatt verworfen zu werden. [von Lexikos entwickelt]</p>
    <h3>Weitere Verbesserungen</h3>
    <p><a href="Functions.htm#IsFunc">IsFunc()</a>-Funktion hinzugef&uuml;gt, damit erkannt werden kann, ob eine Funktion <a href="Functions.htm#DynCall">dynamisch aufgerufen</a> wurde. [von Lexikos entwickelt]</p>
    <p><a href="commands/While.htm">While-Schleife</a> hinzugef&uuml;gt, die Befehle wiederholt, bis deren <a href="Variables.htm#Expressions">Ausdruck</a> als falsch gewertet wird. [von Lexikos entwickelt]</p>
    <p><a href="Functions.htm#AssumeStatic">Statisch-angenommener Modus</a> f&uuml;r Funktionen hinzugef&uuml;gt. [von Lexikos entwickelt]</p>
    <p>Interne Variablen <a href="Variables.htm#IsPaused">A_IsPaused</a> und <a href="Variables.htm#IsCritical">A_IsCritical</a> hinzugef&uuml;gt. [von Lexikos entwickelt]</p>
    <p><a href="Functions.htm#NumPut">NumPut()</a> verbessert, um UInt64 in z. B. <a href="commands/DllCall.htm#unsigned">DllCall()</a> zu unterst&uuml;tzen. [Danke, Sean]</p>
    <p>Verbesserte Mausrad-Unterst&uuml;tzung mithilfe von <a href="Hotkeys.htm#Wheel">WheelLeft und WheelRight</a> als Hotkeys und in <a href="commands/Send.htm">Send</a>, <a href="commands/Click.htm">Click</a> und vergleichbare Befehle. WheelLeft/Right funktionieren aber nicht auf Betriebssystemen &auml;lter als Windows Vista. [von Lexikos entwickelt]</p>
    <p>Der Kompressor f&uuml;r ein <a href="Scripts.htm#ahk2exe">kompilierten Script</a> wurde von UPX 3.00 auf 3.03 aktualisiert.</p>
    <h3>Fehlerbehebungen</h3>
    <p>Fehler behoben, wodurch der Zeit&uuml;berschreitung-Parameter von <a href="commands/MsgBox.htm#Timeout">MsgBox</a> nicht verwendet werden konnte, falls der Text-Parameter einen Ausdruck mit Kommas hatte.</p>
    <p>Fehler mit "<a href="commands/Menu.htm#Delete">Menu, Delete, Men&uuml;punkt-als-Untermen&uuml;</a>" behoben, damit das zugewiesene Untermen&uuml; nicht unterbrochen wird. [Danke, animeaime &amp; Lexikos]</p>
    <p>Fehler mit einem <a href="commands/GuiControls.htm#Hotkey">GUI-Hotkey-Steuerelement</a> behoben, damit nutzbare Hotkey-Namen auch f&uuml;r tote Hotkeys zur&uuml;ckgegeben werden (z. B. "^" anstelle von Zirkumflex). [Danke, DerRaphael]</p>
    <p>Fehler mit <a href="commands/RegDelete.htm">RegDelete</a> behoben, damit nicht der ganze Hauptschl&uuml;ssel gel&ouml;scht wird, falls der Unterschl&uuml;ssel leer ist. [Danke, Icarus]</p>
    <p>Fehler mit <a href="commands/LoopReg.htm">Registrierung-Schleifen</a> behoben, damit Unterschl&uuml;sselnamen l&auml;nger als 259 (selten) unterst&uuml;tzt werden. In fr&uuml;heren Versionen wurden solche Unterschl&uuml;ssel &uuml;bersprungen oder verursachten einen Absturz. [Danke, Krzysztof Sliwinski &amp; Eggi]</p>
    <p>Fehler mit FileSelectFolder behoben, damit es mithilfe <a href="commands/FileSelectFolder.htm#NewDialog">einer Option</a> f&uuml;r BartPE/WinPE kompatibel ist. [Danke, markreflex]</p>
    <p>Fehler mit <a href="LastFoundWindow.htm#id">Fenster-/Steuerelement-IDs (HWNDs)</a> behoben, die in seltenen F&auml;llen falsch mit 0xFFFFFFFF anstelle von 0x begannen. [Danke, Micahs]</p>
    <p>Fehler behoben, wodurch <a href="commands/Send.htm">Send-Befehle</a> die Down/Up-Modifikatoren mit dem "}"-Zeichen nicht verwenden konnten. [Danke, neovars]</p>
    <h2>1.0.47.06 - 9. M&auml;rz 2008</h2>
    <p>Absturz beim gleichzeitigen Aufruf einer <a href="Functions.htm">Funktion</a> und eines optionalen <a href="Functions.htm#ByRef">ByRef-Parameters</a> behoben, wobei der Parameter von einem <a href="misc/Threads.htm">Thread</a> weggelassen wurde, jedoch nicht von einem anderen. [Danke, DeathByNukes]</p>
    <p>Fehler mit "<a href="commands/Menu.htm#MainWindow">Menu, Tray, MainWindow</a>" behoben, damit die Men&uuml;punkte im View-Men&uuml; des Hauptfensters aktiviert werden. [Danke, Lexikos]</p>
    <p><a href="Functions.htm#DynCall">Dynamischer Funktionsaufruf</a> hinzugef&uuml;gt. [von Lexikos entwickelt]</p>
    <h2>1.0.47.05 - 21. November 2007</h2>
    <p>Fehler mit dem <a href="commands/Sort.htm">Sort-Befehl</a> behoben: 1) Fehler mit der <a href="commands/Sort.htm#callback">"function"-Option</a> behoben, damit sie sich nicht falsch verh&auml;lt, wenn sie die letzte Option in der Liste ist; 2) Fehler mit der <a href="commands/Sort.htm#unique">"unique"-Option</a> behoben, damit das letzte Element bei einem Trennzeichen mit CRLF als Duplikat erkannt werden kann, selbst wenn es nicht mit CRLF endet; 3) Fehler mit der "unique"-Option behoben, damit sie nicht ein Trennzeichen danach anf&uuml;gt, falls das letzte Element ein Duplikat ist. [Danke, Roland]</p>
    <p>Fehler mit <a href="commands/RegExMatch.htm">RegExMatch()</a> und <a href="commands/RegExReplace.htm">RegExReplace()</a> behoben, damit sie korrekte Ergebnisse ausgeben, falls der Heuhaufen und die Ausgabevariable die selbe Variable sind. [Danke, Superfraggle]</p>
    <p>Fehler behoben, wodurch ein Parameter nicht &uuml;bergeben werden konnte, der eine Variable mit zugewiesenem <a href="misc/Clipboard.htm#ClipboardAll">ClipboardAll</a> enth&auml;lt. [Danke, Joy2DWorld &amp; Lexikos]</p>
    <p>RegEx/PCRE von 7.0 auf 7.4 aktualisiert. Eine Zusammenfassung der wichtigsten &Auml;nderungen kann auf <a href="http://www.pcre.org/news.txt">www.pcre.org/news.txt</a> gefunden werden. Alle Details der &Auml;nderungen und Fehlerbehebungen k&ouml;nnen auf <a href="http://www.pcre.org/changelog.txt">www.pcre.org/changelog.txt</a> gefunden werden.</p>
    <p>GUI-Steuerelement "<a href="commands/GuiControls.htm#Tab">Tab2</a>" hinzugef&uuml;gt, dass seltene Fehler beim Neuzeichnen im originalen "Tab"-Steuerelement behebt (z. B. ein GUI-Fenster mithilfe eines Klicks auf eine Steuerelement-Bildlaufleiste aktivieren). Das urspr&uuml;ngliche Tab-Steuerelement wird f&uuml;r die Abw&auml;rtskompatibilit&auml;t beibehalten, weil "Tab2" nach seine Steuerelemente in die Navigationsreihenfolge der Tab-Taste hinzugef&uuml;gt wird. [Danke, Xander]</p>
    <h2>1.0.47.04 - 28. August 2007</h2>
    <p>Fehler mit <a href="Hotkeys.htm#keyup">Up-Tasten-Hotkeys</a> wie "a up::" behoben, um das Dr&uuml;cken der "a"-Taste erst zu blockieren, wenn die <a href="commands/_IfWinActive.htm">#IfWin-Kriterien</a> des Hotkeys erf&uuml;llt werden. [Danke, Roland]</p>
    <p>Fehler mit der Funktion <a href="Functions.htm#Round">Round(Variable, NegativeZahl)</a> behoben, die durch eine 1 in selten F&auml;llen deaktiviert war. [Danke, Icarus]</p>
    <p>Absturz von Scripts behoben, die wegen einer verwaisten IF-Anweisung mit einem Syntaxfehler endeten (fehlerhaft seit 1.0.47.00). [Danke, msgbox vom deutschen Forum]</p>
    <p>Fehler-Dialogfenster von "GetClipboardData" beseitigt. Stattdessen wird ein leerer String ermittelt, wenn die Daten innerhalb der <a href="commands/_ClipboardTimeout.htm">#ClipboardTimeout</a>-Periode nicht abrufbar sind. [Danke, ManaUser &amp; Sean]</p>
    <p><a href="commands/GuiControls.htm#Checkbox">CheckBox</a> und <a href="commands/GuiControls.htm#Radio">Radio-Schaltf&auml;chen</a> verwenden nun standardm&auml;&szlig;ig "<a href="commands/Gui.htm#Wrap">keinen Zeilenumbruch</a>", wenn keine Breite, H&ouml;he oder CR/LF-Zeichen angegeben sind. Dadurch werden Anzeigeprobleme bei bestimmten ungew&ouml;hnlichen DPI-Einstellungen gel&ouml;st. [Danke, Boskoop]</p>
    <h2>1.0.47.03 - 1. August 2007</h2>
    <p>Fehler mit <a href="Variables.htm#Expressions">Ausdr&uuml;cken</a> behoben, damit direkt vorhandene hexadezimale Zahlen m&ouml;glich sind, die mit einem "E" enden; z. B. fn(-0xe). [Danke, Laszlo]</p>
    <p>Fehler mit der <a href="commands/Block.htm">Block-Syntax</a> behoben, damit ein <a href="Functions.htm">Funktionsaufruf</a> unmittelbar auf der rechten Seite von "}" m&ouml;glich ist. [Danke, Roland]</p>
    <h2>1.0.47.02 - 19. Juli 2007</h2>
    <p>Fehler mit der <a href="commands/GuiControls.htm#EditNum">Number-Option</a> des Edit-Steuerelements behoben, damit eine Sprechblase richtig angezeigt wird, falls der Benutzer etwas anderes als eine Zahl eingibt. [Danke, tfcahm]</p>
    <p>Fehler mit der WM_TIMER-Nachricht behoben, damit sie erst blockiert wird, wenn sie an das Hauptfenster des Scripts gesendet wird. [Danke, tfcahm]</p>
    <p>Fehler mit <a href="Hotkeys.htm#wildcard">Platzhalter-Hotkeys</a> behoben, damit sie nicht das <a href="Hotkeys.htm#Tilde">Tilde-Verhalten</a> erhalten, falls der gleiche Hotkey mit einem Tilde-Zeichen im Script vorhanden ist. [Danke, Lexikos]</p>
    <p>Fehler mit <a href="Functions.htm#DeclareInit">Deklarationsinitialisierungen</a> behoben, damit unsichtbare Zeichen am Ende von direkt vorhandenen Zahlen nicht beibehalten werden. Dadurch sind nun Leerzeichen zwischen einem schlie&szlig;enden Anf&uuml;hrungszeichen und dem n&auml;chsten Komma m&ouml;glich. [Danke, Hardeep]</p>
    <h2>1.0.47.01 - 8. Juli 2007</h2>
    <p>Fehler mit <a href="commands/RunAs.htm">RunAs</a> behoben, damit es nicht abst&uuml;rzt oder sich falsch verh&auml;lt, falls eine Dom&auml;ne angegeben wird. [Danke, Markus Frohnmaier]</p>
    <p><a href="Variables.htm#Operators">Relationale Operatoren</a> ge&auml;ndert, damit sie Integer ausgeben, falls die Eingabevariablen Flie&szlig;kommazahlen sind; z. B. <em>1.0 &lt; 2.0</em> ergibt 1 anstelle von 1.0. [Danke, Lexikos]</p>
    <h2>1.0.47 - 19. Juni 2007</h2>
    <p>Zus&auml;tzliche Unterst&uuml;tzung f&uuml;r <a href="Functions.htm#lib">Funktionsbibliotheken</a>, damit ein Script eine Funktion in einer externen Datei aufrufen kann, ohne dabei <a href="commands/_Include.htm">#Include</a> zu verwenden.</p>
    <p><a href="commands/RegisterCallback.htm">RegisterCallback()</a> hinzugef&uuml;gt, damit eine Maschinencode-Adresse erstellt werden kann, die den Aufruf einer <a href="commands/RegisterCallback.htm">Funktion</a> in das Script umleitet. [von Jonathan Rennison (JGR) entwickelt]</p>
    <p><a href="Functions.htm#NumGet">NumGet()</a> und <a href="Functions.htm#NumPut">NumPut()</a> hinzugef&uuml;gt, um Bin&auml;rzahlen schneller als Extract/InsertInteger zu ermitteln/speichern.</p>
    <p><a href="commands/Sort.htm#callback">Sort</a> mit der Option erweitert, benutzerdefiniertes Sortieren nach den Kriterien der Callback-Funktion durchzuf&uuml;hren. [Danke, Laszlo]</p>
    <p><a href="commands/OnMessage.htm">OnMessage()</a> mit der Option erweitert, mehrere <a href="misc/Threads.htm">Threads</a> gleichzeitig zu erm&ouml;glichen. [Danke, JGR]</p>
    <p>Critical mit der Option erweitert, den <a href="commands/Critical.htm#Interval">Intervall f&uuml;r die Nachrichten&uuml;berpr&uuml;fung</a> zu &auml;ndern, damit die Zuverl&auml;ssigkeit f&uuml;r einige Verwendungen verbessert wird. [Danke, Majkinetor und JGR]</p>
    <p><a href="commands/Critical.htm">Critical</a> ge&auml;ndert, damit <a href="commands/SetBatchLines.htm">SetBatchLines -1</a> wirksam ist.</p>
    <p>Fehlermeldungen von <a href="commands/_ErrorStdOut.htm">#ErrorStdOut</a> ge&auml;ndert, damit sie ein Leerzeichen vor dem Doppelpunkt haben. [Danke, Toralf]</p>
    <p>Fehler mit <a href="commands/OnMessage.htm">OnMessage()-Funktionen</a> behoben, die eine lokale Variable zur&uuml;ckgeben, damit sie die Zahl in dieser Variable und nicht eine 0 zur&uuml;ckgeben.</p>
    <p>Fehler mit internen Variablen behoben, die m&ouml;glicherweise abst&uuml;rzten, falls sie auf die Registrierung zugriffen (z. B. A_AppData, A_Desktop, A_MyDocuments, A_ProgramFiles). [Danke, tekl]</p>
    <h2>1.0.46.17 - 31. Mai 2007</h2>
    <p>Fehler mit <a href="Variables.htm#UserName">A_UserName</a> behoben (fehlerhaft seit 1.0.46.16).</p>
    <h2>1.0.46.16 - 30. Mai 2007</h2>
    <p>Fehler mit "<a href="commands/GuiControls.htm#Tab">Gui, Tab, TabName</a>" behoben, dass nach einem vorherigen "Gui Tab" verwendet wurde. [Danke, Toralf]</p>
    <p>SetTimer verbessert, damit sie mit <a href="commands/SetTimer.htm#once">negativen Perioden</a> nur einmal ausgef&uuml;hrt werden. [Danke, Majkinetor]</p>
    <p>"<a href="commands/GuiControlGet.htm#Hwnd">GuiControlGet Hwnd</a>" hinzugef&uuml;gt, dass noch modularer/dynamischer ist, um das HWND eines Steuerelements abzurufen. [Danke, Majkinetor]</p>
    <p>Interne Variablen <a href="Variables.htm#ThisLabel">A_ThisLabel</a> und <a href="Variables.htm#ThisFunc">A_ThisFunc</a> hinzugef&uuml;gt, die die Namen des/der aktuell ausgef&uuml;hrten Labels/Funktion enthalten. [Danke, Titan &amp; Majkinetor]</p>
    <h2>1.0.46.15 - 9. Mai 2007</h2>
    <p>Fehler mit <a href="commands/GuiControl.htm">GuiControl</a>, <a href="commands/GuiControlGet.htm">GuiControlGet</a> und "Gui <a href="commands/ListView.htm#GuiLV">ListView</a>/<a href="commands/TreeView.htm#GuiTV">TreeView</a>" behoben, damit <a href="Functions.htm#static">statische Variablen</a> und <a href="Functions.htm#ByRef">ByRefs</a> unterst&uuml;tzt werden, die auf globale/statische Variablen verweisen. [Danke, Peter]</p>
    <p>Fehler mit <a href="commands/FileInstall.htm">FileInstall</a> behoben, dass den <a href="commands/Random.htm">Random-Befehl</a> dazu brachte, die Zuf&auml;lligkeit in <a href="Scripts.htm#ahk2exe">kompilierten Scripts</a> aufzuheben. [Danke, Velocity]</p>
    <p>Die Gr&ouml;&szlig;e von <a href="Scripts.htm#ahk2exe">kompilierten Scripts</a> mithilfe von UPX 3.0 auf etwa 16 KB reduziert. [Der Dank geht an atnbueno, f&uuml;r die Entdeckung der optimalen Befehlszeilenoptionen]</p>
    <h2>1.0.46.14 - 2. Mai 2007</h2>
    <p>requireAdministrator-Flag dem Installer hinzugef&uuml;gt, um eine Warnmeldung in Windows Vista zu verhindern. [Danke, Roussi Nikolov]</p>
    <h2>1.0.46.13 - 1. Mai 2007</h2>
    <p>Fehler mit <a href="Hotkeys.htm">Hotkeys</a> wie <strong>*x</strong> behoben, damit sie ausgef&uuml;hrt werden, selbst wenn <strong>x</strong> auch ein Hotkey ist, der aufgrund von <a href="commands/_IfWinActive.htm">#IfWin</a> verhindert wird. [Danke, Joy2DWorld &amp; Engunneer]</p>
    <p><a href="Functions.htm#optional">Optionale Parameter</a> verbessert, damit sie direkt vorhandene Strings bzw. Strings mit Anf&uuml;hrungszeichen als Standardwerte akzeptieren.</p>
    <p><a href="Functions.htm#ByRef">ByRef-Parameter</a> mit der F&auml;higkeit erweitert, <a href="Functions.htm#optional">optional</a> zu sein (d. h. sie k&ouml;nnen Standardwerte akzeptieren). [Danke, Corrupt]</p>
    <h2>1.0.46.12 - 24. April 2007</h2>
    <p>Fehler behoben, wodurch eine direkt vorhandene wissenschaftliche Notationszahl mit einer 0 am Anfang (z. B. 0.15e+1) nicht erkannt wurde. [Danke, Laszlo]</p>
    <h2>1.0.46.11 - 23. April 2007</h2>
    <p>Fehler behoben, wodurch ein <a href="Functions.htm">Funktionsaufruf</a> nicht als erstes Element in bestimmte <a href="Variables.htm#comma">kommagetrennte Ausdr&uuml;cke</a> verwendet werden konnte. [Danke, Majkinetor]</p>
    <p>Fehler mit Fenstertitel wie "ahk_id %ControlHwnd%" im FindString/Choice/List von <a href="commands/ControlGet.htm">ControlGet</a>, und im Add/Delete/Choose von <a href="commands/Control.htm">Control</a> behoben. [Danke, Freighter &amp; PhiLho]</p>
    <p>Flie&szlig;komma-Unterst&uuml;tzung verbessert, um eine wissenschaftliche Notation zu erkennen; z. B. 1.2e-5 (der Dezimalpunkt ist zwingend erforderlich). Ebenso wurde "<a href="commands/SetFormat.htm#sci">SetFormat Float</a>" mit der Option erweitert, eine wissenschaftliche Notation auszugeben. [Danke, Laszlo]</p>
    <h2>1.0.46.10 - 22. M&auml;rz 2007</h2>
    <p>Fehler mit <a href="commands/StringSplit.htm">StringSplit</a> innerhalb von lokal-angenommenen <a href="Functions.htm">Funktionen</a> behoben, damit ein lokales <a href="misc/Arrays.htm">Array</a> erstellt wird, selbst wenn AusgabeArray0 global anstelle von lokal vorhanden ist. [Danke, KZ]</p>
    <p>Die <a href="commands/ListView.htm#ItemChanged">Element-&auml;ndernde Benachrichtigung ("I")</a> verbessert, um mithilfe von ErrorLevel zu kennzeichnen, ob das Element ausgew&auml;hlt/nicht mehr ausgew&auml;hlt ist, fokussiert/nicht mehr fokussiert ist und/oder markiert/nicht mehr markiert ist. [Danke, foom]</p>
    <p>Eine zus&auml;tzliche Sicherheitsstufe f&uuml;r <a href="Scripts.htm#ahk2exe">kompilierte Scripts</a> hinzugef&uuml;gt. Es wird empfohlen, Scripts mit sensiblen Daten oder Quellcodes mit der <a href="Scripts.htm#ahk2exeCmd">/NoDecompile-Option</a> neu zu kompilieren.</p>
    <h2>1.0.46.09 - 4. M&auml;rz 2007</h2>
    <p>Fehler mit tief sitzenden "<a href="commands/SetExpression.htm">:=</a>" in Ausdr&uuml;cken behoben, wenn damit einer <a href="Functions.htm#Locals">lokalen Variable</a> das Ergebnis einer rekursiven <a href="Functions.htm">Funktion</a> zugewiesen wurde (fehlerhaft seit 1.0.46.06). [Danke, Laszlo]</p>
    <p>Fehler behoben, wodurch bestimmte <a href="Variables.htm#ternary">tern&auml;re Ausdr&uuml;cke</a> nicht an <a href="Functions.htm#ByRef">ByRef-Parameter</a> &uuml;bergeben werden konnten. [Danke, Titan]</p>
    <p>Fehler mit "<a href="commands/GuiControlGet.htm">GuiControlGet</a>, Ausgabevariable, Pos" behoben, damit die Ausgabevariable nicht leer gemacht wird. [Danke, PhiLho]</p>
    <p>Fortsetzungsbereiche ge&auml;ndert und deren Fehler behoben, damit die <a href="Scripts.htm#CommentOption">Kommentar-Option</a> nicht die <a href="Scripts.htm#LTrim">LTrim-Option</a> erzwingt. [Danke, Titan]</p>
    <p><a href="http://msdn2.microsoft.com/en-us/library/01cfys9z.aspx">Terminal-Server-Awareness-Flag</a> wurde f&uuml;r AutoHotkey.exe und kompilierte Scripts wieder deaktiviert. Das verbessert die Flexibilit&auml;t und Abw&auml;rtskompatibilit&auml;t (siehe <a href="http://www.autohotkey.com/forum/topic16041.html">Diskussion</a> im Forum).</p>
    <h2>1.0.46.08 - 7. Februar 2007</h2>
    <p>Die Unzuverl&auml;ssigkeit von <a href="Variables.htm#ComSpec">ComSpec</a> und <a href="Variables.htm#env">Umgebungsvariablen</a> in Windows 9x behoben (fehlerhaft seit v1.0.46.07). [Danke, Loriss]</p>
    <p>Ge&auml;ndert: Wenn AutoHotkey.exe ohne angegebenes Script ausgef&uuml;hrt wird, dann wird von jetzt an die Datei AutoHotkey.ahk in <a href="Variables.htm#MyDocuments">Eigene Dokumente</a> ausgef&uuml;hrt (oder fragt den Benutzer, sie zu erstellen). Die einzige Ausnahme ist, wenn AutoHotkey.ini im Arbeitsverzeichnis vorhanden ist, in diesem Fall wird das alte Ausf&uuml;hrungsverhalten von dieser Datei verwendet.</p>
    <p><a href="commands/DllCall.htm">DllCall</a> verbessert, um einen Integer anstelle eines Funktionsnamens zu unterst&uuml;tzen, die als Adresse eines Funktionsaufrufs interpretiert wird. [Danke, Sean]</p>
    <h2>1.0.46.07 - 23. Januar 2007</h2>
    <p>Absturz von falsch benannten <a href="misc/Arrays.htm">dynamischen Variablen</a> auf der linken Seite einer Zuweisung mit einem Gleichheitszeichen behoben (fehlerhaft seit v1.0.45). [Danke, PhiLho]</p>
    <p>Fehler mit der "Option 2" von <a href="commands/FileMoveDir.htm">FileMoveDir</a> behoben, damit sie richtig funktioniert, selbst wenn das Verzeichnis sowohl umbenannt als auch verschoben wurde. [Danke, bugmenot]</p>
    <p>Fehler behoben, wodurch ein Variable-<a href="Functions.htm#ByRef">ByRef</a> nicht &uuml;bergeben werden konnte, wenn der gleiche Ausdruck von leer auf nicht-leer ge&auml;ndert wurde (falls <a href="commands/_NoEnv.htm">#NoEnv</a> abwesend ist). [Danke, Joy2DWorld]</p>
    <p><a href="commands/DllCall.htm#LastError">A_LastError</a> von DllCall ge&auml;ndert, um nur die &Auml;nderungen vom Script und nicht von AutoHotkey selbst widerzuspiegeln. [Danke, Azerty]</p>
    <h2>1.0.46.06 - 16. Januar 2007</h2>
    <p>Kleine Fehlerbehebungen und Verbesserungen f&uuml;r <a href="misc/RegEx-QuickRef.htm">regul&auml;re Ausdr&uuml;cke</a> mithilfe der Aktualisierung von PCRE 6.7 auf 7.0. Eine der wichtigsten Verbesserungen ist die "`a"-Option, die jeden Typ eines Zeilenumbruchs erkennt (n&auml;mlich `r, `n oder `r`n). Ebenso bedeutet die \R-Schutzsequenz "jeder beliebige Zeilenumbruch". Siehe auch: <a href="http://www.pcre.org/changelog.txt">Ausf&uuml;hrliches PCRE-Changelog</a></p>
    <p>Alle <a href="commands/Control.htm">Steuerelement-Befehle</a> und <a href="commands/StatusBarWait.htm">StatusBarWait</a> ge&auml;ndert und deren Fehler behoben, damit sie <a href="commands/SetTitleMatchMode.htm#RegEx">SetTitleMatchMode RegEx</a> ber&uuml;cksichtigen, wie in der Hilfe dokumentiert.</p>
    <p>Funktion <a href="commands/RegExReplace.htm">RegExReplace()</a> ge&auml;ndert, damit sie bei einem Fehler den originalen/unver&auml;nderten String anstelle von "" zur&uuml;ckgibt.</p>
    <p>Ge&auml;ndert: <a href="http://msdn2.microsoft.com/en-us/library/01cfys9z.aspx">Terminal-Server-Awareness-Flag</a> f&uuml;r AutoHotkey.exe und <a href="Scripts.htm#ahk2exe">kompilierte Scripts</a> aktiviert.</p>
    <p>Performance f&uuml;r die <a href="Variables.htm#AssignOp">Zuweisung</a> langer Strings verbessert, die von <a href="Functions.htm">benutzerdefinierten Funktionen</a> zur&uuml;ckgegeben werden. [Danke, Laszlo]</p>
    <h2>1.0.46.05 - 4. Januar 2007</h2>
    <p>Fehler mit dem <a href="commands/Input.htm">Input-Befehl</a> behoben, damit benannte Endtasten wie {F9} funktionieren, selbst wenn die Umschalt-Taste gedr&uuml;ckt gehalten wird (fehlerhaft seit v1.0.45). [Danke, Halweg]</p>
    <p>Fehler behoben, wodurch "<a href="commands/Gui.htm#Show">Gui Show</a>" das GUI-Fenster nicht fokussiert werden konnte, falls das Tray-Men&uuml; verwendet wurde, um sowohl das Script neu zu laden als auch das GUI-Fenster anzuzeigen. [Danke, Rnon]</p>
    <p>Fehler behoben, wodurch einige Typen von <a href="Variables.htm#AssignOp">Zuweisungen (:=)</a> nicht an einem <a href="Functions.htm#ByRef">ByRef</a>-Parameter &uuml;bergeben werden konnten. [Danke, Laszlo]</p>
    <h2>1.0.46.04 - 2. Januar 2007</h2>
    <p>Fehler behoben, wodurch das Ergebnis von einer <a href="Variables.htm#AssignOp">Zuweisung (:=)</a> nicht an einem <a href="Functions.htm#ByRef">ByRef</a>-Parameter &uuml;bergeben werden konnte. [Danke, Titan]</p>
    <h2>1.0.46.03 - 18. Dezember 2006</h2>
    <p>Fehler mit der Sortierung von Flie&szlig;kommazahlen im <a href="commands/ListView.htm">ListView</a> behoben, um die korrekte Reihenfolge zu erzeugen. [Danke, oldbrother/Goyyah/Laszlo]</p>
    <h2>1.0.46.02 - 17. Dezember 2006</h2>
    <p>Fehler mit <a href="Variables.htm#env">Umgebungsvariablen</a> behoben, damit sie richtig als Eingabevariablen f&uuml;r verschiedene Befehle funktionieren, wie z. B. <a href="commands/StringLen.htm">StringLen</a> und <a href="commands/StringReplace.htm">StringReplace</a> (fehlerhaft seit 1.0.44.14). [Danke, Camarade_Tux]</p>
    <h2>1.0.46.01 - 15. Dezember 2006</h2>
    <p><strong>HINWEIS:</strong> Obwohl diese Version ausgiebig getestet wurde, wurden mehrere systemnahe Verbesserungen vorgenommen. Wenn der Benutzer irgendwelche aufgabenkritische Scripts hat, dann sollte er sie nochmals &uuml;berpr&uuml;fen und/oder einige Wochen warten, bis einige Bugs behoben wurden.</p>
    <p>Fehler mit kommagetrennte <a href="Functions.htm#DeclareInit">Deklarationsinitialisierungen</a> wie "<em>local x = 1, y = 2</em>" behoben, damit sie funktionieren, selbst wenn unmittelbar darunter eine IF/ELSE/LOOP-Anweisung erfolgt.</p>
    <p>Fehler bei <a href="Variables.htm#comma">kommagetrennte Ausdr&uuml;cke</a> mit dem Element ganz links als Zuweisung, damit es vor den anderen anstatt danach erfolgt. [Danke, Laszlo]</p>
    <p><a href="Functions.htm">Funktionsaufrufe</a> ge&auml;ndert und deren Fehler behoben, damit jegliche &Auml;nderungen an <a href="Variables.htm#ref">dynamischen Variablennamen</a>, <a href="Variables.htm#env">Umgebungsvariablen</a> und <a href="Variables.htm#BuiltIn">interne Variablen</a> (z. B. <a href="misc/Clipboard.htm">Clipboard</a>) immer f&uuml;r nachfolgende Bereiche des Ausdrucks sichtbar sind, der diese aufgerufen hat.</p>
    <p>Ge&auml;ndert: Wenn unmittelbar nach einem <a href="Variables.htm#comma">Komma f&uuml;r mehrere Anweisungen</a> eine Variable und ein Gleichheitszeichen erfolgt, dann wird das Gleichheitszeichen als <a href="commands/SetExpression.htm">":="-Zuweisung</a> behandelt. Die folgende Beispiele sind Zuweisungen: <em>x:=1, y=2, a=b=c</em></p>
    <p><a href="Variables.htm#comma">Kommagetrennte Ausdr&uuml;cke</a> wurden ge&auml;ndert, um folgende Effekte zu erzielen: 1) der Operator <strong>/=</strong> ganz links wird <a href="Variables.htm#divide">wirklich dividiert</a> anstatt <a href="commands/EnvDiv.htm">EnvDiv</a>; 2) leere Werte werden in mathematischen Ausdr&uuml;cken nicht als 0 behandelt (daher sind deren Ergebnisse leer).</p>
    <p>Performance von <a href="Variables.htm#Expressions">Ausdr&uuml;cken</a> um 5 bis 20 % verbessert (je nach Typ).</p>
    <p><a href="Variables.htm#AssignOp">Neue Zuweisungsoperatoren wie <strong>.=</strong></a> verbessert, um die <a href="misc/Clipboard.htm">Clipboard-Variable</a> zu unterst&uuml;tzen (auch in <a href="Variables.htm#comma">kommagetrennten Ausdr&uuml;cke</a>).</p>
    <p>Der <a href="Variables.htm#AssignOp">"<strong>.=</strong>"-Operator</a> wurde verbessert, damit er nicht mehr ein Leerzeichen auf der linken Seite ben&ouml;tigt.</p>
    <p>GUI-Steuerelemente verbessert, damit sie <a href="Functions.htm#static">statische Variablen</a> als ihre <a href="commands/Gui.htm#var">zugewiesene Variablen</a> akzeptieren (vorher waren nur globale Variablen erlaubt).</p>
    <p><a href="commands/Gui.htm#HwndOutputVar">HwndAusgabevariable</a>-Option zu "Gui Add" hinzugef&uuml;gt, die das HWND eines Steuerelements in die Ausgabevariable speichert. [Danke, Corrupt &amp; Toralf]</p>
    <h2>1.0.46 - 29. November 2006</h2>
    <p><strong>HINWEIS:</strong> Obwohl diese Version ausgiebig getestet wurde und voraussichtlich kein vorhandenes Script unbrauchbar wird, wurden mehrere systemnahe Verbesserungen vorgenommen. Wenn der Benutzer irgendwelche aufgabenkritische Scripts hat, dann sollte er sie nochmals &uuml;berpr&uuml;fen und/oder einige Wochen warten, bis einige Bugs behoben wurden.</p>
    <p><a href="Functions.htm#SubStr">SubStr()</a>-Funktion hinzugef&uuml;gt, die eine bestimmte Zeichenanzahl an einer bestimmten Position im String abruft.</p>
    <p>Zuweisungsoperatoren <a href="Variables.htm#AssignOp">//=, <strong>.</strong>=, |=, &amp;=, ^=, &gt;&gt;= und &lt;&lt;=</a> hinzugef&uuml;gt, die &uuml;berall in Ausdr&uuml;cken verwendet werden k&ouml;nnen. Zum Beispiel wird mit <em>Variable .= "abc"</em> der String "abc" an den aktuellen Inhalt der <em>Variable</em> angef&uuml;gt.</p>
    <p>Volle Unterst&uuml;tzung f&uuml;r die Operatoren <a href="Variables.htm#AssignOp">:=, ++, --, +=, -=, *= und /=</a> in Ausdr&uuml;cken (vorher konnten sie nur als Operator ganz links in der Zeile verwendet werden). Alle <a href="Variables.htm#AssignOp">Zuweisungsoperatoren</a> (besonders <a href="Variables.htm#IncDec">++ und --</a>) verhalten sich wie in C, falls deren Ergebnis von einem anderen Operator verwendet wird.</p>
    <p><a href="Variables.htm#ternary">Tern&auml;rer Operator (?:)</a> hinzugef&uuml;gt, der als Kurzfassung von <a href="commands/IfExpression.htm">If-Else-Anweisung</a> dient. Zum Beispiel wird mit <em>Variable := x&gt;y ? 2 : 3</em> der Wert 2 zugewiesen, wenn x gr&ouml;&szlig;er als y ist; ansonsten wird 3 zugewiesen.</p>
    <p>Zus&auml;tzliche Unterst&uuml;tzung f&uuml;r <a href="Variables.htm#comma">kommagetrennte Ausdr&uuml;cke</a>, damit eine Zeile mehrere Zuweisungen, Funktionsaufrufe und andere Ausdr&uuml;cke enthalten kann. [Danke, PhiLho &amp; Titan]</p>
    <p><a href="Functions.htm#DeclareInit">Variablendeklarationen</a> verbessert, damit Initialisierungen auf derselben Zeile unterst&uuml;tzt werden. Hinweis: Die Initialisierung einer <a href="Functions.htm#static">statischen Variable</a> erfolgt nur einmal, bevor das Script ausgef&uuml;hrt wird.</p>
    <p><a href="Scripts.htm#continuation">Zeilenfortsetzung</a> verbessert, damit alle Ausdrucksoperatoren unterst&uuml;tzt werden. Zum Beispiel wird eine Zeile, die mit "?" oder "+" beginnt, automatisch an der oberen Zeile angef&uuml;gt.</p>
    <p>Verbesserte Performance f&uuml;r die Operatoren <a href="Variables.htm#concat">"<strong>.</strong>"</a> und <a href="Variables.htm#concat">"<strong>.=</strong>"</a>, damit sie so schnell wie die Prozentzeichen-Methode f&uuml;r das Anf&uuml;gen eines Strings sind.</p>
    <p>Ausdr&uuml;cke verbessert, um mehr Typen von <a href="Variables.htm#unary">aufeinanderfolgene einstellige Operatoren</a> wie <strong>!!</strong>Var zu unterst&uuml;tzen. [Danke, Laszlo]</p>
    <p><a href="commands/Critical.htm">Critical</a> ge&auml;ndert, damit Nachrichten weniger oft &uuml;berpr&uuml;ft werden (20 anstelle von 10 ms), dass die Zuverl&auml;ssigkeit von oft aufgerufenen <a href="commands/OnMessage.htm">OnMessage-Funktionen</a> verbessert. [Danke, Majkinetor]</p>
    <p>Ge&auml;ndert: Eine Variable mit dem Namen "?" ist aufgrund des neuen <a href="Variables.htm#ternary">tern&auml;ren Operators</a> nicht mehr in Ausdr&uuml;cken g&uuml;ltig.</p>
    <p>Fehler mit <a href="Hotkeys.htm">Hotkeys</a> behoben, damit ":::" (Doppelpunkt als ein Hotkey) und ": &amp; x" (Doppelpunkt als <a href="Hotkeys.htm#combo">Hotkey-Pr&auml;fix</a>) unterst&uuml;tzt werden.</p>
    <p>Fehler mit dem Installer behoben, damit psapi.dll vom AutoHotkey-Ordner entfernt wird (au&szlig;er in Windows NT4). Dadurch wird ein Konflikt mit dem Internet Explorer 7 verhindert. [Vielen Dank an alle, die das gemeldet haben]</p>
    <h2>1.0.45.04 - 15. November 2006</h2>
    <p>Absturz in Windows 9x behoben, wenn ein Script nicht ausgef&uuml;hrt wird (z. B. aufgrund eines Syntaxfehlers) (fehlerhaft seit v1.0.45). [Danke, rogerg]</p>
    <p>"<a href="commands/Control.htm">Control Style|ExStyle</a>" ge&auml;ndert, damit ErrorLevel eine 0 anstelle einer 1 meldet, falls die angeforderte Style-&Auml;nderung nicht notwendig war, da sie bereits aktiv war.</p>
    <p><a href="commands/_Include.htm">#Include</a> verbessert, damit <a href="Variables.htm#AppData">%A_AppData%</a> und <a href="Variables.htm#AppDataCommon">%A_AppDataCommon%</a> unterst&uuml;tzt werden. [Danke, tekl]</p>
    <h2>1.0.45.03 - 12. November 2006</h2>
    <p>Absturz durch <a href="commands/LoopFile.htm">dateilesenden Schleifen</a> behoben, wenn die Rekursion in Pfaden l&auml;nger als 259 Zeichen erfolgt. Dar&uuml;ber hinaus werden solche Pfade und Dateien nun in dateilesenden Schleifen, <a href="commands/FileSetAttrib.htm">FileSetAttrib</a> und <a href="commands/FileSetTime.htm">FileSetTime</a> ignoriert (&uuml;bersprungen). [Danke, PhilR]</p>
    <p>Fehler mit <a href="Functions.htm">Funktionen</a> behoben, die sich selbst aufrufen und ihren <a href="Functions.htm#Locals">lokalen Variablen</a> das Ergebnis zuweisen (fehlerhaft seit v1.0.45). [Danke, bjennings]</p>
    <p>Absturz von Scripts behoben, die <a href="misc/RegEx-QuickRef.htm">regul&auml;re Ausdr&uuml;cke</a> mit Kompilierungsfehler enthalten. [Danke, PhiLho]</p>
    <p>Fehler mit <a href="commands/GuiControl.htm">GuiControl</a> behoben, damit <a href="commands/GuiControls.htm#Checkbox">CheckBox</a>-Steuerelemente erst in den dreifachen Zustand umgewandelt werden, wenn es erforderlich ist. [Danke, JBensimon]</p>
    <p><a href="commands/URLDownloadToFile.htm">URLDownloadToFile</a> ge&auml;ndert, damit ein User-Agent von "AutoHotkey" anstelle eines leeren Strings f&uuml;r den Server angek&uuml;ndigt wird. [Danke, jaco0646]</p>
    <p><a href="Scripts.htm#continuation">Fortsetzungsbereiche</a> verbessert, damit Semikolon-Kommentare innerhalb des Bereichs mithilfe des Optionwortes <em>Comments</em> unterst&uuml;tzt werden.</p>
    <h2>1.0.45.02 - 8. November 2006</h2>
    <p>Fehler mit <a href="commands/StringLower.htm">StringUpper</a> und <a href="commands/StringLower.htm">StringLower</a> behoben, damit sie funktionieren, falls die Ausgabevariable die Zwischenablage ist (fehlerhaft seit v1.0.45). [Danke, songsoverruins]</p>
    <p>Fehler mit den Hotkeys ~Alt, ~Control und ~Shift behoben, damit sie beim Dr&uuml;cken anstatt beim Loslassen ausgef&uuml;hrt werden (fehlerhaft seit v1.0.44).<br>
      Hintergrund: Ohne das Tilde-Zeichen werden Alt/Strg/Umschalt beim Loslassen ausgef&uuml;hrt, um die &Uuml;bernahme von der linken und rechten Taste zu verhindern. Aber ein bestimmter linker/rechter Hotkey wie LAlt oder RShift wird beim Dr&uuml;cken ausgef&uuml;hrt.</p>
    <h2>1.0.45.01 - 7. November 2006</h2>
    <p>Fehler mit <a href="commands/FileReadLine.htm">FileReadLine</a> und <a href="commands/FileSelectFile.htm">FileSelectFile</a> behoben, damit sie nicht abst&uuml;rzen oder sich falsch verhalten, falls sie von anderen <a href="misc/Threads.htm">Threads</a> unterbrochen werden (fehlerhaft seit v1.0.45). [Danke, toralf]</p>
    <p>Fehler mit <a href="commands/RegExMatch.htm">RegExMatch()</a> behoben, damit bei keiner &Uuml;bereinstimmung benannte Teilausdr&uuml;cke richtig auf "" im Ausgabe-Array gesetzt werden. [Danke, PhiLho]</p>
    <p>Fehler mit der "J"-Option von <a href="commands/RegExMatch.htm">RegExMatch()</a> behoben, damit doppelte benannte Teilausdr&uuml;cke richtig im Ausgabe-Array geschrieben werden. [Danke, PhiLho]</p>
    <p><a href="commands/SetWorkingDir.htm">SetWorkingDir</a> und <a href="commands/_Include.htm">#Include Verzeichnisname</a> ge&auml;ndert, damit sie auch bei Hauptverzeichnissen wie C: erfolgreich sind, denen ein Backslash fehlt.</p>
    <p><a href="commands/DllCall.htm">DllCall()</a> verbessert, damit eine Warnmeldung angezeigt wird, wenn die aufgerufene Funktion eine Variable mit einer Kapazit&auml;t von 0 schreibt.</p>
    <h2>1.0.45 - 4. November 2006</h2>
    <p><strong>HINWEIS:</strong> Obwohl diese Version ausgiebig getestet wurde und voraussichtlich kein vorhandenes Script unbrauchbar wird, wurden mehrere systemnahe Verbesserungen vorgenommen. Wenn der Benutzer irgendwelche aufgabenkritische Scripts hat, dann sollte er sie nochmals &uuml;berpr&uuml;fen und/oder einige Wochen warten, bis einige Bugs behoben wurden.</p>
    <p>Zus&auml;tzliche Unterst&uuml;tzung f&uuml;r <a href="misc/RegEx-QuickRef.htm">regul&auml;re Ausdr&uuml;cke</a> mithilfe von <a href="commands/RegExMatch.htm">RegExMatch()</a>, <a href="commands/RegExReplace.htm">RegExReplace()</a> und <a href="commands/SetTitleMatchMode.htm#RegEx">SetTitleMatchMode RegEx</a>. [Danke, Philip Hazel &amp; PhiLho]</p>
    <p>Verbesserte Performance und Speichernutzung von <a href="commands/StringReplace.htm">StringReplace</a>.</p>
    <p>Verbesserte Performance des <a href="commands/SetExpression.htm">":="-Operators</a> f&uuml;r Ausdr&uuml;cke und Funktionen mit langen Strings.</p>
    <p><a href="commands/ControlClick.htm">ControlClick</a> mit der neuen Option "NA" erweitert, die das Aktivieren des Zielfensters verhindert (dieser Modus verbessert auch die Zuverl&auml;ssigkeit in einigen F&auml;llen). Dar&uuml;ber hinaus ist dokumentiert, dass <a href="commands/SetControlDelay.htm">SetControlDelay -1</a> die Zuverl&auml;ssigkeit von ControlClick in einigen F&auml;llen verbessern kann. [Danke, nnesori]</p>
    <p><a href="commands/GuiControls.htm#Button">GUI-Schaltfl&auml;chen</a> verwenden nun standardm&auml;&szlig;ig "<a href="commands/Gui.htm#Wrap">keinen Zeilenumbruch</a>", wenn keine Breite, H&ouml;he oder CR/LF-Zeichen angegeben wurde. Dadurch k&ouml;nnen Anzeigeprobleme von Schaltfl&auml;chen bei bestimmten Desktop-Themen gel&ouml;st werden.</p>
    <p>Fehler mit "<a href="commands/Transform.htm#HTML">Transform HTML</a>" f&uuml;r die folgenden Zeichen behoben: &amp;`n&gt;&lt;&lt;/p&gt;</p>
    <p>Fehlinterpretationen von Zeilen behoben, die mit "If not is" wie "If not <strong>Is</strong>Done" beginnen.</p>
    <p>Fehler behoben, wodurch "<a href="commands/Gui.htm#Show">Gui Show</a>" ein Fenster nicht vertikal nach unten verschieben kann, wo dessen unterste Pixelreihe jetzt ist.</p>
    <p>Fehler behoben, wodurch <a href="commands/GroupActivate.htm">GroupActivate</a> nicht als einzige Zeile unterhalb eines IFs oder ELSEs verwenden werden kann.</p>
    <p>Fehler behoben, wodurch der <a href="commands/Input.htm">Input-Befehl</a> nicht in der Lage ist, zwischen Endtasten mit geschweiften Klammern umschlossen und deren (nicht) umgeschaltete Gegenst&uuml;cke zu unterscheiden; z. B. '{' anstelle von '['. [Danke, Laszlo]</p>
    <p>Besucht <a href="http://www.autohotkey.com/changelog/">www.autohotkey.com/changelog/</a> f&uuml;r die &auml;lteren &Auml;nderungen und eine Liste f&uuml;r geplante Funktionen.</p>
  </div>
</div>
</body>
</html>