<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Tastenliste (Tastatur, Maus und Joystick) f&uuml;r Hotkeys und Makros</title>
<meta name="description" content=
"These are the keyboard keys, mouse buttons, and joystick buttons that can be used to create hotkeys and macros.">
<meta name="keywords" content="keyboard,keys,key,mouse,buttons,button,joystick,create,hotkeys,hotkey,macros">
<meta http-equiv="Content-Type" content="text/html; charset=us-ascii">
<link rel="alternate" type="application/rss+xml" title="AutoHotkey Forum RSS" href="../forum/rss.php">
<link href="css/default.css" rel="stylesheet" type="text/css">
</head>
<body>
<h1>Tastenliste (Tastatur, Maus und Joystick)</h1>
<h2>Maus <span class="ver">(Maus-Hotkeys ben&ouml;tigen Windows NT/2000/XP oder h&ouml;her)</span></h2>
<p>LButton - die linke Maustaste<br>
RButton - die rechte Maustaste<br>
MButton - die mittlere Maustaste oder Mausradtaste</p>
<p>WheelDown - Mausrad nach unten drehen (Richtung Benutzer)<br>
WheelUp - in die entgegengesetzte oben genannte Richtung<br>
WheelLeft und WheelRight <span class="ver">[v1.0.48+]</span> - beide ben&ouml;tigen eine Maus mit der Funktion, nach links
oder rechts zu scrollen, die jedoch nicht in Betriebssystemen &auml;lter als Windows Vista funktionieren.<br>
(Siehe <a href="Hotkeys.htm#Wheel">Mausrad-Hotkeys</a>, um zu erkennen, wie weit das Rad gedreht wurde)</p>
<p>Nur in Windows 2000/XP oder h&ouml;her unterst&uuml;tzt:<br>
XButton1 - eine Taste, die nur bei bestimmten M&auml;usen vorkommt<br>
XButton2 - eine Taste, die nur bei bestimmten M&auml;usen vorkommt</p>
<h2>Tastatur</h2>
<p><strong>Hinweis: Die Namen der Buchstaben- und Zahlentasten entsprechen einzelne Buchstaben oder Ziffern. Zum Beispiel: b
ist die Taste "b" und 5 die Taste "5".</strong></p>
<p>Space - die Leertaste<br>
Tab<br>
Enter (oder Return)<br>
Escape (oder Esc)<br>
Backspace (oder BS)</p>
<p>Delete (oder Del)<br>
Insert (oder Ins)<br>
Home<br>
End<br>
PgUp<br>
PgDn<br>
Up<br>
Down<br>
Left<br>
Right</p>
<p>ScrollLock<br>
CapsLock<br>
NumLock</p>
<table border="0">
<tr>
<td><u><strong>Numlock AN</strong></u></td>
<td><u><strong>Numlock AUS</strong></u></td>
</tr>
<tr>
<td>Numpad0</td>
<td>NumpadIns</td>
</tr>
<tr>
<td>Numpad1</td>
<td>NumpadEnd</td>
</tr>
<tr>
<td>Numpad2</td>
<td>NumpadDown</td>
</tr>
<tr>
<td>Numpad3</td>
<td>NumpadPgDn</td>
</tr>
<tr>
<td>Numpad4</td>
<td>NumpadLeft</td>
</tr>
<tr>
<td>Numpad5</td>
<td>NumpadClear</td>
</tr>
<tr>
<td>Numpad6</td>
<td>NumpadRight</td>
</tr>
<tr>
<td>Numpad7</td>
<td>NumpadHome</td>
</tr>
<tr>
<td>Numpad8</td>
<td>NumpadUp</td>
</tr>
<tr>
<td>Numpad9</td>
<td>NumpadPgUp</td>
</tr>
<tr>
<td>NumpadDot (.)</td>
<td>NumpadDel</td>
</tr>
<tr>
<td>NumpadDiv (/)</td>
<td>NumpadDiv (/)</td>
</tr>
<tr>
<td>NumpadMult (*)</td>
<td>NumpadMult (*)</td>
</tr>
<tr>
<td>NumpadAdd (+)</td>
<td>NumpadAdd (+)</td>
</tr>
<tr>
<td>NumpadSub (-)</td>
<td>NumpadSub (-)</td>
</tr>
<tr>
<td>NumpadEnter</td>
<td>NumpadEnter</td>
</tr>
</table>
<p><br>
<strong>F1 bis F24</strong> - Die 12 oder mehr Funktionstasten auf der oberen Seite bei den meisten Tastaturen.</p>
<p>AppsKey - das ist die Taste, die das Rechtsklick-Kontextmen&uuml; aufruft.</p>
<p>LWin - die linke Windows-Logo-Taste<br>
RWin - die rechte Windows-Logo-Taste. Hinweis: Im Gegensatz zu Control/Alt/Shift gibt es keine allgemeine/neutrale Win-Taste,
da dass vom Betriebssystem nicht unterst&uuml;tzt wird.<br>
Control (oder Ctrl)<br>
Alt<br>
Shift<br>
Hinweis: Die Hotkeys Shift::, Alt:: und Control:: werden erst beim Loslassen ausgef&uuml;hrt, solange sie nicht das
Tilde-Pr&auml;fix wie zum Beispiel ~Alt:: haben. Im Gegensatz dazu wird ein bestimmter linker oder rechter Hotkey wie
<strong>L</strong>Alt:: ausgef&uuml;hrt, sobald er gedr&uuml;ckt wird.</p>
<p>Hinweis: Gr&ouml;&szlig;tenteils werden die n&auml;chsten 6 Tasten von Windows 95/98/Me <strong>nicht</strong>
unterst&uuml;tzt. Verwendet stattdessen die oben genannten Tasten:<br>
LControl (oder LCtrl) - die linke STRG-Taste<br>
RControl (oder RCtrl) - die rechte STRG-Taste<br>
LShift - die linke UMSCHALT-Taste<br>
RShift - die rechte UMSCHALT-Taste<br>
LAlt - die linke ALT-Taste<br>
RAlt - Hinweis: Wenn die aktuelle Tastaturbelegung ein AltGr anstelle von RAlt aufweist, dann kann sie wahrscheinlich als
Hotkey-Pr&auml;fix mithilfe von <strong>&lt;^&gt;!</strong> verwendet werden, wie <a href="Hotkeys.htm#AltGr">hier</a>
beschrieben. Dar&uuml;ber hinaus kann mit "LControl &amp; RAlt::" AltGr selbst zum Hotkey gemacht werden.</p>
<p>PrintScreen<br>
CtrlBreak<br>
Pause<br>
Break -- Da das ein Synonym f&uuml;r Pause ist, verwendet ^CtrlBreak anstelle von ^Pause oder ^Break in Hotkeys.</p>
<p>Help - wahrscheinlich auf den meisten Tastaturen gar nicht vorhanden. Sie ist normalerweise nicht das gleiche wie F1.<br>
Sleep - beachtet, dass die Sleep-Taste auf den meisten Tastaturen nicht funktioniert.</p>
<p>Die folgenden Tasten existieren nur auf Multimedia- oder Internet-Tastaturen, die zus&auml;tzliche Tasten haben:<br>
Browser_Back<br>
Browser_Forward<br>
Browser_Refresh<br>
Browser_Stop<br>
Browser_Search<br>
Browser_Favorites<br>
Browser_Home<br>
Volume_Mute<br>
Volume_Down<br>
Volume_Up<br>
Media_Next<br>
Media_Prev<br>
Media_Stop<br>
Media_Play_Pause<br>
Launch_Mail<br>
Launch_Media<br>
Launch_App1<br>
Launch_App2</p>
<p>SCnnn (wobei nnn der Scan-Code einer Taste ist) - Erkennung ungew&ouml;hnlicher Tasten, die oben nicht erw&auml;hnt
wurden. Siehe <a href="#SpecialKeys">Sondertasten</a> f&uuml;r Details.</p>
<p><a name="vk"></a>VKnn (wobei nn ein hexadezimaler virtueller Code einer Taste ist) - Durch diese selten verwendete Methode
ben&ouml;tigen zudem bestimmte Typen von <a href="Hotkeys.htm">Hotkeys</a> den <a href=
"commands/_InstallKeybdHook.htm">Tastatur-Hook</a> nicht mehr. Zum Beispiel verwendet der folgende Hotkey nicht mehr den
Tastatur-Hook, als Nebeneffekt wird aber beim Dr&uuml;cken <em>entweder</em> Home oder NumpadHome ausgel&ouml;st:
<em>^VK24::MsgBox Home oder NumpadHome wurde gedr&uuml;ckt, w&auml;hrend STRG gedr&uuml;ckt gehalten wurde.<br></em>Bekannte
Einschr&auml;nkung: VK-Hotkeys, die den <a href="commands/_InstallKeybdHook.htm">Tastatur-Hook</a> verwenden m&uuml;ssen, wie
*VK24 oder ~VK24, werden nur eine der beiden Tasten ausf&uuml;hren (z. B. NumpadHome, aber nicht Home).<br>
F&uuml;r weitere Informationen &uuml;ber die VKnn-Methode, siehe <a href="#SpecialKeys">Sondertasten</a>.</p>
<h2 id="Joystick">Joystick</h2>
<p><strong>Joy1 bis Joy32</strong>: Die Tasten des Joysticks. Um die aktuellen Tastennummern des Joysticks zu ermitteln,
verwendet das <a href="scripts/JoystickTest.htm">Test-Script</a>. Beachtet, dass <a href=
"Hotkeys.htm">Hotkey-Pr&auml;fixsymbole</a> wie ^ (STRG) und + (UMSCHALT) nicht unterst&uuml;tzt werden (deshalb kann
<a href="commands/GetKeyState.htm">GetKeyState</a> als Ersatz verwendet werden). Beachtet auch, dass die Joystick-Eingaben
immer an das aktive Fenster "&uuml;bergeben" werden, falls dieses Fenster solche Eingaben erkennen kann.</p>
<p>Obwohl die folgenden Joystick-Tastennamen nicht als Hotkeys verwendet werden k&ouml;nnen, k&ouml;nnen sie trotzdem mit
<a href="commands/GetKeyState.htm">GetKeyState</a> benutzt werden:<br>
<strong>JoyX, JoyY und JoyZ</strong>: Die X- (horizontal), Y- (vertikal) und Z-Achse (H&ouml;he/Tiefe) des Joysticks.<br>
<strong>JoyR</strong>: Der Ruder oder vierte Achse des Joysticks.<br>
<strong>JoyU und JoyV</strong>: Die f&uuml;nfte und sechste Achse des Joysticks.<br>
<strong>JoyPOV</strong>: Der Rundblickschalter (POV).<br>
<strong>JoyName</strong>: Der Name des Joysticks oder dessen Treiber.<br>
<strong>JoyButtons</strong>: Die Anzahl der unterst&uuml;tzten Tasten des Joysticks (nicht immer korrekt).<br>
<strong>JoyAxes</strong>: Die Anzahl der unterst&uuml;tzten Achsen des Joysticks.<br>
<strong>JoyInfo</strong>: Erm&ouml;glicht einen String, der beliebig viele folgende Buchstaben beinhaltet, um die Funktion
des Joysticks n&auml;her zubringen: <strong>Z</strong> (hat eine Z-Achse), <strong>R</strong> (hat eine R-Achse),
<strong>U</strong> (hat eine U-Achse), <strong>V</strong> (hat eine V-Achse), <strong>P</strong> (hat einen
Rundblickschalter), <strong>D</strong> (der Rundblickschalter hat eine begrenzte Anzahl an einzelne/eindeutige
Einstellungen), <strong>C</strong> (der Rundblickschalter ist stufenlos/genau). Beispiel-String: ZRUVPD</p>
<p><strong>Mehrere Joysticks</strong>: Wenn der Computer mehrere Joysticks hat und ein beliebiger anstelle des ersten
Joysticks verwendet werden soll, f&uuml;gt die Joystick-Nummer (max. 16) vor dem Steuerungsnamen ein. Zum Beispiel ist 2Joy1
die erste Taste des zweiten Joysticks.</p>
<p><strong>Hinweis</strong>: Wenn ein Script den aktuellen Joystick nicht erkennen kann, dann muss wahrscheinlich eine
Joystick-Nummer au&szlig;er 1 angegeben werden, selbst wenn nur ein Joystick vorhanden ist. Es ist nicht bekannt, wie diese
Situation zustande kommt und ob das normal ist, aber es kann helfen, mit der Joystick-Nummer im <a href=
"scripts/JoystickTest.htm">Test-Script</a> zu experimentieren.</p>
<p><strong>Siehe auch</strong>:<br>
<a href="misc/RemapJoystick.htm">Joystick-Neubelegung</a>: Methoden zum Senden von Tastatureingaben und Mausklicks mit einem
Joystick.<br>
<a href="scripts/JoystickMouse.htm">Joystick-zu-Maus-Script</a>: Joystick als Maus verwenden.</p>
<h2>Tragbare Fernbedienungen</h2>
<p>Mithilfe des <a href="scripts/WinLIRC.htm">WinLIRC-Client-Scripts</a> k&ouml;nnen Signale von tragbaren Fernbedienungen
abgefangen werden.</p>
<h2 id="SpecialKeys">Sondertasten</h2>
<p>Wenn die aktuelle Tastatur oder Maus eine Taste enth&auml;lt, die nicht oben aufgelistet ist, dann kann diese Taste immer
noch zu einem Hotkey gemacht werden, wenn folgende Schritte befolgt werden (ben&ouml;tigt Windows XP/2000/NT oder
h&ouml;her):</p>
<ol>
<li>Stellt sicher, dass mindestens ein Script mit aktiviertem <a href="commands/_InstallKeybdHook.htm">Tastatur-Hook</a>
l&auml;uft. Dazu kann das Hauptfenster des Scripts ge&ouml;ffnet und "View-&gt;Key history" in der Men&uuml;leiste
ausgew&auml;hlt werden, um dessen Existenz zu &uuml;berpr&uuml;fen.</li>
<li>Macht einen Doppelklick auf das Tray-Icon des Scripts, um dessen Hauptfenster zu &ouml;ffnen.</li>
<li>Dr&uuml;ckt die "unbekannte Taste" auf der Tastatur.</li>
<li>W&auml;hlt den Men&uuml;punkt "View-&gt;Key history" aus.</li>
<li>Scrollt bis zum unteren Rand der Seite. Irgendwo unten sind Down- und Up-Ereignisse der Taste. HINWEIS: Einige Tasten
erzeugen keine Ereignisse und sind daher nicht sichtbar. In diesem Fall kann die bestimmte Taste nicht direkt zu einem Hotkey
gemacht werden, weil der Tastatur-Treiber oder die Hardware diese Taste auf eine Stufe behandelt, die zu niedrig f&uuml;r
AutoHotkey ist. F&uuml;r m&ouml;gliche L&ouml;sungen, siehe weiter unten.</li>
<li>Wenn die Taste erkennbar ist, kopiert den 3-stelligen hexadezimalen Wert in der zweiten Spalte der Liste (z. B.
<strong>159</strong>).</li>
<li>Um diese Taste als Hotkey zu definieren, befolgt dieses Beispiel:
<pre>
<strong>SC159::</strong> <em>; Ersetzt 159 mit dem kopierten Wert.</em>
MsgBox, %A_ThisHotKey% wurde gedr&uuml;ckt.
Return
</pre></li>
</ol>
<p><strong>Umgekehrte Richtung</strong>: Damit irgendeine Taste mit einer unbekannten Taste <em>neu belegt</em> wird, befolgt
dieses Beispiel:</p>
<pre>
<em>; Ersetzt 159 mit dem Wert von oben. Ersetzt FF (falls erforderlich) mit dem
; virtuellen Code der Taste, die in der ersten Spalte von "Key History" angezeigt wird.</em>
#c::<a href="commands/Send.htm#vk">Send {vkFFsc159}</a>
</pre>
<p><strong>Alternative L&ouml;sungen</strong>: Wenn die Taste oder Maustaste nicht im Tastenverlauf sichtbar ist, dann kann
Folgendes helfen:</p>
<ol>
<li>
<p>Konfiguriert die Software der Maus oder Tastatur neu (manchmal &uuml;ber Systemsteuerung oder Startmen&uuml; erreichbar),
damit die unbekannte Taste eine andere Tastatureingabe sendet. Solch eine Tastatureingabe kann dann in einem Script als
Hotkey definiert werden. Wenn zum Beispiel eine unbekannte Taste konfiguriert wird, um Steuerung+F1 zu senden, dann kann
diese Taste mithilfe von <em>^F1::</em> im Script indirekt zu einem Hotkey gemacht werden.</p>
</li>
<li>
<p>Versucht es mit <a href="http://www.autohotkey.com/forum/topic6367.html">DllCall</a>: <a href=
"http://www.autohotkey.com/forum/topic6367.html">Unterst&uuml;tzung f&uuml;r Eingabeger&auml;te (HID)</a>. Durchsucht
au&szlig;erdem das <a href="http://www.autohotkey.com/forum/">Forum</a> mit Schl&uuml;sselw&ouml;rtern wie RawInput*.</p>
</li>
<li>
<p>Die folgende Angabe dient als letzter Ausweg und sollte nur bei Verzweiflung ausprobiert werden. Denn die Erfolgschance
ist gering und kann Nebeneffekte verursachen, die nur schwer wieder r&uuml;ckg&auml;ngig gemacht werden k&ouml;nnen:<br>
Deaktiviert oder entfernt jede zus&auml;tzliche Software von der Tastatur oder Maus, oder wechselt zum internen
Standardtreiber des Betriebssystems. Das setzt voraus, dass so ein Treiber f&uuml;r die spezielle Tastatur oder Maus
vorhanden ist und der Benutzer ohne die mitgelieferten Funktionen der Treiber und Software leben kann.</p>
</li>
</ol>
</body>
</html>