<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>#ClipboardTimeout</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>
<script src="../../NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(2);</script>


<h1>#ClipboardTimeout</h1>

<p>Ver&auml;ndert, wie lange das Script versucht, auf die Zwischenablage zuzugreifen, wenn der erste Versuch fehlschl&auml;gt.</p>

<pre class="Syntax">#ClipboardTimeout Millisekunden</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">Millisekunden</td>
    <td width="85%">Die L&auml;nge des Intervalls in Millisekunden. Verwendet -1, damit es unendlich lang versucht wird. Verwendet 0, damit nur ein Versuch durchgef&uuml;hrt wird. Scripts, die diese Direktive nicht enthalten, verwenden eine Zeit&uuml;berschreitung von 1000 ms.</td>
  </tr>
</table>
<h3>Bemerkungen</h3>
<p>Einige Anwendungen halten die Zwischenablage f&uuml;r einen langen Zeitraum offen, weil sie vielleicht eine gro&szlig;e Datenmenge schreiben oder lesen. In solchen F&auml;llen kann die Einstellung erh&ouml;ht werden, damit das Script l&auml;nger wartet, bevor es aufgibt und eine Fehlermeldung anzeigt.</p>
<p>Diese Einstellungen gelten f&uuml;r alle <a href="../misc/Clipboard.htm">Clipboard</a>-Operationen, die Einfachsten davon sind die folgenden Beispiele:<br> Var = %Clipboard%<br> Clipboard = Neuer Text</p>
<p>Immer wenn das Script auf die Verf&uuml;gbarkeit der Zwischenablage wartet, k&ouml;nnen weder neue <a href="../misc/Threads.htm">Threads</a> ausgef&uuml;hrt werden noch <a href="SetTimer.htm">Timer</a> laufen. Wenn der Benutzer allerdings einen <a href="../Hotkeys.htm">Hotkey</a> dr&uuml;ckt, einen <a href="Menu.htm">benutzerdefinierten Men&uuml;punkt</a> ausw&auml;hlt oder eine <a href="Gui.htm">GUI-Aktion</a> (z. B. das Dr&uuml;cken einer Schaltfl&auml;che) durchf&uuml;hrt, dann wird dieses Ereignis f&uuml;r sp&auml;ter zwischengespeichert. Das hei&szlig;t, dass die Subroutine durchgef&uuml;hrt wird, wenn die Zwischenablage wieder verf&uuml;gbar ist.</p>
<p>Diese Direktive bewirkt, dass die Zwischenablage nochmals gelesen wird, wenn der erste Versuch fehlschl&auml;gt (in den vorherigen Versionen wurde nur versucht, die Zwischenablage nochmals zu &ouml;ffnen).</p>
<h3>Verwandte Befehle</h3>
<p><a href="../misc/Clipboard.htm">Clipboard</a>, <a href="Thread.htm">Thread</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">#ClipboardTimeout 2000</pre>

</body>
</html>