<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>#HotkeyModifierTimeout</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>

<h1>#HotkeyModifierTimeout</h1>

<p>Beeinflusst das Verhalten von <a href="../Hotkeys.htm">Hotkey</a>-Modifikatoren: CTRL, ALT, WIN und SHIFT.</p>

<pre class="Syntax">#HotkeyModifierTimeout Millisekunden</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">Millisekunden</td>
    <td width="85%">Die L&auml;nge des Intervalls in Millisekunden. Der Wert kann -1 sein, damit es nie zur Zeit&uuml;berschreitung kommt (Modifikatoren werden immer wieder nach hinten verschoben), oder 0, damit es immer zur Zeit&uuml;berschreitung kommt (Modifikatoren werden nicht hinten verschoben). </td>
  </tr>
</table>
<h3>Bemerkungen</h3>
<p>Diese Direktive <strong>muss nicht</strong> verwendet werden, wenn:</p>
<ul>
  <li>Hotkeys ihre Tastatureingaben mit den Methoden <a href="Send.htm#SendInput">SendInput</a> oder <a href="Send.htm#SendPlay">SendPlay</a> senden. Weil diese Methoden das physische Dr&uuml;cken und Loslassen der Tasten aufschieben, bis der Send-Befehl durchgef&uuml;hrt wurde.</li>
  <li>das Script den Tastatur-Hook installiert hat (kann mit "View-Key history" in der Men&uuml;leiste des Hauptfensters oder mit dem <a href="KeyHistory.htm">KeyHistory</a>-Befehl &uuml;berpr&uuml;ft werden). Weil der Hook verfolgen kann, welche Modifikatoren (ALT/STRG/WIN/UMSCHALT) der Benutzer physisch gedr&uuml;ckt h&auml;lt und nicht die Zeit&uuml;berschreibung verwenden m&uuml;ssen.</li>
</ul>
<p>Zur Veranschaulichung dieser Direktive wird folgendes Beispiel in Betracht gezogen:<br> ^!a::Send, abc</p>
<p>Wenn der <a href="Send.htm">Send</a>-Befehl ausgef&uuml;hrt wird, dann l&auml;sst er zuerst die STRG- und ALT-Tasten los, damit die Zeichen richtig gesendet werden. Nachdem alle Tasten gesendet wurden, wei&szlig; der Befehl nicht mehr, ob er STRG und ALT sicher nach hinten verschieben kann (damit sie passen, falls der Benutzer sie weiterhin gedr&uuml;ckt h&auml;lt). Aber wenn weniger als die angegebene Anzahl von Millisekunden vergangen sind, nimmt der Befehl an, dass der Benutzer nicht die Chance hatte, die Tasten loszulassen und wird sie daher nach hinter verschieben, damit sie ihrem physischen Status entsprechen. Ansonsten werden die Modifikatoren nicht hinten verschoben und der Benutzer muss die Tasten loslassen und erneut dr&uuml;cken, damit sie die gleiche oder eine andere Taste modifizieren k&ouml;nnen.</p>
<p>Die Zeit&uuml;berschreitung sollte auf einen Wert gesetzt werden, der kleiner als die Zeitmenge ist, die der Benutzer ben&ouml;tigt, Modifikatoren eines Hotkeys zudr&uuml;cken, bis sie wieder losgelassen werden. Ansonsten wird der gedr&uuml;ckte Zustand von den Modifikatoren m&ouml;glicherweise wiederhergestellt, auch wenn der Benutzer sie nicht physisch dr&uuml;ckt.</p>
<p>Die Notwendigkeit dieser Direktive kann wie folgt reduziert oder beseitigt werden:</p>
<ul>
  <li>Installiert den Tastatur-Hook mit der Zeile <a href="_InstallKeybdHook.htm">#InstallKeybdHook</a> irgendwo im Script (der Hook wird allerdings nicht von Win9x unterst&uuml;tzt).</li>
  <li>Verwendet die Methoden <a href="Send.htm#SendInput">SendInput</a> oder <a href="Send.htm#SendPlay">SendPlay</a> anstelle der traditionellen Methode <a href="Send.htm#SendEvent">SendEvent</a>.</li>
  <li>Wenn die traditionelle Methode <a href="Send.htm#SendEvent">SendEvent</a> verwendet wird, dann reduziert <a href="SetKeyDelay.htm">SetKeyDelay</a> von 0 auf -1, damit die Tastatureingaben schneller gesendet werden.</li>
</ul>
<p>Wenn diese Direktive nicht angegeben ist, dann wird standardm&auml;&szlig;ig 50 verwendet.</p>
<h3>Verwandte Befehle</h3>
<p><a href="GetKeyState.htm">GetKeyState</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">#HotkeyModifierTimeout 100</pre>

</body>
</html>