<!DOCTYPE HTML>
<html>
<head>
<title>#HotkeyModifierTimeout</title>
<meta name="keywords" content="Befehl, Direktive, Hotkey">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
      <h1>#HotkeyModifierTimeout</h1>
      <p>Beeinflusst das Verhalten von <a href="../Hotkeys.htm">Hotkey</a>-Modifikatoren: CTRL, ALT, WIN und SHIFT.</p>
      <pre class="Syntax">#HotkeyModifierTimeout Millisekunden</pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td style="width: 15%;">Millisekunden</td>
          <td style="width: 85%;">Die L&auml;nge des Intervalls in Millisekunden. Der Wert kann -1 sein, so dass es nie zur Zeit&uuml;berschreitung kommt (Modifikatortasten werden nach Send immer wieder nach unten gedr&uuml;ckt), oder 0, so dass immer eine Zeit&uuml;berschreitung erfolgt (Modifikatortasten werden nicht wieder nach unten gedr&uuml;ckt). </td>
        </tr>
      </table>
      <h3>Bemerkungen</h3>
      <p>Diese Direktive <strong>muss nicht</strong> verwendet werden, wenn:</p>
      <ul>
        <li>Hotkeys ihre Tastatureingaben mit den Methoden <a href="Send.htm#SendInput">SendInput</a> oder <a href="Send.htm#SendPlay">SendPlay</a> senden. Das liegt daran, dass solche Methoden das physische Dr&uuml;cken und Loslassen der Tasten aufschieben, bis der Send-Befehl durchgef&uuml;hrt wurde.</li>
        <li>das Script den Tastatur-Hook installiert hat (kann mit "View-Key history" in der Men&uuml;leiste des Hauptfensters oder mit dem <a href="KeyHistory.htm">KeyHistory</a>-Befehl &uuml;berpr&uuml;ft werden). Das liegt daran, dass der Hook nachverfolgen kann, welche Modifikatortasten (ALT/STRG/WIN/UMSCHALT) der Benutzer physisch gedr&uuml;ckt h&auml;lt, ohne die Zeit&uuml;berschreitung verwenden zu m&uuml;ssen.</li>
      </ul>
      <p>Zur Veranschaulichung dieser Direktive wird folgendes Beispiel in Betracht gezogen:</p>
      <pre>^!a::Send, abc</pre>
      <p>Beim Ausf&uuml;hren des <a href="Send.htm">Send</a>-Befehls wird als erstes die STRG- und ALT-Taste losgelassen, so dass die Zeichen richtig gesendet werden k&ouml;nnen. Der Befehl hat danach keine Ahnung, ob er STRG und ALT sicher wieder nach unten dr&uuml;cken kann (um damit &uuml;bereinzustimmen, ob der Benutzer diese Tasten weiterhin gedr&uuml;ckt h&auml;lt). Wenn allerdings weniger als die angegebene Anzahl von Millisekunden vergangen sind, nimmt der Befehl an, dass der Benutzer nicht die Chance hatte, die Tasten loszulassen und wird sie daher wieder nach unten dr&uuml;cken, damit sie ihrem physischen Status entsprechen. Ansonsten werden die Modifikatortasten nicht wieder nach unten gedr&uuml;ckt. Das hei&szlig;t, dass der Benutzer solche Tasten loslassen und erneut dr&uuml;cken muss, damit sie die gleiche oder eine andere Taste modifizieren k&ouml;nnen.</p>
      <p>Die Zeit&uuml;berschreitung sollte auf einen Wert gesetzt werden, der kleiner ist als die vom Benutzer ben&ouml;tigte Zeit, Modifikatortasten eines Hotkeys zu dr&uuml;cken, bevor diese wieder losgelassen werden. Ansonsten werden die Modifikatortasten auf die gedr&uuml;ckte Position zur&uuml;ckgesetzt (bleiben stecken), auch dann, wenn der Benutzer diese nicht physisch gedr&uuml;ckt h&auml;lt.</p>
      <p>Die Notwendigkeit dieser Direktive kann wie folgt reduziert oder beseitigt werden:</p>
      <ul>
        <li>Installiere den Tastatur-Hook durch Hinzuf&uuml;gen der Zeile <a href="_InstallKeybdHook.htm">#InstallKeybdHook</a> irgendwo im Script (allerdings wird dieser Hook nicht in Win9x unterst&uuml;tzt).</li>
        <li>Verwende die Methoden <a href="Send.htm#SendInput">SendInput</a> oder <a href="Send.htm#SendPlay">SendPlay</a>, anstatt die traditionelle <a href="Send.htm#SendEvent">SendEvent</a>-Methode.</li>
        <li>Reduziere bei Benutzung der traditionellen <a href="Send.htm#SendEvent">SendEvent</a>-Methode <a href="SetKeyDelay.htm">SetKeyDelay</a> auf 0 oder -1, das dabei helfen sollte, die Tastatureingaben schneller zu senden.</li>
      </ul>
      <p>Ist diese Direktive im Script nicht angegeben, gilt standardm&auml;&szlig;ig 50.</p>
      <h3>Verwandte Befehle</h3>
      <p><a href="GetKeyState.htm">GetKeyState</a></p>
      <h3>Beispiel</h3>
      <pre class="NoIndent">#HotkeyModifierTimeout 100</pre>
    </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>