<!DOCTYPE HTML>
<html>
<head>
<title>#Include</title>
<meta name="keywords" content="Befehl, Direktive, Ablaufsteuerung">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <article>
    <h1>#Include / #IncludeAgain</h1>
    <p>Bewirkt, dass der Inhalt der angegebenen Datei exakt an dieser Position ausgef&uuml;hrt wird.</p>
    <pre class="Syntax">#Include DateiOderVerzeichnis
#Include &lt;Bibliotheksname&gt;
#IncludeAgain DateiOderVerzeichnis </pre>
    <h3>Parameter</h3>
    <table class="info">
      <tr>
        <td style="width: 15%;">DateiOderVerzeichnis</td>
        <td style="width: 85%;"><p><strong>Datei:</strong> Der Name der eingef&uuml;gten Datei, die sich im Start- oder Arbeitsverzeichnis befindet, solange kein absoluter Pfad angegeben ist (au&szlig;er bei <a href="../Scripts.htm#ahk2exe">ahk2exe</a>, das die Datei im eigenen Verzeichnis des Scripts sucht). Der Dateiname <strong>darf keine</strong> Variablenverweise (au&szlig;er <a href="../Variables.htm#ScriptDir">%A_ScriptDir%</a>, <a href="../Variables.htm#AppData">%A_AppData%</a> und <a href="../Variables.htm#AppDataCommon">%A_AppDataCommon%</a>), Anf&uuml;hrungszeichen oder Platzhalter beinhalten. <a href="_EscapeChar.htm">Schutzsequenzen</a> au&szlig;er Semikolon (<strong>`;</strong>) d&uuml;rfen weder verwendet werden, noch sind sie notwendig, da solche Zeichen (z. B. Prozentzeichen) direkt behandelt werden. Hinweis: <a href="SetWorkingDir.htm">SetWorkingDir</a> hat keine Auswirkung auf #Include, weil #Include verarbeitet wird, bevor das Script ausgef&uuml;hrt wird.</p>
          <p><strong>Verzeichnis:</strong> Verwendet ein Verzeichnis anstelle einer Datei, um das Arbeitsverzeichnis zu &auml;ndern, welches f&uuml;r alle nachfolgende Vorkommnisse von #Include und <a href="FileInstall.htm">FileInstall</a> gilt. Der Verzeichnisname darf keine Variablen beinhalten, au&szlig;er <a href="../Variables.htm#ScriptDir">%A_ScriptDir%</a>, <a href="../Variables.htm#AppData">%A_AppData%</a> und <a href="../Variables.htm#AppDataCommon">%A_AppDataCommon%</a>. Hinweis: Wenn das Arbeitsverzeichnis auf diese Weise ver&auml;ndert wird, dann wird das anf&auml;ngliche Arbeitsverzeichnis des Scripts nicht davon beeinflusst, wenn es ausgef&uuml;hrt wird (<a href="../Variables.htm#WorkingDir">A_WorkingDir</a>). Um das zu &auml;ndern, verwendet <a href="SetWorkingDir.htm">SetWorkingDir</a> am Anfang des Scripts.</p></td>
      </tr>
      <tr>
        <td>Bibliotheksname</td>
        <td><span class="ver">[AHK_L 57+]:</span> Eine Bibliotheksdatei oder ein Funktionsname. Mit <code>#include &lt;Bibliothek&gt;</code> und <code>#include &lt;Bibliothek_Funktion&gt;</code> wird beispielsweise Bibliothek.ahk von einem <a href="../Functions.htm#lib">Ordner mit Funktionsbibliotheken</a> eingef&uuml;gt.</td>
      </tr>
    </table>
    <h3>Bemerkungen</h3>
    <p>Die #Include-Direktive bewirkt, dass sich der Inhalt der eingef&uuml;gten Datei exakt an dieser Position befindet (als w&auml;re die Datei kopiert und eingef&uuml;gt). Folglich k&ouml;nnen zwei isolierte Scripts in der Regel nicht zu einem funktionierenden Script zusammengef&uuml;gt werden (um das zu erreichen, siehe <a href="http://www.autohotkey.com/forum/topic18545.html">www.autohotkey.com/forum/topic18545.html</a>).</p>
    <p>#Include stellt sicher, dass der <em>Dateiname</em> nur einmal eingef&uuml;gt wird, selbst wenn mehrere Einf&uuml;gungen gefunden werden. #IncludeAgain erm&ouml;glicht hingegen mehrere Einf&uuml;gungen derselben Datei, ansonsten ist sie vergleichbar mit #Include.</p>
    <p>Der <em>Dateiname</em>-Parameter kann optional mit *i und einem Leerzeichen vorangestellt werden, damit das Programm jeden Fehler beim Laden der eingef&uuml;gten Datei ignoriert. Zum Beispiel: <em>#Include *i Spezialoptionen.ahk</em>. Diese Option sollte nur verwendet werden, wenn die Inhalte der eingef&uuml;gten Datei nicht unbedingt f&uuml;r die Operation des Hauptscripts erforderlich sind.</p>
    <p>Zeilen, die im Hauptfenster mit <a href="ListLines.htm">ListLines</a> oder mit dem Men&uuml; "View-Lines" angezeigt werden, sind immer nach ihrer physischen Reihenfolge innerhalb des eigenen Scripts nummeriert. Das hei&szlig;t, dass das Einf&uuml;gen einer neuen Datei die Zeilennummerierung des Hauptscripts um 1 erh&ouml;ht, n&auml;mlich von der #Include-Zeile selbst (au&szlig;er bei <a href="../Scripts.htm#ahk2exe">kompilierten Scripts</a>, da eingef&uuml;gte Dateien zu einem gro&szlig;en Script w&auml;hrend der Kompilierung zusammenf&uuml;gt werden).</p>
    <p>#Include wird oft verwendet, um <a href="../Functions.htm">Funktionen</a> einer externen Datei zu laden. Im Gegensatz zu Subroutinen k&ouml;nnen <a href="../Functions.htm">Funktionen</a> ganz am Anfang des Scripts eingef&uuml;gt werden, ohne dabei den <a href="../Scripts.htm#auto">automatischen Ausf&uuml;hrungsbereich</a> zu beeinflussen.</p>
    <p>Wie bei anderen Direktiven kann #Include nicht bedingt ausgef&uuml;hrt werden. Das hei&szlig;t, dass das folgende Beispiel nicht funktionieren wird:</p>
    <pre>If x = 1
    #Include BeliebigeDatei.ahk  <em>; Die Zeile ist wirksam, unabh&auml;ngig vom X-Wert.</em>
    y = 2  <em>; Und diese Zeile bezieht sich auf das obere IF, da Direktiven sich nicht auf IFs beziehen k&ouml;nnen.</em></pre>
    <p>Dateien k&ouml;nnen automatisch eingef&uuml;gt werden (ohne dabei #Include zu verwenden), wenn eine <a href="../Functions.htm#lib">Bibliotheksfunktion</a> mit dem Namen aufgerufen wird.</p>
    <h3>Verwandte Befehle</h3>
    <p><a href="../Functions.htm#lib">Funktionsbibliotheken</a>, <a href="../Functions.htm">Funktionen</a>, <a href="FileInstall.htm">FileInstall</a></p>
    <h3>Beispiel</h3>
    <pre class="NoIndent">#Include C:\Eigene Dokumente\Scripts\Tool-Subroutinen.ahk
#Include %A_ScriptDir%  <em>; Ver&auml;ndert das Arbeitsverzeichnis aller nachfolgenden #Includes und FileInstalls.</em>
#Include C:\Eigene Scripts  <em>; Wie oben, aber f&uuml;r ein direkt angegebenes Verzeichnis.</em></pre>
  </article>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>