<!DOCTYPE HTML>
<html>
<head>
<title>#MaxThreadsBuffer</title>
<meta name="keywords" content="Befehl, Direktive, Hotkey">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
      <h1>#MaxThreadsBuffer</h1>
      <p>Bringt einige oder alle <a href="../Hotkeys.htm">Hotkeys</a> dazu, Tastatureingaben zwischenzuspeichern anstatt zu ignorieren, wenn ihr Grenzwert von <a href="_MaxThreadsPerHotkey.htm">#MaxThreadsPerHotkey</a> erreicht wurde.</p>
      <pre class="Syntax">#MaxThreadsBuffer On|Off</pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td style="width: 15%;">On|Off</td>
          <td style="width: 85%;"><p>On: Alle Hotkey-Subroutinen zwischen hier und der n&auml;chsten Direktive "<em>#MaxThreadsBuffer ON</em>" werden die Tastatureingaben des Hotkeys zwischenspeichern anstatt ignorieren, wenn der Grenzwert von <a href="_MaxThreadsPerHotkey.htm">#MaxThreadsPerHotkey</a> erreicht wurde.</p>
            <p>Off: Standardwert. Das Dr&uuml;cken eines Hotkeys wird ignoriert, wenn dieser Hotkey bereits seine maximale Anzahl an Threads ausf&uuml;hrt (&uuml;blicherweise 1, kann aber mit <a href="_MaxThreadsPerHotkey.htm">#MaxThreadsPerHotkey</a> ge&auml;ndert werden).</p></td>
        </tr>
      </table>
      <h3>Bemerkungen</h3>
      <p>Diese Direktive wird selten verwendet, da diese Art von Zwischenspeicherung (standardm&auml;&szlig;ig OFF) in der Regel mehr schadet als n&uuml;tzt. Dr&uuml;ckst du zum Beispiel ein Hotkey aus Versehen zweimal, w&uuml;rde die Subroutine des Hotkeys bei aktivierter Einstellung automatisch das zweite Mal ausgef&uuml;hrt, falls sein erster <a href="../misc/Threads.htm">Thread</a> weniger als 1 Sekunde zum Beenden braucht (diese Art von Zwischenspeicherung wird nach einer Sekunde absichtlich ablaufen). Beachte, dass AutoHotkey die Hotkeys unterschiedlich zwischenspeichert (z. B. "<a href="Thread.htm">Thread Interrupt</a>" und "<a href="Critical.htm">Critical</a>"). Da dieser bestimmte Weg nachteilig sein kann, ist diese Direktive standardm&auml;&szlig;ig deaktiviert.</p>
      <p>Der Hauptnutzen dieser Direktive ist es, die Reaktionsf&auml;higkeit der Autowiederholungsfunktion der Tastatur zu erh&ouml;hen. H&auml;lst du zum Beispiel ein Hotkey gedr&uuml;ckt, dessen <a href="_MaxThreadsPerHotkey.htm">#MaxThreadsPerHotkey</a>-Einstellung auf 1 (Standardwert) gesetzt ist, werden alle eingehenden Tastatureingaben ignoriert, falls diese Hotkey-Subroutine bereits l&auml;uft. Sobald die Subroutine endet, muss sie folglich auf die n&auml;chste eingehende Auto-Wiederholung der Tastatureingabe warten, dass mindestens 50 ms dauern kann, weil sie sich zwischen den Tastatureingaben und dem Auto-Wiederholungszyklus befindet. Die Verz&ouml;gerung von 50 ms kann verhindert werden, wenn diese Direktive f&uuml;r jeden Hotkey aktiviert wird, der die bestm&ouml;gliche Reaktionszeit ben&ouml;tigt, w&auml;hrend eine automatische Wiederholung erfolgt.</p>
      <p>Wie bei allen Direktiven sollte diese Direktive nicht als Befehl verwendet werden (es macht zum Beispiel keinen Sinn, wenn sich die Direktive in einer Subroutine befindet). Positioniert diese Direktive stattdessen direkt vor dem ersten Hotkey, der davon beeinflusst werden soll.</p>
      <h3>Verwandte Befehle</h3>
      <p><a href="_MaxThreads.htm">#MaxThreads</a>, <a href="_MaxThreadsPerHotkey.htm">#MaxThreadsPerHotkey</a><a href="../misc/Threads.htm">, </a><a href="Critical.htm">Critical</a>, <a href="Thread.htm">Thread (Befehl)</a>, <a href="../misc/Threads.htm">Threads</a>, <a href="Hotkey.htm">Hotkey</a>, <a href="_MaxHotkeysPerInterval.htm">#MaxHotkeysPerInterval</a>, <a href="_HotkeyInterval.htm">#HotkeyInterval</a>, <a href="ListHotkeys.htm">ListHotkeys</a></p>
      <h3>Beispiel</h3>
      <pre class="NoIndent">#MaxThreadsBuffer on
#x::MsgBox, Dieser Hotkey verwendet diese Art von Zwischenspeicherung.
#y::MsgBox, Dieser Hotkey auch.
#MaxThreadsBuffer off
#z::MsgBox, Aber nicht dieser Hotkey.</pre>
    </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>