<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Catch</title>
<meta name="keywords" content="Befehl, Ablaufsteuerung, Fehler">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>Catch <span class="ver">[v1.1.04+]</span></h1>

<p>Bestimmt den Code, der ausgef&uuml;hrt werden soll, wenn eine Ausnahme w&auml;hrend einer <a href="Try.htm">Try</a>-Anweisung ausgel&ouml;st wird.</p>

<pre class="Syntax" style="line-height: 120%">Catch [, Ausgabevariable]
    <i>Anweisungen</i></pre>
<pre class="Syntax" style="line-height: 100%">Catch [, Ausgabevariable]
{
    <i>Anweisungen</i>
}</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">Ausgabevariable</td>
    <td width="85%"><em>(Optional)</em> Der Name der Variable, in der der Wert von der Ausnahme gespeichert wird.</td>
  </tr>
  <tr>
    <td>Anweisung(en)</td>
    <td>Befehle oder Ausdr&uuml;cke, die ausgef&uuml;hrt werden sollen, wenn eine Ausnahme ausgel&ouml;st wird.</td>
  </tr>
</table>

<h3>Bemerkungen</h3>
<p>Jedes <em>Catch</em> muss mit einer vorherigen <a href="Try.htm">Try</a>-Anweisung assoziiert werden. Ein <em>Catch</em> geh&ouml;rt immer einer n&auml;chstgelegenen nicht beanspruchten <em>Try</em>-Anweisung, es sei denn, <a href="Block.htm">Block</a> wird dazu verwendet, dieses Verhalten zu &auml;ndern.</p>
<p>Der "<a href="Block.htm#otb">One True Brace Style</a>" kann gegebenenfalls verwendet werden. Zum Beispiel:</p>
<pre>try <strong>{</strong>
    ...
<strong>}</strong> catch e <strong>{</strong>
    ...
<strong>}</strong></pre>

<h3 id="RuntimeErrors">Laufzeitfehler</h3>
<p>Eine <em>Try-Catch</em>-Anweisung kann auch dazu verwendet werden, Laufzeitfehler zu verarbeiten. Es gibt zwei Arten von Laufzeitfehlern: solche, die ErrorLevel normal setzen, und solche, die den aktuellen Thread nach der Fehlermeldungsanzeige beenden. Ladezeitfehler k&ouml;nnen nicht verarbeitet werden, da sie vor dem Ausf&uuml;hren der Try-Anweisung auftauchen. F&uuml;r die Abw&auml;rtskompatibilit&auml;t (und in einigen F&auml;llen der Einfachheit halber) l&ouml;sen Laufzeitfehler nur Ausnahmen beim Ausf&uuml;hren eines <em>Try</em>-Blocks aus. Die meisten Befehle unterst&uuml;tzen das Benutzen von <em>Try-Catch</em>; allerdings wird ErrorLevel weiterhin auf 0 gesetzt, wenn der Befehl erfolgreich durchgef&uuml;hrt wurde.</p>
<p>Der gespeicherte Wert in der <em>Ausgabevariable</em> (falls vorhanden) ist ein <a href="../objects/Object.htm">Objekt</a>, das folgende Felder enth&auml;lt:</p>
<table class="info"><tr><td>
<p><strong>What:</strong> Der Name des Befehls oder der Funktion, der/die ausgef&uuml;hrt wurde oder dabei war, ausgef&uuml;hrt zu werden, als der Fehler auftrat.</p>
<p><strong>File:</strong> Der vollst&auml;ndige Pfad der Script-Datei, die die fehlerhafte Zeile enth&auml;lt.</p>
<p><strong>Line:</strong> Die Nummer der fehlerhaften Zeile.</p>
<p><strong>Message:</strong> Eine Fehlermeldung oder ein ErrorLevel-Wert.</p>
<p><strong>Extra:</strong> Zus&auml;tzliche Informationen &uuml;ber den Fehler, falls verf&uuml;gbar.</p>
</td></tr></table>
<p><strong>Hinweis:</strong> Diese Details sollten nur f&uuml;rs Debuggen verwendet werden, da sie m&ouml;glicherweise in einer zuk&uuml;nftigen Version ge&auml;ndert werden.</p>

<h3>Verwandte Befehle</h3>
<p><a href="Try.htm">Try</a>, <a href="Throw.htm">Throw</a>, <a href="Block.htm">Block</a></p>
<h3>Beispiele</h3>
<p>Siehe <a href="Try.htm#Examples">Try</a>.</p>
</div>
</body>
</html>