<!DOCTYPE HTML>
<html>
<head>
<title>Catch</title>
<meta name="keywords" content="Befehl, Ablaufsteuerung, Fehler">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
    <h1>Catch <span class="ver">[v1.1.04+]</span></h1>
    <p>Bestimmt den Code, der ausgef&uuml;hrt werden soll, wenn eine Ausnahme w&auml;hrend einer <a href="Try.htm">Try</a>-Anweisung ausgel&ouml;st wird.</p>
    <pre class="Syntax" style="line-height: 120%">Catch [, AusgabeVar]
    <i>Anweisungen</i></pre>
    <pre class="Syntax" style="line-height: 100%">Catch [, AusgabeVar]
{
    <i>Anweisungen</i>
}</pre>
    <h3>Parameter</h3>
    <table class="info">
      <tr>
        <td style="width: 15%;">AusgabeVar</td>
        <td style="width: 85%;"><em>(Optional)</em> Name der Variable, in der der Wert von der Ausnahme gespeichert werden soll.</td>
      </tr>
      <tr>
        <td>Anweisung(en)</td>
        <td>Befehle oder Ausdr&uuml;cke, die ausgef&uuml;hrt werden sollen, wenn eine Ausnahme ausgel&ouml;st wird.</td>
      </tr>
    </table>
    <h3>Bemerkungen</h3>
    <p>Jedes <em>Catch</em> muss mit einer <a href="Try.htm">Try</a>-Anweisung dar&uuml;ber verbunden werden. Ein <em>Catch</em> bezieht sich immer auf die n&auml;chstliegende unbeanspruchte <em>Try</em>-Anweisung, sofern ein <a href="Block.htm">Block</a> nicht dazu verwendet wird, dieses Verhalten zu &auml;ndern.</p>
    <p>Je nach Bedarf kann der "<a href="Block.htm#otb">One True Brace Style</a>" verwendet werden. Zum Beispiel:</p>
    <pre>try <strong>{</strong>
    ...
<strong>}</strong> catch e <strong>{</strong>
    ...
<strong>}</strong></pre>
    <h3 id="RuntimeErrors">Laufzeitfehler</h3>
    <p>Eine <em>Try-Catch</em>-Anweisung kann auch dazu verwendet werden, Laufzeitfehler zu verarbeiten. Es gibt zwei Arten von Laufzeitfehlern: solche, die <a href="../misc/ErrorLevel.htm">ErrorLevel</a> normal setzen, und solche, die den aktuellen Thread dazu bringen, sich nach einer Fehlermeldung zu beenden. Ladezeitfehler k&ouml;nnen nicht verarbeitet werden, da diese erfolgen, bevor die Try-Anweisung ausgef&uuml;hrt wird. Aufgrund der Abw&auml;rtskompatibilit&auml;t (und in einigen F&auml;llen der Einfachheit halber) k&ouml;nnen Laufzeitfehler nur Ausnahmen ausl&ouml;sen, w&auml;hrend ein <em>Try</em>-Block ausgef&uuml;hrt wird. Die meisten Befehle unterst&uuml;tzen die Verwendung von <em>Try-Catch</em>; allerdings wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> weiterhin auf 0 gesetzt, wenn der Befehl erfolgreich war.</p>
    <p>Der gespeicherte Wert in <em>AusgabeVar</em> (falls vorhanden) ist ein Ausnahme-<a href="../objects/Object.htm">Objekt</a>, das folgende Felder enth&auml;lt:</p>
    <table class="info">
      <tr>
        <td><p><strong>What:</strong> Der Name des Befehls oder der Funktion, der/die ausgef&uuml;hrt wurde oder ausgef&uuml;hrt werden sollte, als der Fehler auftauchte.</p>
          <p><strong>File:</strong> Der vollst&auml;ndige Pfad der Script-Datei, die die fehlerhafte Zeile enth&auml;lt.</p>
          <p><strong>Line:</strong> Die Nummer der fehlerhaften Zeile.</p>
          <p><strong>Message:</strong> Eine Fehlermeldung oder ein <a href="../misc/ErrorLevel.htm">ErrorLevel</a>-Wert.</p>
          <p><strong>Extra:</strong> Zus&auml;tzliche Informationen &uuml;ber den Fehler, falls verf&uuml;gbar.</p></td>
      </tr>
    </table>
    <p><strong>Hinweis:</strong> Diese Details sollten nur zum Debuggen verwendet werden, da sie m&ouml;glicherweise in einer zuk&uuml;nftigen Version ge&auml;ndert werden.</p>
    <h3>Verwandte Befehle</h3>
    <p><a href="Try.htm">Try</a>, <a href="Throw.htm">Throw</a>, <a href="Block.htm">Block</a></p>
    <h3>Beispiele</h3>
    <p>Siehe <a href="Try.htm#Examples">Try</a>.</p>
  </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>