<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Click</title>
<meta name="keywords" content="Befehl, Maus">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>Click <span class="ver">[v1.0.43+]</span></h1>

<p>Klickt mit einer Maustaste auf bestimmte Koordinaten. Kann auch eine Maustaste gedr&uuml;ckt halten, das Mausrad drehen oder die Maus bewegen.</p>
<p>Gebr&auml;uchliche Beispiele zur Verwendung des Befehls (alle Kommas sind optional):</p>
<table class="info">
  <tr>
    <td width="110">Click</td>
    <td>Klickt mit der linken Maustaste einmal auf die aktuelle Position des Mauszeigers.</td>
  </tr>
  <tr>
    <td>Click 44, 55 <br>    </td>
    <td>Klickt mit der linken Maustaste einmal auf die Koordinaten 44, 55 (abh&auml;ngig von <a href="CoordMode.htm">CoordMode</a>).</td>
  </tr>
  <tr>
    <td>Click right 44, 55 </td>
    <td>Das Gleiche wie oben, nur mit der rechten Maustaste.</td>
  </tr>
  <tr>
    <td>Click 2 </td>
    <td>Klickt mit der linken Maustaste zweimal auf die aktuelle Position des Mauszeigers. </td>
  </tr>
  <tr>
    <td>Click down </td>
    <td>H&auml;lt die linke Maustaste gedr&uuml;ckt.</td>
  </tr>
  <tr>
    <td>Click up right</td>
    <td>L&auml;sst die rechte Maustaste los.</td>
  </tr>
  <tr>
    <td>Click %x% %y% </td>
    <td>Da <a href="../Variables.htm#Expressions">Ausdr&uuml;cke</a> nicht unterst&uuml;tzt werden, m&uuml;ssen Variablen mit Prozentzeichen umschlossen werden. </td>
  </tr>
</table>
<p>Es k&ouml;nnen beliebig viele Elemente nach dem Wort <em>Click</em> erfolgen. Alle Elemente m&uuml;ssen durch ein Leerzeichen, Tabulator und/oder Komma voneinander getrennt werden. Die Reihenfolge der Elemente ist unwichtig, mit Ausnahme von <em>ClickCount</em>, welches auf der rechten Seite der Koordinaten stehen muss (wenn die Koordinaten vorhanden sind).</p>
<p><strong>X, Y</strong>: Die X/Y-Koordinaten der neuen Mausposition, bevor ein Klicken erfolgt. Die Koordinaten beziehen sich auf das aktive Fenster, es sei denn, <a href="CoordMode.htm">CoordMode</a> wurde dazu verwendet, dass zu &auml;ndern. Wenn sie weggelassen werden, wird die aktuelle Position des Zeigers verwendet.</p>
<p><strong>Maustaste:</strong> Left (Standard), Right, Middle (oder jeweils nur der erste Buchstabe); oder die 4. oder 5. Maustaste (X1 oder X2), die ab Windows 2000/XP unterst&uuml;tzt werden. HINWEIS: Im Gegensatz zu <a href="MouseClick.htm">MouseClick</a> verhalten sich die linken und rechten Maustasten immer gleich, selbst wenn der Benutzer die Tasten mittels der Systemsteuerung vertauscht hat.</p>
<p><strong>Mausrad</strong> (funktioniert nicht in Windows 9x): Um das Mausrad nach oben zu drehen (vom Benutzer weg), verwendet man WheelUp oder WU; Um das Mausrad nach unten zu drehen (auf dem Benutzer zu), verwendet man WheelDown oder WD. Seit v1.0.48 k&ouml;nnen auch WheelLeft (WL) oder WheelRight (WR) verwendet werden (funktioniert nicht bei Betriebssystemen, die &auml;lter als Windows Vista sind). Mit <em>ClickCount</em> (siehe unten) kann die Anzahl der Rasterungen zum Drehen des Rades bestimmt werden. Allerdings wird <em>ClickCount</em> h&ouml;her als 1 bei einigen Anwendungen nicht unterst&uuml;tzt. Daf&uuml;r kann eine <a href="Loop.htm">Schleife</a> wie folgt verwendet werden:</p>
<pre>Loop 5
    Click WheelUp</pre>
<p><strong>ClickCount</strong>: Bestimmt die Anzahl an Mausklicks (Beispiel: <em>Click 2</em> ... <em>Click 100, 200, 2)</em>. Wenn es weggelassen wird, erfolgt nur ein Mausklick. Wenn Koordinaten angegeben sind, muss <em>ClickCount</em> nach ihnen erscheinen. Mit einer 0 wird die Maus ohne Klick verschoben (zum Beispiel: <em>Click 100, 200, 0)</em>.</p>
<p><strong>Down</strong> oder <strong>Up:</strong> Diese W&ouml;rter werden normalerweise weggelassen, damit die Maustaste gedr&uuml;ckt und wieder losgelassen wird. Ansonsten wird mit <em>Down</em> (oder <em>D</em>) die Maustaste gedr&uuml;ckt, ohne loszulassen. Verwendet danach das Wort <em>Up</em> (oder <em>U</em>), um die Maustaste loszulassen.</p>
<p><strong>Relative:</strong> Das Word <em>Rel</em> oder <em>Relative</em> behandelt die angegebenen Koordinaten X und Y als Offset von der aktuellen Mausposition. Das hei&szlig;t, dass der Zeiger von seiner aktuellen Position um X Pixel nach rechts (nach links ist negativ) und um Y Pixel nach unten (nach oben ist negativ) verschoben wird.</p>
<h3>Bemerkungen</h3>
<p><em>Click</em> hat gegen&uuml;ber <a href="MouseClick.htm">MouseClick</a> Vorrang, weil es einen Austausch der linken und rechten Maustaste mittels der Systemsteuerung ignoriert.</p>
<p><em>Click</em> verwendet den vordefinierten Sendemodus von <a href="SendMode.htm">SendMode</a>. Um diesen Modus f&uuml;r einen bestimmten Mausklick zu &uuml;berschreiben, verwendet einen speziellen Sendebefehl wie in diesem Beispiel: <a href="Send.htm#Click">SendEvent {Click, 100, 200}</a></p>
<p>F&uuml;r ein Umschalt+Klick oder Steuerung+Klick ist die Methode mit <a href="Send.htm#Click"><em>Send {Click}</em></a> besser geeignet. Zum Beispiel:</p>
<pre>Send +{Click 100, 200}  <em>; Umschalt+Linksklick</em>
Send ^{Click 100, 200, right}  <em>; Steuerung+Rechtsklick</em></pre>
<p>Im Gegensatz zu <a href="Send.htm">Send</a> l&auml;sst <em>Click</em> die Modifikatortasten (Strg, Alt, Umschalt und Win) nicht automatisch los. Wenn zum Beispiel die Steuerungstaste gedr&uuml;ckt gehalten wird, dann wird <em>Click</em> ein Steuerung+Mausklick erzeugen, aber <em>Send {Click}</em> einen normalen Klick.</p>
<p>Der <a href="SendMode.htm">SendPlay-Modus</a> ist in der Lage, Mausaktionen in einer breiteren Auswahl an Spielen erfolgreich durchzuf&uuml;hren. Dar&uuml;ber hinaus k&ouml;nnten einige Anwendungen und Spiele Probleme dabei haben, die Maus zu verfolgen, wenn sie zu schnell verschoben wird. In diesem Fall kann die Geschwindigkeit mit <a href="SetDefaultMouseSpeed.htm">SetDefaultMouseSpeed</a> reduziert werden (aber nur im <a href="SendMode.htm">SendEvent-Modus</a>).</p>
<p>Der <a href="BlockInput.htm">BlockInput</a>-Befehl kann dazu verwendet werden, physische Mausaktivit&auml;ten des Benutzers zu ignorieren, damit die k&uuml;nstlichen Mausaktionen der Mausbefehle nicht unterbrochen werden k&ouml;nnen. Allerdings ist dieser Befehl im <a href="SendMode.htm">SendInput</a>- oder <a href="SendMode.htm">SendPlay</a>-Modus unn&ouml;tig, weil die physischen Mausaktivit&auml;ten des Benutzers automatisch bis zum Schluss zwischengespeichert werden.</p>
<p>Nach dem Dr&uuml;cken und Loslassen der Maus erfolgt automatisch eine Verz&ouml;gerung (au&szlig;er beim <a href="SendMode.htm">SendInput-Modus</a> und beim Drehen des Mausrads). Die Verz&ouml;gerungsdauer kann mit <a href="SetMouseDelay.htm">SetMouseDelay</a> ge&auml;ndert werden.</p>
<h3>Verwandte Befehle</h3>
<p><a href="Send.htm#Click">Send {Click}</a>, <a href="SendMode.htm">SendMode</a>, <a href="CoordMode.htm">CoordMode</a>, <a href="SetDefaultMouseSpeed.htm">SetDefaultMouseSpeed</a>,<a href="SetMouseDelay.htm">SetMouseDelay</a>, <a href="MouseClick.htm">MouseClick</a>, <a href="MouseClickDrag.htm">MouseClickDrag</a>, <a href="MouseMove.htm">MouseMove</a>, <a href="ControlClick.htm">ControlClick</a>, <a href="BlockInput.htm">BlockInput</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent">Click  <em>; Klickt mit der linken Maustaste einmal auf die aktuelle Position des Mauszeigers.</em>
Click 100, 200  <em>; Klickt mit der linken Maustaste einmal auf die bestimmte Koordinaten.</em>
Click 100, 200, 0  <em>; Bewegt die Maus ohne danach zu klicken.</em>
Click 100, 200 right  <em>; Klickt mit der rechten Maustaste.</em>
Click 2  <em>; F&uuml;hrt einen Doppelklick aus.</em>
Click down  <em>; H&auml;lt die linke Maustaste gedr&uuml;ckt.</em>
Click up right  <em>; L&auml;sst die rechte Maustaste los.</em></pre>

</body>
</html>