<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Control</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>

<h1>Control</h1>

<p>Erm&ouml;glicht eine Vielzahl von &Auml;nderungen an einem Steuerelement.</p>

<pre class="Syntax">Control, Befehl [, Wert, Steuerelement, Fenstertitel, Fenstertext, Titelausnahme, Textausnahme]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td>Befehl, Wert </td>
    <td>Siehe untere Liste.</td>
  </tr>
  <tr>
    <td width="15%">Steuerelement</td>
    <td width="85%"><p>M&ouml;glich ist entweder ClassNN (Klassenname und Instanznummer des Steuerelements) oder Name/Text des Steuerelements, die beide mit Windows Spy ermittelt werden k&ouml;nnen. Wenn Name/Text verwendet wird, wird das &Uuml;bereinstimmungsverhalten mit <a href="SetTitleMatchMode.htm">SetTitleMatchMode</a> bestimmt. Wenn dieser Parameter leer ist, wird das oberste Steuerelement des Fensters benutzt.</p>
    <p>F&uuml;r das HWND eines Steuerelements (Windows Handle) wird der <em>Steuerelement</em>-Parameter leer gelassen und <em>ahk_id %SteuerelementHwnd%</em> im <em>Fenstertitel</em>-Parameter angegeben (funktioniert auch bei versteckten Steuerelementen, selbst wenn <a href="DetectHiddenWindows.htm">DetectHiddenWindows</a> deaktiviert ist). Das HWND eines Steuerelements wird &uuml;blicherweise mittels <a href="ControlGet.htm#Hwnd">ControlGet Hwnd</a>, <a href="MouseGetPos.htm">MouseGetPos</a> oder <a href="DllCall.htm">DllCall</a> abgerufen.</p></td>
  </tr>
  <tr>
    <td>Fenstertitel</td>
    <td>Der Titel oder Teiltitel des Fensters (das &Uuml;bereinstimmungsverhalten wird mit <a href="SetTitleMatchMode.htm">SetTitleMatchMode</a> bestimmt). Wenn dieser und die n&auml;chsten 3 Parameter nicht vorhanden sind, dann wird das <a href="../LastFoundWindow.htm">zuletzt gefundene Fenster</a> verwendet. Wenn dieser den Buchstaben A enth&auml;lt und die n&auml;chsten 3 Parameter nicht vorhanden sind, dann wird das aktive Fenster verwendet. Bei Verwendung einer Fensterklasse muss ahk_class ExakterKlassenname angegeben werden (wird von Windows Spy angezeigt). Bei Verwendung einer <a href="Process.htm">Prozess-Kennung (PID)</a> muss ahk_pid %VariableMitPID% angegeben werden. Bei Verwendung einer <a href="GroupAdd.htm">Fenstergruppe</a> muss ahk_group Gruppenname angegeben werden. Bei Verwendung einer <a href="WinGet.htm">eindeutigen ID-Nummer</a> eines Fensters muss ahk_id %VariableMitID% angegeben werden. Die Suche kann durch Angabe <a href="../LastFoundWindow.htm#multi">mehrerer Kriterien</a> eingeschr&auml;nkt werden. Zum Beispiel: <em>Eigene Datei.txt ahk_class Notepad</em></td>
  </tr>
  <tr>
    <td>Fenstertext</td>
    <td>Wenn vorhanden, dann muss dieser Parameter einen Teil der einzelnen Textelemente des Fensters enthalten (wird von Windows Spy angezeigt). Versteckte Textelemente werden erfasst, wenn <a href="DetectHiddenText.htm">DetectHiddenText</a> aktiv ist.</td>
  </tr>
  <tr>
    <td>Titelausnahme</td>
    <td>Fenstertitel mit diesem Wert werden nicht ber&uuml;cksichtigt.</td>
  </tr>
  <tr>
    <td>Textausnahme</td>
    <td>Fenstertexte mit diesem Wert werden nicht ber&uuml;cksichtigt.</td>
  </tr>
</table>

<h3>Befehl, Wert</h3>
<p>Die Parameter <em>Befehl</em> und <em>Wert</em> sind voneinander abh&auml;ngig und k&ouml;nnen wie folgt verwendet werden.</p>
<p><strong>Check</strong>: Markiert ein Optionsfeld oder Kontrollk&auml;stchen.</p>
<p><strong>Uncheck</strong>: Entfernt die Markierung von einem Optionsfeld oder Kontrollk&auml;stchen. </p>
<p><strong>Enable</strong>: Aktiviert ein Steuerelement, wenn es zuvor deaktiviert war.</p>
<p><strong>Disable</strong>: Deaktiviert oder "ergraut" ein Steuerelement. </p>
<p><strong>Show</strong>: Steuerelement einblenden, wenn es zuvor ausgeblendet wurde. </p>
<p><strong>Hide</strong>: Steuerelement ausblenden. Au&szlig;erdem ist es m&ouml;glich, die Tastenkombination des Steuerelements (unterstrichener Buchstabe) mit "Control Disable" zu unterbinden.</p>
<p><strong>Style, N </strong> <u>oder</u> <strong>ExStyle, N</strong>: &Auml;ndert jeweils den Style oder Extended Style eines Steuerelements. Wenn das erste Zeichen in <strong>N</strong> ein Plus- oder Minuszeichen ist, dann wird der Style in <strong>N</strong> jeweils hinzugef&uuml;gt bzw. entfernt. Wenn das erste Zeichen in <B>N</B> ein Zirkumflex (^) ist, dann wird der Style jeweils auf den entgegengesetzten Zustand gesetzt. Wenn das erste Zeichen in <strong>N</strong> eine Ziffer ist, dann wird der Style des Steuerelements komplett &uuml;berschrieben. <a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 1 gesetzt, wenn das Fenster/Steuerelement nicht gefunden wird oder wenn der Style nicht benutzt werden darf (was h&auml;ufig in Windows 9x auftritt).</p>
<p>Bestimmte Style-&Auml;nderungen ben&ouml;tigen eine grafische Aktualisierung des Fensters mit Hilfe von <a href="WinSet.htm">WinSet Redraw</a>. Au&szlig;erdem bietet die <a href="../misc/Styles.htm">Style-Tabelle</a> noch weitere Style-Nummern. Zum Beispiel:</p>
<pre>Control, Style, ^0x800000, Edit1, Fenstertitel  <em>; Setzt den WS_BORDER-Style auf den entgegengesetzten Zustand.</em></pre>
<p><strong>ShowDropDown</strong>: &Ouml;ffnet die ComboBox, damit die Auswahlm&ouml;glichkeiten sichtbar werden. </p>
<p><strong>HideDropDown</strong>: Kehrt das Obengenannte um. </p>
<p><strong>TabLeft [, Count]</strong> und <strong>TabRight [, Count]</strong>: Verschiebt den Tab in einem SysTabControl32 beliebig oft nach links oder rechts. <em>Count</em> ist automatisch 1, wenn diese Variable nicht vorhanden oder leer ist. Um stattdessen einen Tab direkt mit einer Nummer auszuw&auml;hlen, ersetzt die untere Nummer 5 mit der Positionsnummer des ausgew&auml;hlten Tabs. Beachtet, dass der erste Tab mit der Positionsnummer 0 beginnt.</p>
<pre><a href="PostMessage.htm">SendMessage</a>, 0x1330, <span class="red">5</span>,, SysTabControl321, Fenstertitel  <em>; 0x1330 ist TCM_SETCURFOCUS.</em>
Sleep 0  <em>; Diese und die n&auml;chste Zeile sind nur f&uuml;r einige Tab-Steuerelemente notwendig.</em>
SendMessage, 0x130C, <span class="red">5</span>,, SysTabControl321, Fenstertitel  <em>; 0x130C ist TCM_SETCURSEL.</em></pre>
<p><strong>Add, String</strong>: <em>String</em> wird als neuer Eintrag am Ende einer ListBox oder ComboBox hinzugef&uuml;gt (funktioniert vielleicht auch bei anderen Steuerelementen).</p>
<p><strong>Delete, N</strong>: Entfernt den N-ten Eintrag in einer ListBox oder ComboBox. <em>N</em> ist f&uuml;r den ersten Eintrag die Nummer 1, f&uuml;r den zweiten Eintrag die Nummer 2, usw.</p>
<p><strong>Choose, N</strong>: Setzt die Auswahl auf den N-ten Eintrag in einer ListBox oder ComboBox. <em>N</em> F&uuml;r den ersten Eintrag die Nummer 1, f&uuml;r den zweiten Eintrag die Nummer 2, usw. Um die Auswahl in einer ListBox mit <em>Mehrfachauswahl</em> auf mehrere Eintr&auml;ge gleichzeitig zu setzen oder zu entfernen, siehe Beispiel:</p>
<pre><a href="PostMessage.htm">PostMessage</a>, 0x185, 1, -1, ListBox1, Fenstertitel  <em>; Alle ListBox-Eintr&auml;ge ausw&auml;hlen. 0x185 ist LB_SETSEL.</em></pre>
<p><strong>ChooseString, String</strong>: Setzt die Auswahl auf den ersten Eintrag in einer ListBox oder ComboBox, dessen f&uuml;hrender Teil mit <em>String</em> &uuml;bereinstimmt. Die Suche ist nicht von der Gro&szlig;-/Kleinschreibung abh&auml;ngig. Wenn eine ListBox/ComboBox beispielsweise den Eintrag "UNIX-Text" enth&auml;lt, dann gen&uuml;gt das Wort unix (kleingeschrieben), um es auszuw&auml;hlen.</p>
<p><strong>EditPaste, String</strong>: <em>String</em> wird in einem Edit-Steuerelement nach dem Text-Cursor eingef&uuml;gt (Der Inhalt der <a href="../misc/Clipboard.htm">Zwischenablage</a> ist davon nicht betroffen).</p>
<h3>ErrorLevel</h3>
<p>Bei Problemen wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt, ansonsten enth&auml;lt ErrorLevel eine 0.</p>
<h3>Bemerkungen</h3>
<p>Um die Zuverl&auml;ssigkeit des Befehls zu verbessern, erfolgt automatisch eine Verz&ouml;gerung nach jeder Verwendung (au&szlig;er bei <em>Style</em> und <em>ExStyle</em>). Diese Verz&ouml;gerung kann mit <a href="SetControlDelay.htm">SetControlDelay</a> ge&auml;ndert werden.</p>
<p>Zur Erfassung des Steuerelementnamens unter dem Mauszeiger wird <a href="MouseGetPos.htm">MouseGetPos</a> verwendet.</p>
<p>Fenstertitel und -texte sind von der Gro&szlig;- und Kleinschreibung abh&auml;ngig. Solange <a href="DetectHiddenWindows.htm">DetectHiddenWindows</a> deaktiviert ist, werden versteckte Fenster nicht wahrgenommen.</p>

<h3>Verwandte Befehle</h3>
<p><a href="SetControlDelay.htm">SetControlDelay</a>, <a href="ControlGet.htm">ControlGet</a>, <a href="GuiControl.htm">GuiControl</a>, <a href="ControlGetText.htm">ControlGetText</a>, <a href="ControlSetText.htm">ControlSetText</a>, <a href="ControlMove.htm">ControlMove</a>, <a href="ControlGetPos.htm">ControlGetPos</a>, <a href="ControlClick.htm">ControlClick</a>, <a href="ControlFocus.htm">ControlFocus</a>, <a href="ControlSend.htm">ControlSend</a>, <a href="WinSet.htm">WinSet</a> </p>
<h3>Beispiel</h3>
<pre class="NoIndent">Control, HideDropDown, , ComboBox1, Beliebiger Fenstertitel</pre>

</body>
</html>
