<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>ControlSend / ControlSendRaw</title>
<meta name="keywords" content="Befehl, Steuerelement, Tastatur">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
<div id="content">
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>ControlSend / ControlSendRaw</h1>

<p>Sendet k&uuml;nstliche Tastatureingaben an ein Fenster oder Steuerelement.</p>

<pre class="Syntax">ControlSend [, Steuerelement, Tasten, Fenstertitel, Fenstertext, Titelausnahme, Textausnahme]
ControlSendRaw: Die gleichen Parameter wie oben.</pre>
<h3>Parameter</h3>
<table class="info">
  <tbody>
<tr>
    <td width="15%">Steuerelement</td>
    <td width="85%">
<p>M&ouml;glich ist entweder ClassNN (Klassenname und Instanznummer des Steuerelements) oder Name/Text des Steuerelements, die beide mit Windows Spy ermittelt werden k&ouml;nnen. Beim Name/Text wird das &Uuml;bereinstimmungsverhalten mit <a href="SetTitleMatchMode.htm">SetTitleMatchMode</a> bestimmt. Ist dieser Parameter leer oder nicht vorhanden, wird das oberste Steuerelement des Fensters benutzt. Wenn dieser Parameter ahk_parent enth&auml;lt, dann werden die Tastatureingaben direkt an das Fenster des Steuerelements gesendet (als Beispiel siehe <a href="../misc/Winamp.htm">Winamp automatisieren</a>).</p>
    <p>Um das HWND (Windows Handle) eines Steuerelements geltend zu machen, muss dieser Parameter leer gelassen und <em>ahk_id %SteuerelementHwnd%</em> im <em>Fenstertitel</em>-Parameter angegeben werden (funktioniert auch bei versteckten Steuerelementen, selbst wenn <a href="DetectHiddenWindows.htm">DetectHiddenWindows</a> deaktiviert ist). Das HWND eines Steuerelements wird &uuml;blicherweise mittels <a href="ControlGet.htm#Hwnd">ControlGet Hwnd</a>, <a href="MouseGetPos.htm">MouseGetPos</a> oder <a href="DllCall.htm">DllCall</a> abgerufen.</p></td>
  </tr>
  <tr>
    <td>Tasten</td>
    <td>
<p>Eine Reihe von Tasten, die gesendet werden (siehe <a href="Send.htm">Send</a>-Befehl f&uuml;r mehr Details). Um ein direktes Komma zu senden, <a href="_EscapeChar.htm">sch&uuml;tzt</a> es (`,). Die Geschwindigkeit, mit welcher die Zeichen gesendet werden, wird durch <a href="SetKeyDelay.htm">SetKeyDelay</a> beeinflusst.</p>
    <p>Im Gegensatz zum <a href="Send.htm">Send</a>-Befehl k&ouml;nnen Mausklicks nicht mit ControlSend gesendet werden. Verwendet stattdessen <a href="ControlClick.htm">ControlClick</a>.</p></td>
  </tr>
  <tr>
    <td>Fenstertitel</td>
    <td>Der Titel oder Teiltitel des Fensters (das &Uuml;bereinstimmungsverhalten wird mit <a href="SetTitleMatchMode.htm">SetTitleMatchMode</a> bestimmt). Wenn dieser und die n&auml;chsten 3 Parameter weggelassen werden, wird das <a href="../LastFoundWindow.htm">zuletzt gefundene Fenster</a> verwendet. Sobald dieser den Buchstaben A enth&auml;lt und die n&auml;chsten 3 Parameter weggelassen werden, wird das aktive Fenster verwendet. Bei Verwendung einer Fensterklasse muss ahk_class ExakterKlassenname angegeben werden (wird von Windows Spy angezeigt). Bei Verwendung einer <a href="Process.htm">Prozess-Kennung (PID)</a> muss ahk_pid %VariableMitPID% angegeben werden. Bei Verwendung einer <a href="GroupAdd.htm">Fenstergruppe</a> muss ahk_group Gruppenname angegeben werden. Bei Verwendung einer <a href="WinGet.htm">eindeutigen ID-Nummer</a> eines Fensters muss ahk_id %VariableMitID% angegeben werden. Die Suche kann durch Angabe <a href="../LastFoundWindow.htm#multi">mehrerer Kriterien</a> eingeschr&auml;nkt werden. Zum Beispiel: <em>Eigene Datei.txt ahk_class Notepad</em></td>
  </tr>
  <tr>
    <td>Fenstertext</td>
    <td>In diesem Parameter kann ein Teilstring angegeben werden, der in einem Textelement des Zielfensters vorkommt (werden mit Windows Spy angezeigt). Versteckte Textelemente werden auch erkannt, sofern <a href="DetectHiddenText.htm">DetectHiddenText</a> aktiv ist.</td>
  </tr>
  <tr>
    <td>Titelausnahme</td>
    <td>Ignoriert Fenster, deren Titel diesen Wert enthalten.</td>
  </tr>
  <tr>
    <td>Textausnahme</td>
    <td>Ignoriert Fenster, deren Textelemente diesen Wert enthalten.</td>
  </tr>
</tbody></table>

<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird bei Misserfolg auf 1 und bei Erfolg auf 0 gesetzt.</p>
<h3>Bemerkungen</h3>
<p>ControlSendRaw sendet die Tastatureingaben im <em>Tasten</em>-Parameter exakt so, wie sie angegeben wurden sind, anstatt z. B. {Enter} in eine ENTER-Taste, ^c in Steuerung+C usw. umzuwandeln.</p>
<p>Sobald der <em>Steuerelement</em>-Parameter weggelassen wird, versucht dieser Befehl, die Tastatureingaben direkt ans Fenster zu senden. Dabei wird das oberste Steuerelement (welches oft das Richtige ist) genommen oder das Fenster selbst, falls keine Steuerelemente vorhanden sind. Das ist n&uuml;tzlich, wenn das Fenster scheinbar &uuml;berhaupt keine Steuerelemente hat oder es dem Benutzer egal ist, welchem Steuerelement die Tastatureingaben gesendet werden.</p>
<p>Standardm&auml;&szlig;ig werden Modifikatortasten (Steuerung, Alt, Umschalt und Win) wie beim Send-Befehl normal gesendet. Dadurch k&ouml;nnen Gro&szlig;buchstaben, Steuerungszeichen usw. von der Eingabeaufforderung und von anderen Konsolenfenstern richtig erfasst werden. M&ouml;glicherweise wird dadurch die Zuverl&auml;ssigkeit auch bei anderen Dingen verbessert.</p>
<p>In einigen F&auml;llen kann es passieren, dass diese Modifikatortasten nicht richtig im aktiven Fenster funktionieren, besonders wenn der Benutzer die Tastatur beim Ausf&uuml;hren eines ControlSend-Befehls intensiv  benutzt oder die Alt-Taste gesendet wurde (da Alt die Men&uuml;leiste im aktiven Fenster aktiviert). Das kann verhindert werden, indem die Modifikatortaste wie im folgenden Beispiel direkt gedr&uuml;ckt und danach wieder losgelassen wird:
</p>
<pre>ControlSend, Edit1, {Alt down}f{Alt up}, Unbenannt - Editor</pre>
<p></p>
<p>Diese Methode erlaubt es auch, Modifikatortasten (Steuerung/Alt/Umschalt/Win) zu senden, w&auml;hrend der Arbeitsplatz gesperrt ist (gesch&uuml;tzt durch die Anmeldeaufforderung).</p>
<p><a href="BlockInput.htm">BlockInput</a> sollte vermieden werden, wenn ControlSend bei einem Konsolenfenster wie die Eingabeaufforderung verwendet wird. Denn es ist anzunehmen, dass dadurch die Gro&szlig;schreibung und Modifikatortasten wie Steuerung nicht richtig funktionieren.</p>
<p>Die Geschwindigkeit, mit welcher die Tasten gesendet werden, wird durch <a href="SetKeyDelay.htm">SetKeyDelay</a> beeinflusst. Falls die Tastatureingaben nicht ordnungsgem&auml;&szlig; beim Zielfenster ankommen, erh&ouml;ht versuchsweise die Druckdauer mithilfe des zweiten Parameters von <a href="SetKeyDelay.htm">SetKeyDelay</a>:
</p>
<pre>SetKeyDelay, 10, 10
SetKeyDelay, 0, 10
SetKeyDelay, -1, 0
</pre>
<p></p>
<p>Ist das Zielsteuerelement ein Eingabefeld oder &Auml;hnliches, sind die folgenden Befehle in der Regel zuverl&auml;ssiger und schneller als ControlSend:
</p>
<pre><a href="Control.htm">Control</a>, EditPaste, Dieser Text wird am Cursor angef&uuml;gt., Steuerelementname, Fenstertitel
<a href="ControlSetText.htm">ControlSetText</a>, Dieser Text ersetzt vollst&auml;ndig den aktuell vorhandenen Text., Fenstertitel
</pre>
<p></p>
<p>ControlSend ist generell nicht in der Lage, die Men&uuml;leiste eines Fensters zu manipulieren. Als &Uuml;bergangsl&ouml;sung kann <a href="WinMenuSelectItem.htm">WinMenuSelectItem</a> verwendet werden. Ist das aufgrund der Beschaffenheit der Men&uuml;leiste nicht m&ouml;glich, findet heraus, welche Nachricht zum gew&uuml;nschten Men&uuml;eintrag geh&ouml;rt, indem das <a href="../misc/SendMessage.htm">SendMessage-Tutorial</a> befolgt wird.</p>
<p>Fenstertitel und -texte sind von der Gro&szlig;- und Kleinschreibung abh&auml;ngig. Solange <a href="DetectHiddenWindows.htm">DetectHiddenWindows</a> deaktiviert ist, werden versteckte Fenster nicht wahrgenommen.</p>
<h3>Verwandte Befehle</h3>
<p><a href="SetKeyDelay.htm">SetKeyDelay</a>, <a href="_EscapeChar.htm">Schutzsequenzen (z. B. `%) </a>, <a href="Control.htm">Control</a>, <a href="ControlGet.htm">ControlGet</a>, <a href="ControlGetText.htm">ControlGetText</a>, <a href="ControlMove.htm">ControlMove</a>, <a href="ControlGetPos.htm">ControlGetPos</a>, <a href="ControlClick.htm">ControlClick</a>, <a href="ControlSetText.htm">ControlSetText</a>, <a href="ControlFocus.htm">ControlFocus</a>, <a href="Send.htm">Send, </a><a href="../misc/Winamp.htm">Winamp automatisieren</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent">ControlSend, Edit1, Das ist eine Textzeile im Editor-Fenster., Unbenannt
SetTitleMatchMode, 2
ControlSend, , abc, cmd.exe  <em>; Direkt zur Eingabeaufforderung senden.</em></pre>

</div>
</div>
</body></html>