<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Drive</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../../NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(2);</script>


<h1>Drive</h1>

<p>&Ouml;ffnet/Schlie&szlig;t einen CD- oder DVD-Laufwerk oder &auml;ndert die Laufwerksbezeichnung.</p>

<pre class="Syntax">Drive, Unterbefehl [, Laufwerk, Wert]</pre>
<p>Die Parameter <i>Unterbefehl</i>, <i>Laufwerk</i> und <i>Wert</i> sind voneinander abh&auml;ngig und k&ouml;nnen wie folgt verwendet werden.</p>
<p><strong>Label, Laufwerk [, Name]</strong>: &Auml;ndert die Bezeichnung vom <em>Laufwerk</em> zu <em>Name</em> (wenn <em>Name</em> nicht vorhanden ist, dann hat das Laufwerk keine Bezeichnung). Der <em>Laufwerk</em> besteht aus dem Laufwerkbuchstaben, gefolgt von einem Doppelpunkt einem optionalen Backslash (funktioniert auch mit UNC's und zugeordneten Laufwerken). Zum Beispiel: Drive, Label, C:, Seagate200</p>
<p>Zum Abrufen der aktuellen Bezeichnung, siehe folgendes Beispiel: <a href="DriveGet.htm">DriveGet</a>, Ausgabevariable, Label, C:</p>
<p><strong><br> Lock, Laufwerk</strong>: Verhindert, dass ein Laufwerk ge&ouml;ffnet wird. Zum Beispiel: "Drive, Lock, D:". Die meisten Laufwerke k&ouml;nnen nicht gesperrt werden, wenn sie offen sind. Wenn das Laufwerk gesperrt wird, w&auml;hrend es schlie&szlig;t, dann ist es m&ouml;glich, dass das Laufwerk sofort gesperrt wird. Dieser Befehl hat keine Auswirkung auf Laufwerke, die sich nicht sperren lassen (wie bei den meisten Read-Only-Laufwerken) und/oder Nicht-IDE-Laufwerke in Windows 95/98/Me sind. Wenn ein Laufwerk gesperrt und das verantwortliche Script beendet wird, dann bleibt das Laufwerk solange gesperrt, bis ein anderes Script oder Programm die Sperrung aufhebt oder das System neu gestartet wird. Wenn das angegebene Laufwerk nicht existiert oder die Sperrfunktion nicht unterst&uuml;tzt, dann wird ErrorLevel auf 1 gesetzt. Ansonsten auf 0.</p>
<p><br> <strong>Unlock, Laufwerk</strong>: Kehrt das Obengenannte um. In Windows NT/2000/XP oder h&ouml;her muss <em>Unlock</em> mehrmals ausgef&uuml;hrt werden, wenn das Laufwerk mehrmals gesperrt wurde (zumindest f&uuml;r einige Laufwerke). Wenn beispielsweise "Drive, Lock, D:" dreimal ausgef&uuml;hrt wird, dann ist dreimal "Drive, Unlock, D:" notwendig, um die Sperre wieder aufzuheben. Aus diesem Grund ist es ratsam, den Sperrstatus in eine <a href="../Variables.htm">Variable</a> zu hinterlassen, da nicht festgestellt werden kann, ob ein Laufwerk gesperrt ist.</p>
<p><strong><br> Eject [, Laufwerk, 1]</strong>: &Ouml;ffnet oder schlie&szlig;t ein CD- oder DVD-Laufwerk (um andere Medien- oder Ger&auml;tetypen zu &ouml;ffnen, siehe DllCall-Beispiel am Ende dieser Seite).</p>
<p>Wenn <em>Laufwerk</em> nicht vorhanden ist, dann wird das Standard-CD/DVD-Laufwerk verwendet. Um das Laufwerk zu &ouml;ffnen, lasst den letzten Parameter weg. Um das Laufwerk zu schlie&szlig;en, setzt den letzten Parameter auf 1. Zum Beispiel: <em>Drive, Eject, D:, 1</em></p>
<p><em>Drive Eject</em> wartet auf ein erfolgreiches &Ouml;ffnen oder Schlie&szlig;en des Laufwerks, bevor das Script fortgesetzt wird. Wenn das Laufwerk bereits in richtiger Position ist (ge&ouml;ffnet oder geschlossen), dann wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 0 gesetzt.</p>
<p><em>Drive Eject</em> wird wahrscheinlich nicht bei Netzwerklaufwerken oder Nicht-CD/DVD-Laufwerke funktionieren. In solchen F&auml;llen wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt.</p>
<p>Es ist vielleicht m&ouml;glich, den Status des Laufwerks zu erkennen, wenn die Ausf&uuml;hrungszeit des Befehls gemessen wird. Im folgenden Beispiel wird das Laufwerk mit einem Hotkey in den entgegengesetzten Zustand geschaltet (&ouml;ffnen oder schlie&szlig;en):</p>
<pre>#c::
Drive, Eject
<em>; Wenn der Befehl schnell fertig ist, dann war das Laufwerk wahrscheinlich bereits offen.
; In diesem Fall das Laufwerk schlie&szlig;en:</em>
If A_TimeSinceThisHotkey &lt; 1000  <em>; Zeit anpassen, wenn n&ouml;tig.</em>
    Drive, Eject,, 1
Return</pre>
<p>Um den Medienstatus eines CD- oder DVD-Laufwerks zu ermitteln (l&auml;uft, angehalten, offen, etc.), siehe <a href="DriveGet.htm">DriveGet</a>.</p>
<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p>Bei Problemen wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt, ansonsten enth&auml;lt ErrorLevel eine 0.</p>
<h3>Bemerkungen</h3>
<p>Das folgende Script ist eine alternative Methode, Medien-/Ger&auml;tetypen anders als CD/DVD zu &ouml;ffnen oder schlie&szlig;en:</p>
<pre><em>; Passt die erste Zeile mit eurem entsprechenden Laufwerk an (alle anderen Zeilen k&ouml;nnen ignoriert werden).</em>
Laufwerksbuchstabe = I:  <em>; Hier den gew&uuml;nschten Laufwerksbuchstaben einsetzen.</em>

hVolume := DllCall("CreateFile"
    , Str, "\\.\" . Laufwerksbuchstabe
    , UInt, 0x80000000 | 0x40000000  <em>; GENERIC_READ | GENERIC_WRITE</em>
    , UInt, 0x1 | 0x2  <em>; FILE_SHARE_READ | FILE_SHARE_WRITE</em>
    , UInt, 0
    , UInt, 0x3  <em>; OPEN_EXISTING</em>
    , UInt, 0, UInt, 0)
If hVolume &lt;&gt; -1
{
    DllCall("DeviceIoControl"
        , UInt, hVolume
        , UInt, 0x2D4808   <em>; IOCTL_STORAGE_EJECT_MEDIA</em>
        , UInt, 0, UInt, 0, UInt, 0, UInt, 0
        , UIntP, dwBytesReturned  <em>; Unbenutzt.</em>
        , UInt, 0)
    DllCall("CloseHandle", UInt, hVolume)
}</pre>
<h3>Verwandte Befehle</h3>
<p><a href="DriveGet.htm">DriveGet</a>, <a href="DriveSpaceFree.htm">DriveSpaceFree</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">Drive, Label, D:, BackupDrive
Drive, Eject,, 1 <em>; Schlie&szlig;t das Standard-CD/DVD-Laufwerk</em></pre>

</body>
</html>