<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>DriveGet</title>
<meta name="keywords" content="Befehl, Laufwerk">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../../NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(2);</script>


<h1>DriveGet</h1>

<p>Ermittelt unterschiedliche Informationen &uuml;ber die Laufwerke eines Computers.</p>

<pre class="Syntax">DriveGet, Ausgabevariable, Befehl [, Wert]</pre>
<h3>Parameter</h3>
<table class="info">
  <tbody>
<tr>
    <td width="15%">Ausgabevariable</td>
    <td width="85%">
<p>Der Name der Variable, in der der R&uuml;ckgabewert vom <em>Befehl</em> gespeichert wird.</p></td>
  </tr>
  <tr>
    <td>Befehl, Wert</td>
    <td>Siehe untere Liste.
    </td>
  </tr>
</tbody></table>

<h3>Befehl, Wert</h3>
<p>Die Parameter <em>Befehl</em> und <em>Wert</em> sind voneinander abh&auml;ngig und k&ouml;nnen wie folgt verwendet werden. Bei einem Problem wird die <em>Ausgabevariable</em> leer gemacht und <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt.</p>
<p><strong>List [, Typ]</strong>: Die <em>Ausgabevariable</em> enth&auml;lt die Buchstaben aller verf&uuml;gbaren Laufwerke. Zum Beispiel: ACDEZ. Sobald der <em>Typ</em> weggelassen wird, werden alle Laufwerksarten abgerufen. Andernfalls sollte der <em>Typ</em> eins der folgenden W&ouml;rter sein, um nur eine bestimmte Laufwerksart zu ermitteln: CDROM, REMOVABLE, FIXED, NETWORK, RAMDISK, UNKNOWN.</p>
<p><strong>Capacity (oder Cap), Pfad</strong>: Ermittelt die Gesamtkapazit&auml;t vom <em>Pfad</em> (z. B. C:\) in Megabyte. Mithilfe von <a href="DriveSpaceFree.htm">DriveSpaceFree</a> kann der freie Speicherplatz abgerufen werden.</p>
<p><strong>Filesystem (oder FS), Laufwerk</strong>: Ermittelt das Dateisystem des <em>Laufwerks</em>, wobei im Parameter <em>Laufwerk</em> der Laufwerksbuchstabe, gefolgt von einem Doppelpunkt und einem Backslash, oder ein UNC-Name wie \server1\share1 angegeben werden muss. Die <em>Ausgabevariable</em> wird eins der folgenden W&ouml;rter enthalten: FAT, FAT32, NTFS, CDFS (f&uuml;r eine CD), UDF (f&uuml;r eine DVD). Die <em>Ausgabevariable</em> wird leer gemacht und <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt, wenn das Laufwerk kein formatiertes Medium enth&auml;lt.</p>
<p><strong>Label, Laufwerk</strong>: Ermittelt die Datentr&auml;gerbezeichnung des <em>Laufwerks</em>, wobei im Parameter <em>Laufwerk</em> ein Laufwerksbuchstabe, gefolgt von einem Doppelpunkt und einem Backslash, oder ein UNC-Name wie \server1\share1 angegeben werden muss. Die aktuelle Bezeichnung kann wie folgt ge&auml;ndert werden: <code><a href="Drive.htm">Drive</a>, Label, C:, EigenesLabel</code></p>
<p><strong>Serial, Laufwerk</strong>: Ermittelt die Datentr&auml;gerseriennummer des <em>Laufwerks</em>, wobei im Parameter <em>Laufwerk</em> ein Laufwerksbuchstabe, gefolgt von einem Doppelpunkt und einem Backslash, oder ein UNC-Name wie \server1\share1 angegeben werden muss. Siehe <a href="SetFormat.htm">SetFormat</a>, wie die Nummer in hexadezimal umgewandelt werden kann.</p>
<p><strong>Type, Pfad</strong>: Ermittelt den Laufwerkstyp des <em>Pfads</em>: Unknown, Removable, Fixed, Network, CDROM, RAMDisk.</p>
<p><strong>Status, Pfad</strong>: Ermittelt den Laufwerksstatus des <em>Pfads</em>: Unknown (k&ouml;nnte auf unformatiert/RAW hindeuten), Ready, NotReady (typisch f&uuml;r Wechseldatentr&auml;ger, die kein Medium enthalten), Invalid (<em>Pfad</em> existiert nicht, ein Netzwerk-Laufwerk ist zurzeit nicht erreichbar, usw.)</p>
<p><strong>StatusCD [, Laufwerk]</strong>: Ermittelt den Mediumstatus eines CD- oder DVD-Laufwerks, wobei im Parameter <em>Laufwerk</em> der Laufwerksbuchstabe, gefolgt von einem Doppelpunkt, angegeben werden kann (sobald das <em>Laufwerk</em> weggelassen wird, wird das Standard-CD/DVD-Laufwerk verwendet). Die <em>Ausgabevariable</em> wird leer gemacht, wenn der Status nicht ermittelt werden kann. Ansonsten enth&auml;lt sie einen der folgenden Strings:</p>
<table class="info">
  <tbody>
<tr>
    <td width="15%">not ready</td>
    <td width="85%">Das Laufwerk ist nicht erreichbar, da es vermutlich an einer Schreib-Operation beteiligt ist. Bekannte Einschr&auml;nkung: "not ready" tritt auch auf, wenn das Laufwerk eine DVD anstelle einer CD enth&auml;lt.</td>
  </tr>
  <tr>
    <td>open</td>
    <td>Das Laufwerk enth&auml;lt kein Medium oder ist offen.</td>
  </tr>
  <tr>
    <td>playing</td>
    <td>Das Laufwerk spielt gerade ein Medium ab.</td>
  </tr>
  <tr>
    <td>paused</td>
    <td>Das zuvor abgespielte Audio oder Video ist nun pausiert. </td>
  </tr>
  <tr>
    <td>seeking</td>
    <td>Das Laufwerk ist beim Suchen. </td>
  </tr>
  <tr>
    <td>stopped</td>
    <td>Das Laufwerk enth&auml;lt eine CD, die jedoch zurzeit nicht verwendet wird.</td>
  </tr>
</tbody></table>
<p>Dieser Befehl wird wahrscheinlich nicht funktionieren, wenn das Laufwerk sich im Netzwerk befindet oder kein CD/DVD-Laufwerk ist. In solchen oder &auml;hnlichen F&auml;llen wird die <em>Ausgabevariable</em> leer gemacht und <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt.</p>
<p>Die Ausf&uuml;hrung des Befehls wird m&ouml;glicherweise hinausgez&ouml;gert, falls das Laufwerk gerade geschlossen wurde.<br></p>
<p>Mit dem <a href="Drive.htm">Drive</a>-Befehl kann das Laufwerk aus- oder eingefahren werden.</p>
<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird bei Misserfolg auf 1 und bei Erfolg auf 0 gesetzt.</p>
<h3>Bemerkungen</h3>
<p>Einige dieser Befehle akzeptieren auch Netzwerkfreigabenamen als <em>Pfad</em> (z. B. \\EigenerServer\EigeneFreigabe\).</p>
<h3>Verwandte Befehle</h3>
<p><a href="Drive.htm">Drive</a>, <a href="DriveSpaceFree.htm">DriveSpaceFree</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent"><em>; Das ist ein funktionierendes Beispiel-Script.</em>
FileSelectFolder, folder, , 3, Laufwerk zur &Uuml;berpr&uuml;fung ausw&auml;hlen:
If folder =
    Return
DriveGet, list, list
DriveGet, cap, capacity, %folder%
DrivespaceFree, free, %folder%
DriveGet, fs, fs, %folder%
DriveGet, label, label, %folder%
DriveGet, serial, serial, %folder%
DriveGet, type, type, %folder%
DriveGet, status, status, %folder%
MsgBox Alle Laufwerke: %list%`nAusgew&auml;hlt: %folder%`nTyp: %type%`nStatus: %status%`nSpeicherkapazit&auml;t (in MB): %cap% M`nFreier Speicher (in MB): %free% M`nDateisystem: %fs%`nBezeichnung: %label%`nSeriennummer: %serial%</pre>


</body></html>