<!DOCTYPE HTML>
<html>
<head>
<title>FileSelectFolder</title>
<meta name="keywords" content="Befehl, Ordner, Dialogfenster, Grafische Benutzeroberfl&auml;che">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
    <h1>FileSelectFolder</h1>
    <p>Zeigt ein Standard-Dialogfenster an, womit der Benutzer einen Ordner ausw&auml;hlen kann.</p>
    <pre class="Syntax">FileSelectFolder, Ausgabevariable [, Startordner, Optionen, Anzeigetext]</pre>
    <h3>Parameter</h3>
    <table class="info">
      <tr>
        <td style="width: 15%;">Ausgabevariable</td>
        <td style="width: 85%;"><p>Name der Variable, in der der ausgew&auml;hlte Ordner gespeichert werden soll. Sie ist leer, falls der Benutzer das Dialogfenster abgebrochen hat (weil er einen Ordner nicht ausw&auml;hlen m&ouml;chte). W&auml;hlt der Benutzer ein Hauptverzeichnis aus (z. B. C:\), endet <i>Ausgabevariable</i> mit einem Backslash. Falls das unerw&uuml;nscht ist, kann es wie folgt entfernt werden:</p>
          <pre>FileSelectFolder, Ordner
Ordner := RegExReplace(Ordner, "\\$")  <em>; Entfernt das Backslash am Ende, falls vorhanden.</em></pre></td>
      </tr>
      <tr>
        <td>Startordner</td>
        <td><p>Ist dieser Parameter leer oder nicht vorhanden, beginnt die Startauswahl im Benutzerordner "Eigene Dateien" (oder auch im Arbeitsplatz/Computer). Ein <a href="../misc/CLSID-List.htm">CLSID-Ordner</a> wie <code>::{20d04fe0-3aea-1069-a2d8-08002b30309d}</code> (Arbeitsplatz/Computer) kann angegeben werden, um die Navigation bei einem bestimmten Ordner zu beginnen.</p>
          <p>Ansonsten kann in diesem Parameter ein Sternchen angegeben werden, unmittelbar gefolgt vom absoluten Pfad des Laufwerks oder Ordners, das anf&auml;nglich ausgew&auml;hlt sein soll. Zum Beispiel w&uuml;rde mit <code>*C:\ </code>die Navigation beim C-Laufwerk beginnen. Ebenso w&uuml;rde mit <code>*C:\Eigener Ordner</code> anf&auml;nglich dieser bestimmte Ordner ausgew&auml;hlt.</p>
          <p>Das Sternchen kennzeichnet, dass der Benutzer berechtigt ist, vom Startordner bis zum Hauptverzeichnis zu navigieren. Ohne Sternchen darf der Benutzer nur einen Ordner innerhalb von <em>Startordner</em> (oder den <em>Startordner</em> selbst) ausw&auml;hlen. Das Weglassen des Sternchens hat den Vorteil, dass der Verzeichnisbaum von <em>Startordner</em> anfangs aufgeklappt ist, wodurch es dem Benutzer erspart bleibt, erst das Pluszeichen anklicken zu m&uuml;ssen.</p>
          <p>Ist das Sternchen vorhanden, kann bei Bedarf die Aufw&auml;rtsnavigation auf einen Ordner (au&szlig;er Desktop) beschr&auml;nkt werden. Dazu muss vor dem Sternchen der absolute Pfad des h&ouml;chsten Ordners und ein nachfolgendes Leer- oder Tabulatorzeichen angegeben werden. Das folgenden Beispiel zeigt, wie der Benutzer daran gehindert werden kann, auf die dar&uuml;berliegende Ebene von C:\Eigener Ordner zu navigieren (das Startverzeichnis selbst ist aber C:\Eigener Ordner\Projekte): <code>C:\Eigener Ordner *C:\Eigener Ordner\Projekte</code>.</p></td>
      </tr>
      <tr>
        <td>Optionen</td>
        <td><p>Eine der folgenden Zahlen:</p>
          <p><strong>0</strong>: Alle unteren Optionen sind deaktiviert (in Windows 2000 wird trotzdem die Schaltfl&auml;che "Neuer Ordner" angezeigt).</p>
          <p><strong>1</strong> (Standard): Es wird eine Schaltfl&auml;che zur Verf&uuml;gung gestellt, die der Benutzer verwenden kann, um  neue Ordner zu erstellen. In Windows 95/98/NT ist diese Schaltfl&auml;che  allerdings nicht vorhanden.</p>
          <p><strong>Addiere 2</strong> mit der oberen Zahl, um ein Eingabefeld bereitzustellen, das der Benutzer f&uuml;r die Eingabe eines Ordnernamens verwenden kann. Hat dieser Parameter beispielsweise eine Wert von 3, w&uuml;rde sowohl ein Eingabefeld als auch die Schaltfl&auml;che "Neuer Ordner" hinzugef&uuml;gt.</p>
          <p id="NewDialog"><strong>Addiere 4</strong> mit der oberen Zahl, um die BIF_NEWDIALOGSTYLE-Eigenschaft zu entfernen. Die Addition mit 4 stellt sicher, dass FileSelectFolder auch in einer Vorinstallationsumgebung wie WinPE oder BartPE funktioniert. Allerdings wird dadurch verhindert, dass die Schaltfl&auml;che "Neuer Ordner" angezeigt wird, zumindest unter Windows XP. ["4" ben&ouml;tigt v1.0.48+]</p>
          <p>Schreibt der Benutzer einen ung&uuml;ltigen Ordnernamen ins Eingabefeld, wird <i>Ausgabevariable</i> den Ordner enthalten, der im Navigationsbereich ausgew&auml;hlt wurde, anstatt das, was der Benutzer eingegeben hat, zumindest unter Windows XP.</p>
          <p>Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein. </p></td>
      </tr>
      <tr>
        <td>Anzeigetext</td>
        <td>Text, der im Fenster angezeigt werden soll, um den Benutzer Instruktionen zu erteilen, was zutun ist. Ist dieser Parameter leer oder nicht vorhanden, gilt standardm&auml;&szlig;ig "Select Folder - %A_SCRIPTNAME%" (der Name des aktuellen Scripts).</td>
      </tr>
    </table>
    <h3>ErrorLevel</h3>
    <p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
    <p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 1 gesetzt, wenn der Benutzer das Dialogfenster geschlossen hat, ohne einen Ordner ausgew&auml;hlt zu haben (z. B. durch Dr&uuml;cken der Schaltfl&auml;che "Abbrechen"), oder wenn das Betriebssystem sich weigert, das Dialogfenster anzuzeigen (selten). Ansonsten wird es auf 0 gesetzt.</p>
    <h3>Bemerkungen</h3>
    <p>Ein GUI-Fenster kann per <code>Gui, <a href="Gui.htm#OwnDialogs">+OwnDialogs</a></code> ein modales Ordnerauswahlfenster anzeigen. Ein modales Dialogfenster bewirkt, dass der Benutzer erst wieder mit dem GUI-Fenster interagieren kann, wenn das Dialogfenster geschlossen wird.</p>
    <p>Bekannte Einschr&auml;nkung: Ein <a href="SetTimer.htm">Timer</a>, der gestartet wird, w&auml;hrend ein Ordnerauswahlfenster angezeigt wird, z&ouml;gert das Klicken des Benutzers im Fenster solange hinaus, bis dieser beendet wird. M&ouml;chtest du dieses Problem umgehen, solltest du Timer vermeiden, deren Subroutinen eine lange Zeit zum Beenden brauchen, oder alle Timer anhalten, w&auml;hrend das Dialogfenster angezeigt wird:</p>
    <pre><a href="Thread.htm">Thread</a>, NoTimers
FileSelectFolder, Ausgabevariable,, 3
Thread, NoTimers, false</pre>
    <h3>Verwandte Befehle</h3>
    <p><a href="FileSelectFile.htm">FileSelectFile</a>, <a href="MsgBox.htm">MsgBox</a>, <a href="InputBox.htm">InputBox</a>, <a href="ToolTip.htm">ToolTip</a>, <a href="Gui.htm">GUI</a>, <a href="../misc/CLSID-List.htm">CLSID-Liste</a>, <a href="FileCopyDir.htm">FileCopyDir</a>, <a href="FileMoveDir.htm">FileMoveDir</a>, <a href="SplitPath.htm">SplitPath</a></p>
    <p>Das Betriebssystem bietet zudem Standard-Dialogfenster, die den Benutzer auffordern k&ouml;nnen, eine Farbe, eine Schriftart oder ein Icon auszuw&auml;hlen. Diese Dialogfenster k&ouml;nnen per <a href="DllCall.htm">DllCall()</a> angezeigt werden, siehe dazu <a href="http://www.autohotkey.com/forum/topic17230.html">www.autohotkey.com/forum/topic17230.html</a>.</p>
    <h3>Beispiel</h3>
    <pre class="NoIndent">FileSelectFolder, Ausgabevariable, , 3
If Ausgabevariable =
    MsgBox, Keinen Ordner ausgew&auml;hlt.
Else
    MsgBox, Ordner "%Ausgabevariable%" ausgew&auml;hlt.

<a href="../misc/CLSID-List.htm">CLSID</a>-Beispiel:
FileSelectFolder, Ausgabevariable, ::{20d04fe0-3aea-1069-a2d8-08002b30309d}  <em>; Arbeitsplatz/Computer</em></pre>
  </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>