<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>FileInstall</title>
<meta name="keywords" content="Befehl, Datei">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>FileInstall</h1>

<p>F&uuml;gt die angegebene Datei in die <a href="../Scripts.htm#ahk2exe">kompilierte Version</a> des Scripts ein.</p>

<pre class="Syntax">FileInstall, Quelle, Ziel [, Flag]</pre>
<h3>Parameter</h3>
<table class="info">
  <tbody>
<tr>
    <td>Quelle</td>
    <td>
<p>Der Name der Datei, die zur kompilierten EXE-Datei hinzugef&uuml;gt wird. Die Datei befindet sich im (oder ist relativ zum) Arbeitsverzeichnis des Scripts, solange kein absoluter Pfad angegeben ist.</p>
    <p>Der Dateiname <strong>darf keine</strong> Anf&uuml;hrungszeichen, Variablenverweise (z. B.%A_ProgramFiles%) oder Platzhalter enthalten. Dar&uuml;ber hinaus m&uuml;ssen Sonderzeichen wie direkte Prozentzeichen und Kommas <a href="_EscapeChar.htm">gesch&uuml;tzt</a> werden (wie in jedem anderen Befehlsparameter auch). Schlie&szlig;lich muss dieser Parameter rechts von FileInstall erfolgen (d. h. nicht auf eine <a href="../Scripts.htm#continuation">Fortsetzungszeile</a> darunter).</p>    </td>
  </tr>
  <tr>
    <td>Ziel</td>
    <td>Der neue Name der Datei, wenn die <em>Quelle</em> aus der EXE-Datei extrahiert wird. Die Datei befindet sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis, solange kein absoluter Pfad angegeben ist. Das Zielverzeichnis muss bereits vorhanden sein. Im Gegensatz zur <em>Quelle</em> k&ouml;nnen hier Variablenverweise eingesetzt werden.</td>
  </tr>
  <tr>
    <td width="15%">Flag</td>
    <td width="85%">
<p>(Optional) Dieser Parameter bestimmt, ob Dateien &uuml;berschrieben werden d&uuml;rfen, falls sie bereits vorhanden sind:</p>
        <p>0 = (Standard) vorhandene Dateien nicht &uuml;berschreiben<br>1 = vorhandene Dateien &uuml;berschreiben</p>
        <p>Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein, auch einer, der als wahr oder falsch gewertet wird (weil True und False intern als 1 und 0 gespeichert sind).</p></td>
  </tr>
</tbody></table>
<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird bei Misserfolg auf 1 und bei Erfolg auf 0 gesetzt.</p>
<h3>Bemerkungen</h3>
<p>Dieser Befehl ist eine Direktive f&uuml;r den <a href="../Scripts.htm#ahk2exe">Ahk2Exe-Compiler</a>, die es erlaubt, zus&auml;tzliche Dateien in das kompilierte Script einzuf&uuml;gen. Sobald das kompilierte Script ausgef&uuml;hrt wird, werden diese Dateien wieder auf das Laufwerk extrahiert.</p>
<p>Die Datei wird <strong>w&auml;hrend der Script-Kompilierung</strong> hinzugef&uuml;gt. Sobald das kompilierte Script ausgef&uuml;hrt und FileInstall erreicht wird, wird die Datei ins <em>Ziel</em> extrahiert.</p>
<p>Dateien, die auf diese Weise hinzugef&uuml;gt werden, sind komprimiert als auch verschl&uuml;sselt.</p>
<p>Wenn dieser Befehl in einem normalen (nicht kompilierten) Script verwendet wird, erfolgt stattdessen ein einfaches Kopieren der Datei (das hilft dabei, Scripts zu testen, die eventuell kompiliert werden).</p>
<h3>Verwandte Befehle</h3>
<p><a href="FileCopy.htm">FileCopy</a>, <a href="_Include.htm">#Include</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">FileInstall, C:\Eigene Dokumente\Eigene Datei.txt, %A_ProgramFiles%\Eigene Anwendung\Readme.txt, 1</pre>


</body></html>