<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>FileInstall</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>
<script src="../../NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(2);</script>


<h1>FileInstall</h1>

<p>F&uuml;gt die angegebene Datei in die <a href="../Scripts.htm#ahk2exe">kompilierte Version</a> des Scripts ein.</p>

<pre class="Syntax">FileInstall, Quelle, Ziel [, Flag]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td>Quelle</td>
    <td><p>Der Name der Datei, die zur kompilierten EXE-Datei hinzugef&uuml;gt wird. Es wird davon ausgegangen, dass die Datei sich im Ordner des Scripts befindet, solange kein absoluter Pfad angegeben ist.</p>
    <p>Der Dateiname <strong>darf keine</strong> Anf&uuml;hrungszeichen, Variablenverweise (z. B.%A_ProgramFiles%) oder Platzhalter enthalten. Dar&uuml;ber hinaus m&uuml;ssen Sonderzeichen wie direkt vorhandene Prozentzeichen und Kommas <a href="_EscapeChar.htm">gesch&uuml;tzt</a> werden (wie in jedem anderen Befehlsparameter auch). Schlie&szlig;lich muss dieser Parameter rechts vom FileInstall-Befehl erfolgen (d. h. nicht auf eine <a href="../Scripts.htm#continuation">Fortsetzungszeile</a> darunter).</p>    </td>
  </tr>
  <tr>
    <td>Ziel</td>
    <td>Wenn die <em>Quelle</em> von einer EXE-Datei extrahiert wird, dann ist dieser Parameter der Name der Datei, die erstellt wird. Sie befindet sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis, solange kein absoluter Pfad angegeben ist. Das Zielverzeichnis muss bereits vorhanden sein. Im Gegensatz zur <em>Quelle</em> k&ouml;nnen hier Variablenverweise eingesetzt werden.</td>
  </tr>
  <tr>
    <td width="15%">Flag</td>
    <td width="85%"><p>(Optional) Mit diesem Parameter wird bestimmt, ob Dateien &uuml;berschrieben werden, wenn sie bereits vorhanden sind:</p>
        <p>0 = (Standard) vorhandene Dateien nicht &uuml;berschreiben<br>1 = vorhandene Dateien &uuml;berschreiben</p>
        <p>Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> oder True bzw. False sein (intern auch als 1 bzw. 0 gespeichert).</p></td>
  </tr>
</table>
<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p>Bei Problemen wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt, ansonsten enth&auml;lt ErrorLevel eine 0.</p>
<h3>Bemerkungen</h3>
<p>Dieser Befehl ist eine Anweisung f&uuml;r den <a href="../Scripts.htm#ahk2exe">Ahk2Exe-Compiler</a>, um Dateien zus&auml;tzlich zum kompilierten Script hinzuzuf&uuml;gen. Wird das kompilierte Script danach ausgef&uuml;hrt, werden die Dateien wieder auf das Laufwerk extrahiert.</p>
<p>Die Datei wird <strong>w&auml;hrend der Script-Kompilierung</strong> hinzugef&uuml;gt.&nbsp; Wenn das ausgef&uuml;hrte kompilierte Script den FileInstall-Befehl erreicht, dann wird die Datei ans <em>Ziel</em> extrahiert.</p>
<p>Die hinzugef&uuml;gten Dateien sind komprimiert und verschl&uuml;sselt.</p>
<p>Wenn dieser Befehl in einem normalen (nicht kompilierten) Script verwendet wird, dann erfolgt ein einfaches Kopieren der Datei (zum Testen des Scripts, wenn es kompiliert werden soll).</p>
<h3>Verwandte Befehle</h3>
<p><a href="FileCopy.htm">FileCopy</a>, <a href="_Include.htm">#Include</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">FileInstall, C:\Eigene Dokumente\Eigene Datei.txt, %A_ProgramFiles%\Eigene Anwendung\Readme.txt, 1</pre>

</body>
</html>