<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>FileCreateShortcut</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>

<h1>FileCreateShortcut</h1>

<p>Erstellt eine Verkn&uuml;pfungsdatei (.lnk).</p>

<pre class="Syntax">FileCreateShortcut, Ziel, Verkn&uuml;pfungsdatei [, Arbeitsverzeichnis, Parameter, Beschreibung, Icondatei, Tastenk&uuml;rzel, Iconnummer, Ausf&uuml;hrungsstatus]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%"> Ziel </td>
    <td width="85%">Name der zu verkn&uuml;pfenden Datei, die nur einen absoluten Pfad beinhalten sollte, wenn sie im System integriert ist (z. B. Notepad.exe). Die Datei muss nicht vorhanden sein, um eine Verkn&uuml;pfung zu erstellen. Mit anderen Worten k&ouml;nnen Verkn&uuml;pfungen mit einem ung&uuml;ltigen Ziel erstellt werden.</td>
  </tr>
  <tr>
    <td>Verkn&uuml;pfungsdatei</td>
    <td>Name der Verkn&uuml;pfung, die sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis befindet, solange kein absoluter Pfad angegeben ist. Die <strong>.lnk</strong>-Erweiterung muss mit angegeben werden. Wenn die Datei bereits vorhanden ist, dann wird sie &uuml;berschrieben.</td>
  </tr>
  <tr>
    <td>Arbeitsverzeichnis</td>
    <td>Verzeichnis, dass zum Arbeitsverzeichnis vom <em>Ziel</em> wird, wenn die Verkn&uuml;pfung ausgef&uuml;hrt wird. Wenn leer oder nicht vorhanden, dann enth&auml;lt die Verkn&uuml;pfung ein leeres "Ausf&uuml;hren in"-Feld und das System verweist auf ein Standard-Arbeitsverzeichnis, wenn die Verkn&uuml;pfung ausgef&uuml;hrt wird.</td>
  </tr>
  <tr>
    <td>Parameter</td>
    <td>Parameter, die ans <em>Ziel</em> &uuml;bergeben werden, wenn die Verkn&uuml;pfung ausgef&uuml;hrt wird. Parameter werden mit Leerzeichen getrennt. Wenn ein Parameter Leerzeichen enth&auml;lt, umschlie&szlig;t diesen mit Anf&uuml;hrungszeichen.</td>
  </tr>
  <tr>
    <td>Beschreibung</td>
    <td>Kommentare, die die Verkn&uuml;pfung beschreibt (wird vom Betriebssystem verwendet, um einen ToolTip darzustellen, usw.)</td>
  </tr>
  <tr>
    <td>Icondatei</td>
    <td>Der vollst&auml;ndige Pfad und Name des Icons f&uuml;r die <em>Verkn&uuml;pfungsdatei</em>.  Kann entweder eine ICO-Datei oder das erste Icon einer EXE- oder DLL-Datei enthalten.</td>
  </tr>
  <tr>
    <td>Tastenk&uuml;rzel</td>
    <td><p>Ein Buchstabe, eine Zahl oder der Name einer Taste aus der <a href="../KeyList.htm">Tastenliste</a> (Maustasten und andere Nicht-Standard-Tasten werden m&ouml;glicherweise nicht unterst&uuml;tzt). Modifikatorsymbole werden <strong>nicht unterst&uuml;tzt</strong>. Zurzeit werden alle Tastenkombinationen mit STRG+ALT erstellt. Wenn zum Beispiel der Buchstabe B f&uuml;r diesen Parameter angegeben ist, dann lautet die Tastenkombination STRG+ALT+B.</p>
    <p>F&uuml;r Windows 9x: Ein Neustart ist vielleicht notwendig, damit solche Tastenkombinationen in Kraft treten. Alternativ kann man die Tastenkombination auch &uuml;ber das Eigenschaftsfenster erneuern, damit diese sofort in Kraft tritt.</p></td>
  </tr>
  <tr>
    <td>Iconnummer</td>
    <td>F&uuml;r die Verwendung eines beliebigen Icons in der <em>Icondatei</em> muss die Positionsnummer hier eingetragen werden (kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein). Zum Beispiel eine 2 f&uuml;r das zweite Icon.</td>
  </tr>
  <tr>
    <td>Ausf&uuml;hrungsstatus</td>
    <td><p>Um das <em>Ziel</em> minimiert oder maximiert zu starten, f&uuml;gt eine folgende Zahl ein:</p>
      <p>1 - Normal (Standard)<br> 3 - Maximiert<br> 7 - Minimiert</p>    </td>
  </tr>
</table>
<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p>Bei Problemen wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt, ansonsten enth&auml;lt ErrorLevel eine 0.</p>
<h3>Bemerkungen</h3>
<p>Das <em>Ziel</em> muss nicht unbedingt ein Pfad beinhalten, wenn die Zieldatei sich in einem der Ordner in der Umgebungsvariable PATH befindet.</p>
<p>Das <em>Tastenk&uuml;rzel</em> einer neu erstellten Verkn&uuml;pfung ist nur wirksam, wenn die Verkn&uuml;pfungsdatei sich auf dem Desktop oder irgendwo im Startmen&uuml; befindet. Wenn das ausgew&auml;hlte <em>Tastenk&uuml;rzel</em> bereits verwendet wird, dann &uuml;bernimmt die neue Verkn&uuml;pfung des Benutzers Vorrang.</p>
<p>Alternativ kann eine URL-Verkn&uuml;pfung auch wie im folgenden Beispiel erstellt werden. Die ersten beiden Parameter je nach Belieben anpassen:<br> <a href="IniWrite.htm">IniWrite</a>, http://www.google.com, C:\Eigene Verkn&uuml;pfung.url, InternetShortcut, URL</p>
<p>Mit dem folgenden Beispiel kann noch ein Icon zugewiesen werden:<br> <a href="IniWrite.htm">IniWrite</a>, &lt;Icondatei&gt;, C:\Eigene Verkn&uuml;pfung.url, InternetShortcut, IconFile<br> <a href="IniWrite.htm">IniWrite</a>, 0, C:\Eigene Verkn&uuml;pfung.url, InternetShortcut, IconIndex</p>
<p>Ersetzt die 0 mit dem Index des gew&uuml;nschten Icons (0 ist das erste Icon) und ersetzt &lt;Icondatei&gt; mit einer URL-, EXE-, DLL- oder ICO-Datei. Beispiele: C:\Icons.dll, C:\App.exe, http://www.somedomain.com/ShortcutIcon.ico</p>
<p>Das Betriebssystem behandelt eine auf diese Weise erstellte URL-Datei wie eine richtige Verkn&uuml;pfung, selbst wenn es eine Klartextdatei anstelle einer .LNK-Datei ist.</p>
<h3>Verwandte Befehle</h3>
<p><a href="FileGetShortcut.htm">FileGetShortcut</a>, <a href="FileAppend.htm">FileAppend</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent"><em>; Der Buchstabe "i" im letzten Parameter erm&ouml;glicht die Tastenkombination Strg+Alt+I:</em>
FileCreateShortcut, Notepad.exe, %A_Desktop%\Eigene Verkn&uuml;pfung.lnk, C:\, "%A_ScriptFullPath%", Eigene Beschreibung, C:\Eigenes Icon.ico, i</pre>

</body>
</html>