<!DOCTYPE HTML>
<html>
<head>
<title>FileSelectFile</title>
<meta name="keywords" content="Befehl, Datei, Dialogfenster, Grafische Benutzeroberfl&auml;che">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
      <h1>FileSelectFile</h1>
      <p>Zeigt ein Standard-Dialogfenster an, womit der Benutzer eine oder mehrere Dateien &ouml;ffnen oder speichern kann.</p>
      <pre class="Syntax">FileSelectFile, Ausgabevariable [, Optionen, Wurzelverzeichnis\Dateiname, Anzeigetext, Filter]</pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td style="width: 15%;">Ausgabevariable</td>
          <td style="width: 85%;">Name der Variable, in der ein oder mehrere ausgew&auml;hlte Dateinamen gespeichert werden sollen. Sie ist leer, falls der Benutzer das Dialogfenster abgebrochen hat (weil er eine Datei nicht ausw&auml;hlen m&ouml;chte). </td>
        </tr>
        <tr>
          <td>Optionen</td>
          <td><p>Ist dieser Parameter nicht vorhanden, gilt standardm&auml;&szlig;ig 0. Das hei&szlig;t, dass keine der unten genannten Option wirksam ist.</p>
            <p><strong>M</strong>: Mehrfachauswahl. Erlaubt dem Benutzer, mehrere Dateien per <kbd>Umschalt</kbd>+Linksklick, <kbd>Strg</kbd>+Linksklick oder andersweitig auszuw&auml;hlen. Nach <strong>M</strong> kann optional eine der unten genannten Nummern erfolgen (zum Beispiel ist sowohl M als auch M1 g&uuml;ltig). Um einzelne Dateien zu extrahieren, siehe Beispiel unten.</p>
            <p><strong>S</strong>: Speichern. Bewirkt, dass anstelle von &Ouml;ffnen die Schaltfl&auml;che Speichern im Dialogfenster angezeigt wird. Nach <strong>S</strong> kann optional eine der unten genannten Nummern (oder die Summe von mehreren Nummern) erfolgen (zum Beispiel ist sowohl S als auch S24 g&uuml;ltig).</p>
            <p>Die folgenden Nummern k&ouml;nnen auch dann verwendet werden, falls <strong>M</strong> und <strong>S</strong> fehlen. Um mehrere Optionen gleichzeitig zu aktivieren, m&uuml;ssen die Nummern addiert werden. Ben&ouml;tigst du beispielsweise 8 und 16, muss du 24 angeben.</p>
            <p><strong>1</strong>: Datei muss vorhanden sein <br>
              <strong>2:</strong> Pfad muss vorhanden sein <br>
              <strong>8:</strong> Nachfragen, ob eine neue Datei erstellt werden soll <br>
              <strong>16:</strong> Nachfragen, ob die Datei &uuml;berschrieben werden soll <br>
              <strong>32</strong> <span class="ver">[v1.0.43.09+]:</span> Verkn&uuml;pfungen (.lnk) werden wie sie sind ausgew&auml;hlt, anstatt sie in ihre Ziele aufzul&ouml;sen. Zudem verhindert diese Option, dass eine Ordner-Verkn&uuml;pfung ge&ouml;ffnet werden kann.</p>
            <p>Verwendest du  Option 16 ohne Option 8, enth&auml;lt das Dialogfenster die Schaltfl&auml;che "Speichern", anstatt "&Ouml;ffnen". Dieses Verhalten ist eine Eigenart von Windows.</p></td>
        </tr>
        <tr>
          <td>Wurzelverzeichnis\Dateiname</td>
          <td><p>Falls vorhanden, enth&auml;lt dieser Parameter eine oder beide der folgenden Angaben:</p>
            <p><strong>Wurzelverzeichnis</strong>: Das Hauptverzeichnis (Start-), das sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis befindet, solange kein absoluter Pfad angegeben ist. Ist dieser Parameter leer oder nicht vorhanden, gilt standardm&auml;&szlig;ig das Startverzeichnis, welches vom Betriebssystem vorgegeben ist (in Windows NT/2k/XP oder h&ouml;her ist es wahrscheinlich das Verzeichnis, das der Benutzer zuletzt per FileSelectFile ausgew&auml;hlt hatte). Seit v1.0.43.10 kann auch ein <a href="../misc/CLSID-List.htm">CLSID</a>-Wert wie <em>::{20d04fe0-3aea-1069-a2d8-08002b30309d}</em> (d. h. Arbeitsplatz/Computer) angegeben werden. In diesem Fall sollte jedes Unterverzeichnis nach dem CLSID-Wert mit einem Backslash enden (ansonsten wird der Text nach dem letzten Backslash als Dateiname interpretiert).</p>
            <p><strong>Dateiname</strong>: Ein Dateiname, der standardm&auml;&szlig;ig im Eingabefeld des Dialogfensters angezeigt werden soll. Es wird nur der Dateiname angezeigt (ohne Pfad). F&uuml;r die korrekte Darstellung des Dialogfensters muss sichergestellt werden, dass keine illegalen Zeichen vorhanden sind (wie /&lt;|:").</p>
            <p>Beispiele:</p>
            <pre>
<em>; Sowohl <i>Wurzelverzeichnis</i> als auch <i>Dateiname</i> vorhanden:</em>
C:\Eigene Bilder\Standard-Bildname.gif

<em>; Nur <i>Wurzelverzeichnis</i> vorhanden:</em>
C:\Eigene Bilder

<em>; Nur <i>Wurzelverzeichnis</i> vorhanden, und bezieht sich auf das aktuelle Arbeitsverzeichnis:</em>
Eigene Bilder

<em>; Nur <i>Dateiname</i> vorhanden (aber wenn "Eigene Datei" als Ordner existiert,
; wird es als <i>Wurzelverzeichnis</i> behandelt):</em>
Eigene Datei  </pre></td>
        </tr>
        <tr>
          <td>Anzeigetext</td>
          <td>Text, der im Fenster angezeigt werden soll, um den Benutzer Instruktionen zu erteilen, was zutun ist. Ist dieser Parameter leer oder nicht vorhanden, gilt standardm&auml;&szlig;ig "Select File - %A_SCRIPTNAME%" (der Name des aktuellen Scripts).</td>
        </tr>
        <tr>
          <td>Filter</td>
          <td><p>Kennzeichnet, welche Dateitypen im Dialogfenster angezeigt werden sollen.</p>
            <p>Beispiel: Dokumente (*.txt)<br>
              Beispiel: Audio (*.wav; *.mp2; *.mp3)</p>
            <p>Ist dieser Parameter nicht vorhanden, verwendet der Filter standardm&auml;&szlig;ig "Alle Dateien (*.*)". Zus&auml;tzlich kann im Men&uuml; "Dateitypen" die Option "Text-Dokumente (*.txt)" ausgew&auml;hlt werden.</p>
            <p>Der Filter verwendet ansonsten den angegebenen String und erm&ouml;glicht au&szlig;erdem die Auswahl der Option "Alle Dateien (*.*)" in der Dateitypen-Liste. M&ouml;chtest du mehr als eine Dateierweiterung in den Filter einf&uuml;gen, muss du diese mit Semikolons trennen, wie es im unteren Beispiel gezeigt wird.</p></td>
        </tr>
      </table>
      <h3>ErrorLevel</h3>
      <p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
      <p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 1 gesetzt, wenn der Benutzer das Dialogfenster geschlossen hat, ohne eine Datei ausgew&auml;hlt zu haben (z. B. durch Dr&uuml;cken der Schaltfl&auml;che "Abbrechen"), oder wenn das Betriebssystem sich weigert, das Dialogfenster anzuzeigen (selten). Ansonsten wird es auf 0 gesetzt.</p>
      <h3>Bemerkungen</h3>
      <p>Hat der Benutzer nichts ausgew&auml;hlt (weil er Schaltfl&auml;che "Abbrechen" gedr&uuml;ckt hat), wird <em>Ausgabevariable</em> leer gemacht.</p>
      <p>Ist die Mehrfachauswahl nicht aktiv, wird <em>Ausgabevariable</em> den vollst&auml;ndigen Pfad und Namen einer einzelnen Datei enthalten, die vom Benutzer ausgew&auml;hlt wurden ist.</p>
      <p>Falls die M-Option (Mehrfachauswahl) aktiv ist, wird <em>Ausgabevariable</em> eine Liste enthalten, bei der jeder Eintrag, au&szlig;er dem letzten, mit einem Zeilenumbruchszeichen (`n) endet. Der erste Eintrag in der Liste ist der Pfad, der von allen ausgew&auml;hlten Dateien verwendet wird (dieser Pfad endet nur mit einem Backslash, wenn es ein Hauptverzeichnis wie C:\ ist). Die anderen Eintr&auml;ge sind die ausgew&auml;hlten Dateien (ohne Pfad). Zum Beispiel:
      <pre>C:\Eigene Dokumente\Neuer Ordner [dieser Pfad gilt f&uuml;r alle folgenden Dateien]
test1.txt [das sind nur die Dateinamen: keine Pfadangabe]
test2.txt
... etc.</pre>
        Das untere Beispiel zeigt, wie diese Dateien einzeln extrahiert werden k&ouml;nnen.
        <p>Bei aktiver Mehrfachauswahl ist die Gesamtl&auml;nge aller ausgew&auml;hlten Dateinamen auf 64 KB begrenzt. Das sollte ausreichen, um mehrere tausend Dateien speichern zu k&ouml;nnen. Bei &Uuml;berschreitung des Maximalwertes wird <em>Ausgabevariable</em> leer gemacht.</p>
      <p>Ein GUI-Fenster kann per  <code>Gui, <a href="Gui.htm#OwnDialogs">+OwnDialogs</a></code>  ein modales Dateiauswahlfenster anzeigen. Ein modales Dialogfenster bewirkt, dass der Benutzer erst wieder mit dem GUI-Fenster interagieren kann, wenn das Dialogfenster geschlossen wird.</p>
      <p>Bekannte Einschr&auml;nkung: Ein <a href="SetTimer.htm">Timer</a>, der gestartet wird, w&auml;hrend ein Dateiauswahlfenster angezeigt wird, z&ouml;gert das Klicken des Benutzers im Fenster solange hinaus, bis dieser beendet wird. M&ouml;chtest du dieses Problem umgehen, solltest du Timer vermeiden, deren Subroutinen eine lange Zeit zum Beenden brauchen, oder alle Timer anhalten, w&auml;hrend das Dialogfenster angezeigt wird:</p>
      <pre><a href="Thread.htm">Thread</a>, NoTimers
FileSelectFile, Ausgabevariable
Thread, NoTimers, false</pre>
      <p>Veraltete Option: Seit v1.0.25.06 ist die Mehrfachauswahl-Option "4" veraltet. Allerdings funktioniert diese Option aus Kompatibilit&auml;tsgr&uuml;nden mit &auml;lteren Scripts weiterhin wie vorgesehen. Das hei&szlig;t: W&auml;hlt der Benutzer nur eine Datei aus, wird <em>Ausgabevariable</em> deren kompletten Pfad und Namen enthalten, gefolgt von einem Zeilenumbruch (`n). W&auml;hlt der Benutzer mehr als eine Datei aus, gilt das Format von der oben genannten M-Option, au&szlig;er dass der letzte Eintrag auch mit einem Zeilenumbruchszeichen (`n) endet.</p>
      <h3>Verwandte Befehle</h3>
      <p><a href="FileSelectFolder.htm">FileSelectFolder</a>, <a href="MsgBox.htm">MsgBox</a>, <a href="InputBox.htm">InputBox</a>, <a href="ToolTip.htm">ToolTip</a>, <a href="Gui.htm">GUI</a>, <a href="../misc/CLSID-List.htm">CLSID-Liste</a>, <a href="LoopParse.htm">Parsing-Schleife</a>, <a href="SplitPath.htm">SplitPath</a></p>
      <p>Das Betriebssystem bietet zudem Standard-Dialogfenster, die den Benutzer auffordern k&ouml;nnen, eine Farbe, eine Schriftart oder ein Icon auszuw&auml;hlen. Diese Dialogfenster k&ouml;nnen per <a href="DllCall.htm">DllCall()</a> angezeigt werden, siehe dazu <a href="http://www.autohotkey.com/forum/topic17230.html">www.autohotkey.com/forum/topic17230.html</a>.</p>
      <h3>Beispiele</h3>
      <pre class="NoIndent">FileSelectFile, Ausgew&auml;hlteDatei, 3, , Datei &ouml;ffnen, Text-Dokumente (*.txt; *.doc)
If Ausgew&auml;hlteDatei =
    MsgBox, Der Benutzer hat nichts ausgew&auml;hlt.
Else
    MsgBox, Der Benutzer hat folgendes ausgew&auml;hlt:`n%Ausgew&auml;hlteDatei%


<a href="../misc/CLSID-List.htm">CLSID</a>-Beispiel:
FileSelectFile, Ausgabevariable,, ::{645ff040-5081-101b-9f08-00aa002f954e}  <em>; Papierkorb.</em>

<em>; Mehrfachauswahl-Beispiel:</em>
FileSelectFile, Dateien, M3  <em>; M3 = Mehrfachauswahl vorhandener Dateien.</em>
If Dateien =
{
    MsgBox, Der Benutzer hat die Schaltfl&auml;che "Abbrechen" bet&auml;tigt.
    Return
}
Loop, parse, Dateien, `n
{
    If a_index = 1
        MsgBox, Die ausgew&auml;hlten Dateien befinden sich alle in %A_LoopField%.
    Else
    {
        MsgBox, 4, , Die n&auml;chste Datei ist %A_LoopField%. Weiter?
        IfMsgBox, No, break
    }
}
Return</pre>
    </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>