<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>FileCreateShortcut</title>
<meta name="keywords" content="Befehl, Datei">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>FileCreateShortcut</h1>

<p>Erstellt eine Verkn&uuml;pfung (.lnk).</p>

<pre class="Syntax">FileCreateShortcut, Ziel, Verkn&uuml;pfung [, Arbeitsverzeichnis, Parameter, Beschreibung, Icondatei, Tastenk&uuml;rzel, Iconnummer, Ausf&uuml;hrungsstatus]</pre>
<h3>Parameter</h3>
<table class="info">
  <tbody>
<tr>
    <td width="15%"> Ziel </td>
    <td width="85%">Name der zu verkn&uuml;pfenden Datei, die nur einen absoluten Pfad beinhalten sollte, wenn sie im System integriert ist (z. B. Notepad.exe). Die Datei muss nicht beim Erstellen der Verkn&uuml;pfung vorhanden sein. Das hei&szlig;t, dass Verkn&uuml;pfungen mit ung&uuml;ltigem Ziel erstellt werden k&ouml;nnen.</td>
  </tr>
  <tr>
    <td>Verkn&uuml;pfung</td>
    <td>Name der Verkn&uuml;pfung, die sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis befindet, solange kein absoluter Pfad angegeben ist. Die Erweiterung <strong>.lnk</strong> muss mit angegeben werden. Falls die Datei bereits vorhanden ist, wird sie &uuml;berschrieben.</td>
  </tr>
  <tr>
    <td>Arbeitsverzeichnis</td>
    <td>Verzeichnis, dass das Arbeitsverzeichnis von <em>Ziel</em> beim Ausf&uuml;hren der Verkn&uuml;pfung sein wird. Ist dieser Parameter leer oder nicht vorhanden, wird die Verkn&uuml;pfung ein leeres "Ausf&uuml;hren in"-Feld haben und der Verkn&uuml;pfung ein Standard-Arbeitsverzeichnis vom System bereitgestellt, sobald sie ausgef&uuml;hrt wird.</td>
  </tr>
  <tr>
    <td>Parameter</td>
    <td>Parameter, die beim Ausf&uuml;hren der Verkn&uuml;pfung ans <em>Ziel</em> &uuml;bergeben werden. Parameter werden mit Leerzeichen getrennt. Wenn ein Parameter Leerzeichen enth&auml;lt, umschlie&szlig;t diesen mit Anf&uuml;hrungszeichen.</td>
  </tr>
  <tr>
    <td>Beschreibung</td>
    <td>Kommentare, die die Verkn&uuml;pfung beschreiben (wird beispielsweise zum Anzeigen des ToolTips verwendet).</td>
  </tr>
  <tr>
    <td>Icondatei</td>
    <td>Der vollst&auml;ndige Pfad und Name des Icons, das f&uuml;r die <em>Verkn&uuml;pfung</em> angezeigt wird. Entweder eine ICO-Datei oder das erste Icon einer EXE- oder DLL-Datei.</td>
  </tr>
  <tr>
    <td>Tastenk&uuml;rzel</td>
    <td>
<p>Buchstabe, Zahl oder Name einer einzelnen Taste aus der <a href="../KeyList.htm">Tastenliste</a> (Maustasten und andere untypische Tasten werden m&ouml;glicherweise nicht unterst&uuml;tzt). Modifikatorzeichen k&ouml;nnen <strong>nicht</strong> verwendet werden. Zurzeit werden alle Tastenk&uuml;rzel mit <kbd>Strg</kbd>+<kbd>Alt</kbd> kombiniert. Wenn zum Beispiel der Buchstabe B f&uuml;r diesen Parameter verwendet wird, gilt die Tastenkombination <kbd>Strg</kbd>+<kbd>Alt</kbd>+<kbd>B</kbd>.</p>
    <p>F&uuml;r Windows 9x: M&ouml;glicherweise ist ein Neustart notwendig, um solche Tastenkombinationen wirksam zu machen. Alternativ kann das Eigenschaftsfenster der Verkn&uuml;pfung ge&ouml;ffnet und das Tastenk&uuml;rzel neu erstellt werden, um es sofort wirksam zu machen.</p></td>
  </tr>
  <tr>
    <td>Iconnummer</td>
    <td>Um anstelle des ersten Icons ein beliebiges Icon in <em>Icondatei</em> zu verwenden, kann hier die Nummer angegeben werden (kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein). Zum Beispiel ist 2 das zweite Icon.</td>
  </tr>
  <tr>
    <td>Ausf&uuml;hrungsstatus</td>
    <td>
<p>Damit das <em>Ziel</em> minimiert oder maximiert ausgef&uuml;hrt wird, kann eine der folgenden Zahlen verwendet werden:</p>
      <p>1 - Normal (Standard)<br> 3 - Maximiert<br> 7 - Minimiert</p>    </td>
  </tr>
</tbody></table>
<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird bei Misserfolg auf 1 und bei Erfolg auf 0 gesetzt.</p>
<h3>Bemerkungen</h3>
<p>Das <em>Ziel</em> muss nicht unbedingt ein Pfad beinhalten, wenn sich die Zieldatei in einem Ordner aus der PATH-Umgebungsvariable befindet.</p>
<p>Das <em>Tastenk&uuml;rzel</em> einer neu erstellten Verkn&uuml;pfung ist nur wirksam, wenn die Verkn&uuml;pfung auf dem Desktop oder irgendwo im Startmen&uuml; vorhanden ist. Falls das ausgew&auml;hlte <em>Tastenk&uuml;rzel</em> bereits verwendet wird, hat die Verkn&uuml;pfung des Benutzers Vorrang.</p>
<p>Eine URL-Verkn&uuml;pfung kann auch wie folgt erstellt werden. Passt die ersten beiden Parameter je nach Bedarf an:</p>
  <pre><a href="IniWrite.htm">IniWrite</a>, http://www.google.com, C:\Eigene Verkn&uuml;pfung.url, InternetShortcut, URL</pre>
  <p>Mit dem folgenden Beispiel kann noch ein Icon zugewiesen werden:</p>
  <pre><a href="IniWrite.htm">IniWrite</a>, &lt;Icondatei&gt;, C:\Eigene Verkn&uuml;pfung.url, InternetShortcut, IconFile
<a href="IniWrite.htm">IniWrite</a>, 0, C:\Eigene Verkn&uuml;pfung.url, InternetShortcut, IconIndex</pre>
<p>Ersetzt die 0 mit dem Index des gew&uuml;nschten Icons (0 ist das erste Icon) und ersetzt &lt;Icondatei&gt; mit einer URL-, EXE-, DLL- oder ICO-Datei. Beispiele: C:\Icons.dll, C:\App.exe, http://www.somedomain.com/ShortcutIcon.ico</p>
<p>Das Betriebssystem behandelt eine auf diese Weise erstellte URL-Datei wie eine richtige Verkn&uuml;pfung, selbst wenn es eine Klartextdatei anstelle einer .LNK-Datei ist.</p>
<h3>Verwandte Befehle</h3>
<p><a href="FileGetShortcut.htm">FileGetShortcut</a>, <a href="FileAppend.htm">FileAppend</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent"><em>; Der Buchstabe "i" im letzten Parameter erm&ouml;glicht die Tastenkombination Strg+Alt+I:</em>
FileCreateShortcut, Notepad.exe, %A_Desktop%\Eigene Verkn&uuml;pfung.lnk, C:\, "%A_ScriptFullPath%", Eigene Beschreibung, C:\Eigenes Icon.ico, i</pre></div>
</body></html>