<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>FileSelectFile</title>
<meta http-equiv="X-UA-Compatible" content="IE=EmulateIE7"  />
<meta name="keywords" content="Befehl, Datei, Dialogfenster, Grafische Benutzeroberfl&auml;che">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../../NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(2);</script>


<h1>FileSelectFile</h1>

<p>Zeigt ein Standard-Dialogfenster an, das dem Benutzer erm&ouml;glicht, eine oder mehrere Dateien zu &ouml;ffnen oder zu speichern.</p>

<pre class="Syntax">FileSelectFile, Ausgabevariable [, Optionen, Wurzelverzeichnis\Dateiname, Anzeigetext, Filter]</pre>
<h3>Parameter</h3>
<table class="info">
  <tbody>
<tr>
    <td width="15%">Ausgabevariable</td>
    <td width="85%">Der Name der Variable, in der ein oder mehrere ausgew&auml;hlte Dateinamen gespeichert werden. Sie wird leer gemacht, sobald der Benutzer das Dialogfenster schlie&szlig;t (z. B. nicht m&ouml;chte, eine Datei auszuw&auml;hlen). </td>
  </tr>
  <tr>
    <td>Optionen</td>
    <td>
<p>Falls weggelassen, wird standardm&auml;&szlig;ig eine 0 verwendet. Das hei&szlig;t, ohne die unten genannten Optionen.</p>
      <p><strong>M</strong>: Mehrfachauswahl. Erlaubt dem Benutzer, mehrere Dateien mittels <kbd>Umschalt</kbd>+Linksklick, <kbd>Strg</kbd>+Linksklick oder andersweitig auszuw&auml;hlen. Nach <strong>M</strong> kann optional eine der unten genannten Nummern angegeben werden (zum Beispiel ist sowohl M als auch M1 g&uuml;ltig). Um einzelne Dateien zu extrahieren, siehe Beispiel unten.</p>
      <p><strong>S</strong>: Speichern. Bewirkt, dass anstelle von &Ouml;ffnen die Schaltfl&auml;che Speichern im Dialogfenster angezeigt wird. Nach <strong>S</strong> kann optional eine der unten genannten Nummern (oder eine Summe von mehreren) angegeben werden (zum Beispiel ist sowohl S als auch S24 g&uuml;ltig).</p>
      <p>Selbst wenn <strong>M</strong> und <strong>S</strong> nicht vorhanden sind, k&ouml;nnen folgende Nummern dennoch verwendet werden. Um mehrere von denen wirksam zu machen, addiert diese. Falls zum Beispiel 8 und 16 ben&ouml;tigt wird, muss 24 angegeben werden.</p>      

      <p><strong>1</strong>: Datei muss vorhanden sein <br> <strong>2:</strong> Pfad muss vorhanden sein <br> <strong>8:</strong> Nachfragen, ob eine neue Datei erstellt werden soll <br> <strong>16:</strong> Nachfragen, ob die Datei &uuml;berschrieben werden soll <br> <strong>32</strong> <span class="ver">[v1.0.43.09+]:</span> Verkn&uuml;pfungen (.lnk) werden wie sie sind ausgew&auml;hlt, anstatt sie in ihre Ziele aufzul&ouml;sen. Zudem verhindert diese Option, dass eine Ordner-Verkn&uuml;pfung ge&ouml;ffnet werden kann.</p>
<p>Wenn Option 16 ohne Option 8 vorhanden ist, wird das Dialogfenster die Schaltfl&auml;che "Speichern" enthalten, anstatt "&Ouml;ffnen". Dieses Verhalten ist eine Eigenart von Windows.</p></td>
  </tr>
  <tr>
    <td>Wurzelverzeichnis\Dateiname</td>
    <td>
<p>Falls vorhanden, enth&auml;lt dieser Parameter eine oder beide der folgenden Angaben:</p>
      <p><strong>Wurzelverzeichnis</strong>: Das Hauptverzeichnis (Start-), das sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis befindet, solange kein absoluter Pfad angegeben ist. Ist dieser Parameter leer oder nicht vorhanden, wird das Standardverzeichnis verwendet, welches abh&auml;ngig vom Betriebssystem ist (in Windows NT/2k/XP oder h&ouml;her wahrscheinlich das aktuelle Verzeichnis, das mit FileSelectFile ausgew&auml;hlt wurde). Seit v1.0.43.10 kann auch ein <a href="../misc/CLSID-List.htm">CLSID</a>-Wert wie <em>::{20d04fe0-3aea-1069-a2d8-08002b30309d}</em> (d. h. Arbeitsplatz/Computer) angegeben werden. In diesem Fall sollte jedes Unterverzeichnis nach dem CLSID-Wert mit einem Backslash enden (ansonsten wird der Text nach dem letzten Backslash als Dateiname interpretiert).</p>
      <p><strong>Dateiname</strong>: Ein Dateiname, der standardm&auml;&szlig;ig im Eingabefeld des Dialogfensters angezeigt wird. Es wird nur der Dateiname angezeigt (ohne Pfad). F&uuml;r die korrekte Darstellung des Dialogfensters muss sichergestellt werden, dass keine illegalen Zeichen vorhanden sind (wie /&lt;|:").</p>
      <p>Beispiele:</p>
      <pre>C:\Eigene Bilder\Standard-Bildname.gif  <em>; Sowohl <i>Wurzelverzeichnis</i> als auch <i>Dateiname</i> vorhanden.</em>
C:\Eigene Bilder  <em>; Nur das <i>Wurzelverzeichnis</i> vorhanden.</em>
Eigene Bilder  <em>; Nur das <i>Wurzelverzeichnis</i> vorhanden, und bezieht sich auf das aktuelle Arbeitsverzeichnis.</em>
Eigene Datei  <em>; Nur der <i>Dateiname</i> vorhanden (aber wenn "Eigene Datei" als Ordner existiert, wird es als <i>Wurzelverzeichnis</i> behandelt).</em></pre></td>
  </tr>
  <tr>
    <td>Anzeigetext</td>
    <td>Im Fenster angezeigter Text, um den Benutzer eine Instruktion zu &uuml;bermitteln. Ist dieser Parameter leer oder nicht vorhanden, wird standardm&auml;&szlig;ig "Select File - %A_SCRIPTNAME%" (der Name des aktuellen Scripts) verwendet.</td>
  </tr>
  <tr>
    <td>Filter</td>
    <td>
<p>Bestimmt, welche Dateitypen im Dialogfenster angezeigt werden.</p>
      <p>Beispiel: Dokumente (*.txt)<br> Beispiel: Audio (*.wav; *.mp2; *.mp3)</p>
      <p>Falls weggelassen, verwendet der Filter standardm&auml;&szlig;ig "Alle Dateien (*.*)". Au&szlig;erdem kann im Men&uuml; "Dateitypen" die Option "Text-Dokumente (*.txt)" ausgew&auml;hlt werden.</p>
    <p>Ansonsten verwendet der Filter den angegebenen String und erm&ouml;glicht dem Benutzer, "Alle Dateien (*.*)" in der Dateitypen-Liste auszuw&auml;hlen. Um mehrere Dateierweiterungen einzuf&uuml;gen, trennt diese mit Semikolons, wie im unteren Beispiel dargestellt.</p>    </td>
  </tr>
</tbody></table>

<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 1 gesetzt, wenn der Benutzer das Dialogfenster geschlossen hat, ohne eine Datei ausgew&auml;hlt zu haben (wenn z. B. die Schaltfl&auml;che "Abbrechen" gedr&uuml;ckt wurde), oder wenn das Dialogfenster vom Betriebssystem verweigert wird (selten). Ansonsten auf 0.</p>
<h3>Bemerkungen</h3>
<p>Wenn der Benutzer nichts ausgew&auml;hlt hat (z. B. die Schaltfl&auml;che "Abbrechen" gedr&uuml;ckt hat), wird die <em>Ausgabevariable</em> leer gemacht.</p>
<p>Falls die Mehrfachauswahl nicht aktiv ist, enth&auml;lt die <em>Ausgabevariable</em> den vollst&auml;ndigen Pfad und Namen der ausgew&auml;hlten Datei.</p>
<p>Wenn die M-Option (Mehrfachauswahl) aktiv ist, enth&auml;lt die <em>Ausgabevariable</em> eine Liste von Eintr&auml;gen, die jeweils mit einem Zeilenumbruch (`n) enden (mit Ausnahme des letzten Eintrags). Der erste Eintrag ist der Pfad, der von allen ausgew&auml;hlten Dateien verwendet wird (dieser Pfad endet nur mit einem Backslash, wenn es ein Hauptverzeichnis wie C:\ ist). Die anderen Eintr&auml;ge sind die ausgew&auml;hlten Dateien (ohne Pfad). Zum Beispiel: <br> C:\Eigene Dokumente\Neuer Ordner [das ist der Pfad f&uuml;r alle folgenden Dateien]<br> test1.txt [das sind nur die Dateinamen: keine Pfadangabe]<br> test2.txt<br> ... etc.<br> (Das untere Beispiel zeigt, wie diese Dateien einzeln extrahiert werden k&ouml;nnen)</p>
<p>Bei aktiver Mehrfachauswahl ist die Gesamtl&auml;nge aller ausgew&auml;hlten Dateinamen auf 64 KB begrenzt. Obwohl das eigentlich f&uuml;r mehrere tausend Dateien reicht, wird die <em>Ausgabevariable</em> leer gemacht, sobald das Limit &uuml;berschritten ist.</p>
<p>Ein GUI-Fenster ist in der Lage, ein modales Dateiauswahlfenster mittels <code>Gui, <a href="Gui.htm#OwnDialogs">+OwnDialogs</a></code> anzuzeigen. Ein modales Dialogfenster bewirkt, dass der Benutzer erst wieder mit dem GUI-Fenster interagieren kann, wenn das Dialogfenster geschlossen wird.</p>
<p>Bekannte Einschr&auml;nkung: Ein <a href="SetTimer.htm">Timer</a>, der beim Anzeigen eines Dateiauswahlfensters gestartet wird, z&ouml;gert das Klicken des Benutzers im Fenster solange hinaus, bis der Timer endet. Als &Uuml;bergangsl&ouml;sung sollten Timer vermieden werden, deren Subroutinen eine lange Zeit zum Beenden brauchen, oder deaktiviert alle Timer, w&auml;hrend das Dialogfenster angezeigt wird:</p>
<pre><a href="Thread.htm">Thread</a>, NoTimers
FileSelectFile, Ausgabevariable
Thread, NoTimers, false</pre>
<p>Veraltete Option: Seit v1.0.25.06 ist die Option "4" f&uuml;r die Mehrfachauswahl veraltet. Allerdings ist diese Option aus Kompatibilit&auml;tsgr&uuml;nden mit &auml;lteren Scripts weiterhin vorhanden. Wenn der Benutzer nur eine Datei ausw&auml;hlt, wird die <em>Ausgabevariable</em> deren kompletten Pfad und Namen enthalten, gefolgt von einem Zeilenumbruch (`n). Sobald der Benutzer mehrere Dateien ausw&auml;hlt, gilt das gleiche Format von der oben genannten M-Option, au&szlig;er dass der letzte Eintrag auch mit einem Zeilenumbruch (`n) endet.</p>
<h3>Verwandte Befehle</h3>
<p><a href="FileSelectFolder.htm">FileSelectFolder</a>, <a href="MsgBox.htm">MsgBox</a>, <a href="InputBox.htm">InputBox</a>, <a href="ToolTip.htm">ToolTip</a>, <a href="Gui.htm">GUI</a>, <a href="../misc/CLSID-List.htm">CLSID-Liste</a>, <a href="LoopParse.htm">Parsing-Schleife</a>, <a href="SplitPath.htm">SplitPath</a></p>
<p>Das Betriebssystem bietet zudem Standard-Dialogfenster, die dem Benutzer erm&ouml;glichen, eine Farbe, eine Schriftart oder ein Icon auszuw&auml;hlen. Diese Dialogfenster k&ouml;nnen mit <a href="DllCall.htm">DllCall()</a> angezeigt werden, siehe dazu <a href="http://www.autohotkey.com/forum/topic17230.html">www.autohotkey.com/forum/topic17230.html</a>.</p>
<h3>Beispiele</h3>
<pre class="NoIndent">FileSelectFile, Ausgew&auml;hlteDatei, 3, , Datei &ouml;ffnen, Text-Dokumente (*.txt; *.doc)
If Ausgew&auml;hlteDatei =
    MsgBox, Der Benutzer hat nichts ausgew&auml;hlt.
Else
    MsgBox, Der Benutzer hat Folgendes ausgew&auml;hlt:`n%Ausgew&auml;hlteDatei%


<a href="../misc/CLSID-List.htm">CLSID</a>-Beispiel:
FileSelectFile, Ausgabevariable,, ::{645ff040-5081-101b-9f08-00aa002f954e}  <em>; Papierkorb.</em>

<em>; Mehrfachauswahl-Beispiel:</em>
FileSelectFile, Dateien, M3  <em>; M3 = Mehrfachauswahl vorhandener Dateien.</em>
If Dateien =
{
    MsgBox, Der Benutzer hat die Schaltfl&auml;che "Abbrechen" bet&auml;tigt.
    Return
}
Loop, parse, Dateien, `n
{
    If a_index = 1
        MsgBox, Die ausgew&auml;hlten Dateien befinden sich alle in %A_LoopField%.
    Else
    {
        MsgBox, 4, , Die n&auml;chste Datei ist %A_LoopField%.  Weiter?
        IfMsgBox, No, break
    }
}
Return</pre>
</body></html>