<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>FileSelectFolder</title>
<meta name="keywords" content="Befehl, Ordner, Dialogfenster, Grafische Benutzeroberfl&auml;che">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>FileSelectFolder</h1>

<p>Zeigt ein Standard-Dialogfenster an, das dem Benutzer erm&ouml;glicht, einen Ordner auszuw&auml;hlen.</p>

<pre class="Syntax">FileSelectFolder, Ausgabevariable [, Startordner, Optionen, Anzeigetext]</pre>
<h3>Parameter</h3>
<table class="info">
  <tbody>
<tr>
    <td width="15%">Ausgabevariable</td>
    <td width="85%">
<p>Der Name der Variable, in der der ausgew&auml;hlte Ordner gespeichert wird. Sie wird leer gemacht, sobald der Benutzer das Dialogfenster schlie&szlig;t (z. B. nicht m&ouml;chte, eine Datei auszuw&auml;hlen). Wenn der Benutzer ein Hauptverzeichnis ausw&auml;hlt (wie C:\), endet die <i>Ausgabevariable</i> mit einem Backslash. Ist das unerw&uuml;nscht, entfernt es wie folgt:</p>
      <pre>FileSelectFolder, Ordner
Ordner := RegExReplace(Ordner, "\\$")  <em>; Entfernt das Backslash am Ende, falls vorhanden.</em></pre></td>
  </tr>
  <tr>
    <td>Startordner</td>
    <td>
<p>Ist dieser Parameter leer oder nicht vorhanden, beginnt die Startauswahl im Ordner "Eigene Dateien" des Benutzers (oder vielleicht auch im Arbeitsplatz/Computer). Ein <a href="../misc/CLSID-List.htm">CLSID-Ordner</a> wie <em>::{20d04fe0-3aea-1069-a2d8-08002b30309d}</em> (Arbeitsplatz/Computer) kann angegeben werden, um die Navigation bei einem bestimmten Ordner zu beginnen.</p>
      <p>Ansonsten wird in diesem Parameter h&auml;ufig ein Sternchen verwendet, unmittelbar gefolgt vom absoluten Pfad des Laufwerks oder Ordners, das anf&auml;nglich ausgew&auml;hlt sein soll. Zum Beispiel w&uuml;rde mit <em>*C:\ </em>die Navigation beim C-Laufwerk beginnen. Ebenso w&uuml;rde mit <em>*C:\Eigener Ordner</em> anf&auml;nglich dieser bestimmte Ordner ausgew&auml;hlt.</p>
      <p>Das Sternchen bewirkt, dass der Benutzer berechtigt ist, vom Startordner bis zum Hauptverzeichnis zu navigieren. Ohne Sternchen darf der Benutzer nur einen Ordner innerhalb des <em>Startordners</em> (oder den <em>Startordner</em> selbst) ausw&auml;hlen. Der Vorteil davon ist, dass der Verzeichnisbaum vom <em>Startordner</em> anf&auml;nglich aufgeklappt ist, daher muss der Benutzer nicht erst auf das Pluszeichen klicken.</p>
      <p>Wenn das Sternchen vorhanden ist, kann die Aufw&auml;rtsnavigation wahlweise auf einen Ordner (au&szlig;er Desktop) beschr&auml;nkt werden. Dazu muss vor dem Sternchen der absolute Pfad des h&ouml;chsten Ordners mit genau einem nachfolgenden Leer- oder Tabulatorzeichen angegeben werden. Im folgenden Beispiel kann der Benutzer nicht auf die dar&uuml;ber liegende Ebene von C:\Eigener Ordner navigieren (das Startverzeichnis selbst ist aber C:\Eigener Ordner\Projekte):<br> <em>C:\Eigener Ordner *C:\Eigener Ordner\Projekte</em></p>
    </td>
  </tr>
  <tr>
    <td>Optionen</td>
    <td>
<p>Eine der folgenden Zahlen:</p>
      <p><strong>0</strong>: Alle unteren Optionen sind deaktiviert (in Windows 2000 wird trotzdem die Schaltfl&auml;che "Neuer Ordner" angezeigt).</p>
      <p><strong>1</strong> (Standard): Es wird eine Schaltfl&auml;che bereitgestellt, die dem Benutzer erm&ouml;glicht, einen neuen Ordner zu erstellen. Allerdings ist diese Schaltfl&auml;che nicht in Windows 95/98/NT vorhanden.</p>
      <p><strong>Addiert 2</strong> mit der oberen Zahl, um ein Eingabefeld bereitzustellen, das dem Benutzer erm&ouml;glicht, den Namen eines Ordners einzugeben. Zum Beispiel wird mit einem Parameterwert von 3 sowohl ein Eingabefeld als auch die Schaltfl&auml;che "Neuer Ordner" bereitgestellt.</p>
      <p><strong><a name="NewDialog"></a>Addiert 4</strong> mit der oberen Zahl, um die BIF_NEWDIALOGSTYLE-Eigenschaft zu entfernen. Die Addition mit 4 stellt sicher, dass FileSelectFolder auch dann richtig funktioniert, wenn es sich in einer Vorinstallationsumgebung wie WinPE oder BartPE befindet. Allerdings wird dadurch verhindert, dass die Schaltfl&auml;che "Neuer Ordner" angezeigt wird, zumindest unter Windows XP. ["4" ben&ouml;tigt v1.0.48+]</p>
      <p>Sobald der Benutzer einen ung&uuml;ltigen Ordnernamen ins Eingabefeld eintr&auml;gt, enth&auml;lt die <i>Ausgabevariable</i> den aktuell ausgew&auml;hlten Ordner vom Navigationsbereich, anstatt die Benutzereingabe, zumindest unter Windows XP.</p>
      <p>Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein.
</p></td>
  </tr>
  <tr>
    <td>Anzeigetext</td>
    <td>Im Fenster angezeigter Text, um den Benutzer eine Instruktion zu &uuml;bermitteln. Ist dieser Parameter leer oder nicht vorhanden, wird standardm&auml;&szlig;ig "Select Folder - %A_SCRIPTNAME%" (Name des aktuellen Scripts) verwendet.</td>
  </tr>
</tbody></table>

<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 1 gesetzt, wenn der Benutzer das Dialogfenster geschlossen hat, ohne einen Ordner ausgew&auml;hlt zu haben (wenn z. B. die Schaltfl&auml;che "Abbrechen" gedr&uuml;ckt wurde), oder wenn das Dialogfenster vom Betriebssystem verweigert wird (selten). Ansonsten auf 0.</p>
<h3>Bemerkungen</h3>
<p>Ein GUI-Fenster ist in der Lage, ein modales Dateiauswahlfenster mittels <code>Gui, <a href="Gui.htm#OwnDialogs">+OwnDialogs</a></code> anzuzeigen. Ein modales Dialogfenster bewirkt, dass der Benutzer erst wieder mit dem GUI-Fenster interagieren kann, wenn das Dialogfenster geschlossen wird.</p>
<p>Bekannte Einschr&auml;nkung: Ein <a href="SetTimer.htm">Timer</a>, der beim Anzeigen eines Ordnerauswahlfensters gestartet wird, z&ouml;gert das Klicken des Benutzers im Fenster solange hinaus, bis der Timer endet. Als &Uuml;bergangsl&ouml;sung sollten Timer vermieden werden, deren Subroutinen eine lange Zeit zum Beenden brauchen, oder deaktiviert alle Timer, w&auml;hrend das Dialogfenster angezeigt wird:</p>
<pre><a href="Thread.htm">Thread</a>, NoTimers
FileSelectFolder, Ausgabevariable,, 3
Thread, NoTimers, false</pre>
<h3>Verwandte Befehle</h3>
<p><a href="FileSelectFile.htm">FileSelectFile</a>, <a href="MsgBox.htm">MsgBox</a>, <a href="InputBox.htm">InputBox</a>, <a href="ToolTip.htm">ToolTip</a>, <a href="Gui.htm">GUI</a>, <a href="../misc/CLSID-List.htm">CLSID-Liste</a>, <a href="FileCopyDir.htm">FileCopyDir</a>, <a href="FileMoveDir.htm">FileMoveDir</a>, <a href="SplitPath.htm">SplitPath</a></p>
<p>Das Betriebssystem bietet zudem Standard-Dialogfenster, die dem Benutzer erm&ouml;glichen, eine Farbe, eine Schriftart oder ein Icon auszuw&auml;hlen. Diese Dialogfenster k&ouml;nnen mit <a href="DllCall.htm">DllCall()</a> angezeigt werden, siehe dazu <a href="http://www.autohotkey.com/forum/topic17230.html">www.autohotkey.com/forum/topic17230.html</a>.</p>
<h3>Beispiel</h3>
<pre class="NoIndent">FileSelectFolder, Ausgabevariable, , 3
If Ausgabevariable =
    MsgBox, Keinen Ordner ausgew&auml;hlt.
Else
    MsgBox, Ordner "%Ausgabevariable%" ausgew&auml;hlt.

<a href="../misc/CLSID-List.htm">CLSID</a>-Beispiel:
FileSelectFolder, Ausgabevariable, ::{20d04fe0-3aea-1069-a2d8-08002b30309d}  <em>; Arbeitsplatz/Computer</em></pre>


</body></html>