<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>FileSelectFile</title>
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../../NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(2);</script>


<h1>FileSelectFile</h1>

<p>Zeigt das Standard-Fenster zum &Ouml;ffnen oder Speichern einer oder mehrere Dateien an.</p>

<pre class="Syntax">FileSelectFile, Ausgabevariable [, Optionen, Wurzelverzeichnis\Dateiname, Anzeigetext, Filter]</pre>
<h3>Parameter</h3>
<table class="info">
  <tbody>
<tr>
    <td width="15%">Ausgabevariable</td>
    <td width="85%">Der Name der Variable, in der beliebig viele vom Benutzer ausgew&auml;hlte Dateinamen gespeichert werden. Die Variable wird leer gemacht, wenn der Benutzer das Dialog-Fenster abbricht (wenn z. B. der Benutzer nicht die Absicht hat, eine Datei auszuw&auml;hlen). </td>
  </tr>
  <tr>
    <td>Optionen</td>
    <td>
<p>Wenn nicht vorhanden, dann standardm&auml;&szlig;ig eine 0, d. h. keine der unten genannten Optionen.</p>
      <p><strong>M</strong>: Mehrfachauswahl. Erlaubt dem Benutzer, mehrere Dateien mittels Umschalt+Linksklick, Steuerung+Linksklick oder andere Tastenkombinationen auszuw&auml;hlen. Nach <strong>M</strong> k&ouml;nnen die unten genannten Nummern folgen (z. B. sind sowohl M als auch M1 g&uuml;ltig). Um bestimmte Dateien zu extrahieren, siehe Beispiel unten.</p>
      <p><strong>S</strong>: Speichern. Das Dialog-Fenster hat eine Schaltfl&auml;che zum Speichern anstelle von &Ouml;ffnen. Nach <strong>S</strong> k&ouml;nnen die unten genannten Nummern bzw. eine Summe von Nummern folgen (z. B. sind sowohl S als auch S24 g&uuml;ltig).</p>
      <p>Selbst wenn <strong>M</strong> und <strong>S</strong> nicht vorhanden sind, k&ouml;nnen die nachfolgenden Nummern weiterhin verwendet werden. F&uuml;r mehrere Optionen gleichzeitig, addiert die Nummern. Bei den Nummern 8 und 16 muss die Nummer 24 angegeben werden.</p>      
<p><strong>1</strong>: Datei muss vorhanden sein <br> <strong>2:</strong> Pfad muss vorhanden sein <br> <strong>8:</strong> Nachfrage beim Erstellen einer neuen Datei <br> <strong>16:</strong> Nachfrage beim &Uuml;berschreiben einer Datei <br> <strong>32</strong> <span class="ver">[v1.0.43.09+]:</span> Verkn&uuml;pfungen (.lnk-Dateien) werden direkt ausgew&auml;hlt, anstatt deren Ziel-Dateien. Diese Option verhindert auch das &Ouml;ffnen einer Ordner-Verkn&uuml;pfung.</p>
      <p>Wenn die &Uuml;berschreiben-Option ohne die Erstellen-Option angegeben ist, dann enth&auml;lt das Dialog-Fenster eine Schaltfl&auml;che zum Speichern, statt zum &Ouml;ffnen. Dieses Verhalten ist eine Eigenart von Windows.</p></td>
  </tr>
  <tr>
    <td>Wurzelverzeichnis\Dateiname</td>
    <td>
<p>Wenn vorhanden, dann enth&auml;lt dieser Parameter eine oder beide der folgenden Optionen:</p>
      <p><strong>Wurzelverzeichnis</strong>: Das Haupt- bzw. Startverzeichnis, das sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis befindet, solange kein absoluter Pfad angegeben ist. Wenn leer oder nicht vorhanden, dann wird das Standardverzeichnis verwendet, welches abh&auml;ngig vom Betriebssystem ist (in Windows NT/2k/XP oder h&ouml;her wahrscheinlich das Verzeichnis, das mit FileSelectFile ausgew&auml;hlt wurde). Seit v1.0.43.10 kann auch ein <a href="../misc/CLSID-List.htm">CLSID</a>-Wert wie <em>::{20d04fe0-3aea-1069-a2d8-08002b30309d}</em> (d. h. Arbeitsplatz/Computer) angegeben werden. In diesem Fall sollte jedes Unterverzeichnis nach dem CLSID-Wert mit einem Backslash enden (ansonsten wird der Text nach dem letzten Backslash als Dateiname interpretiert).</p>
      <p><strong>Dateiname</strong>: Der Standard-Dateiname, der sofort im Edit-Feld des Dialog-Fensters angezeigt wird. Nur reine Dateinamen (ohne Pfad) werden angezeigt. F&uuml;r die korrekte Darstellung des Dialog-Fensters sind illegale Zeichen (z. B. /&lt;|:") nicht erlaubt.</p>
      <p>Beispiele:</p>
      <pre>C:\Eigene Bilder\Standard-Bildname.gif  <em>; Sowohl <i>Wurzelverzeichnis</i> als auch <i>Dateiname</i> vorhanden.</em>
C:\Eigene Bilder  <em>; Nur das <i>Wurzelverzeichnis</i> vorhanden.</em>
Eigene Bilder  <em>; Nur das <i>Wurzelverzeichnis</i> vorhanden, und bezieht sich auf das aktuelle Arbeitsverzeichnis.</em>
Eigene Datei  <em>; Nur der <i>Dateiname</i> vorhanden (aber wenn "Eigene Datei" als Ordner existiert, dann wird es als <i>Wurzelverzeichnis</i> behandelt).</em></pre></td>
  </tr>
  <tr>
    <td>Anzeigetext</td>
    <td>Im Fenster angezeigter Text, um den Benutzer eine Instruktion zu &uuml;bermitteln. Wenn leer oder nicht vorhanden, dann wird standardm&auml;&szlig;ig "Select File - %A_SCRIPTNAME%" (d. h. der Name des aktuellen Scripts) verwendet.</td>
  </tr>
  <tr>
    <td>Filter</td>
    <td>
<p>Legt fest, welche Dateitypen im Dialog-Fenster angezeigt werden sollen.</p>
      <p>Beispiel: Dokumente (*.txt)<br> Beispiel: Audio (*.wav; *.mp2; *.mp3)</p>
      <p>Wenn nicht vorhanden, dann wird standardm&auml;&szlig;ig "Alle Dateien (*.*)" angezeigt. Eine Option zur Auswahl von Text-Dokumente (*.txt) ist auch im Men&uuml; "Dateitypen" des Dialog-Fensters verf&uuml;gbar.</p>
    <p>Andernfalls verwendet der Filter den angegebenen String und bietet die Auswahl "Alle Dateien (*.*)" in der Dateitypen-Liste an. Um mehrere Dateierweiterungen hinzuzuf&uuml;gen, trennt diese mit Semikolons, wie im unteren Beispiel dargestellt.</p>    </td>
  </tr>
</tbody></table>

<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 1 gesetzt, wenn der Benutzer das Dialog-Fenster schlie&szlig;t, ohne eine Datei ausgew&auml;hlt zu haben (wie z. B. bei Bet&auml;tigung der Schaltfl&auml;che "Abbrechen"). ErrorLevel wird auch auf 1 gesetzt, wenn das Betriebssystem das Dialog-Fenster verweigert (selten). Ansonsten auf 0.</p>
<h3>Bemerkungen</h3>
<p>Wenn der Benutzer nichts ausgew&auml;hlt hat (d. h. bei Bet&auml;tigung der Schaltfl&auml;che "Abbrechen"), dann wird die <em>Ausgabevariable</em> leer gemacht.</p>
<p>Wenn Mehrfachauswahl nicht aktiv ist, dann enth&auml;lt die <em>Ausgabevariable</em> den vollst&auml;ndigen Pfad und Namen der ausgew&auml;hlten Datei.</p>
<p>Wenn die M-Option (Mehrfachauswahl) aktiv ist, dann enth&auml;lt die <em>Ausgabevariable</em> eine Liste von Eintr&auml;gen, die mit einem LF-Zeichen (`n) enden (mit Ausnahme des letzten Eintrags). Der erste Eintrag enth&auml;lt den Pfad aller ausgew&auml;hlten Dateien (dieser Pfad endet nur mit einem Backslash, wenn es ein Hauptverzeichnis wie C:\ ist). Die anderen Eintr&auml;ge sind die ausgew&auml;hlten Dateien (ohne Pfad). Zum Beispiel: <br> C:\Eigene Dokumente\Neuer Ordner [der Pfad f&uuml;r alle folgenden Dateien]<br> test1.txt [nur Dateinamen: ohne Pfad]<br> test2.txt<br> ... etc.<br> (Mit dem unten gezeigten Beispiel k&ouml;nnen Dateien einzeln aus dieser Liste extrahiert werden.)</p>
<p>Wenn Mehrfachauswahl aktiv ist, dann ist die Summe von den L&auml;ngen der ausgew&auml;hlten Dateien auf 64 KB begrenzt. Allerdings ist das f&uuml;r gew&ouml;hnlich genug, um mehrere tausende Dateien zu enthalten. Die <em>Ausgabevariable</em> wird leer gemacht, wenn das Limit &uuml;berschritten ist.</p>
<p>Ein GUI-Fenster kann ein modales Dialog-Fenster mittels <a href="Gui.htm#OwnDialogs">Gui, +OwnDialogs</a> anzeigen. Ein modales Dialog-Fenster hindert den Benutzer solange daran, mit dem GUI-Fenster zu interagieren, bis das modale Dialog-Fenster wieder geschlossen wird.</p>
<p>Bekannte Einschr&auml;nkung: Ein <a href="SetTimer.htm">Timer</a>, der w&auml;hrend der Anzeige eines Dateiauswahlfensters gestartet wird, z&ouml;gert das Klicken des Benutzers im Fenster solange hinaus, bis der Timer endet. Um dieses Problem zu umgehen, vermeidet Timer mit Subroutinen, die eine lange Zeit brauchen, beendet zu werden, oder deaktiviert alle Timer, w&auml;hrend das Dialog-Fenster aktiv ist:</p>
<pre><a href="Thread.htm">Thread</a>, NoTimers
FileSelectFile, Ausgabevariable
Thread, NoTimers, false</pre>
<p>Veraltete Option: Seit v1.0.25.06 ist die Option "4" f&uuml;r die Mehrfachauswahl veraltet. Allerdings ist diese Option aus Kompatibilit&auml;tsgr&uuml;nden mit &auml;lteren Scripts weiterhin vorhanden. Wenn der Benutzer nur eine Datei ausw&auml;hlt, dann enth&auml;lt die <em>Ausgabevariable</em> den kompletten Pfad und Namen mit einem LF-Zeichen (`n) am Ende. Wenn der Benutzer mehrere Dateien ausw&auml;hlt, dann wird das gleiche Format der M-Option verwendet, welches oben beschrieben wird, au&szlig;er dass der letzte Eintrag auch mit einem Zeilenvorschub (`n) endet.</p>
<h3>Verwandte Befehle</h3>
<p><a href="FileSelectFolder.htm">FileSelectFolder</a>, <a href="MsgBox.htm">MsgBox</a>, <a href="InputBox.htm">InputBox</a>, <a href="ToolTip.htm">ToolTip</a>, <a href="Gui.htm">GUI</a>, <a href="../misc/CLSID-List.htm">CLSID-Liste</a>, <a href="LoopParse.htm">Parsing-Schleife</a>, <a href="SplitPath.htm">SplitPath</a></p>
<p>Das Betriebssystem besitzt auch Standard-Fensterdialoge zum Ausw&auml;hlen von Farben, Schriftarten oder Icons. Diese Dialog-Fenster k&ouml;nnen mittels <a href="DllCall.htm">DllCall()</a> angezeigt werden, siehe dazu <a href="http://www.autohotkey.com/forum/topic17230.html">www.autohotkey.com/forum/topic17230.html</a>.</p>
<h3>Beispiele</h3>
<pre class="NoIndent">FileSelectFile, Ausgew&auml;hlteDatei, 3, , Datei &ouml;ffnen, Text-Dokumente (*.txt; *.doc)
If Ausgew&auml;hlteDatei =
    MsgBox, Der Benutzer hat nichts ausgew&auml;hlt.
Else
    MsgBox, Der Benutzer hat Folgendes ausgew&auml;hlt:`n%Ausgew&auml;hlteDatei%


<a href="../misc/CLSID-List.htm">CLSID</a>-Beispiel:
FileSelectFile, Ausgabevariable,, ::{645ff040-5081-101b-9f08-00aa002f954e}  <em>; Papierkorb.</em>

<em>; Mehrfachauswahl-Beispiel:</em>
FileSelectFile, Dateien, M3  <em>; M3 = Mehrfachauswahl vorhandener Dateien.</em>
If Dateien =
{
    MsgBox, Der Benutzer hat die Schaltfl&auml;che "Abbrechen" bet&auml;tigt.
    Return
}
Loop, parse, Dateien, `n
{
    If a_index = 1
        MsgBox, Die ausgew&auml;hlten Dateien befinden sich alle in %A_LoopField%.
    Else
    {
        MsgBox, 4, , Die n&auml;chste Datei ist %A_LoopField%.  Weiter?
        IfMsgBox, No, break
    }
}
Return</pre>


</body></html>