<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>GetKeyState</title>
<meta name="keywords" content="Befehl, Tastatur, Maus, Joystick">
<meta name="description" content="Verwendet GetKeyState in dieser freien Scriptsprache, um auf einfache Weise zu &uuml;berpr&uuml;fen, ob eine Taste gedr&uuml;ckt gehalten wird oder nicht.">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
<div id="content">
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>GetKeyState</h1>

<p>&Uuml;berpr&uuml;ft, ob eine Maus-/Joystick- oder Tastaturtaste gehalten wird oder nicht. Ruft auch den Joystickstatus ab.</p>

<pre class="Syntax">GetKeyState, Ausgabevariable, Tastenname [, Modus]
      KeyIsDown := <a href="../Functions.htm#GetKeyState">GetKeyState</a>("Tastenname" [, "Modus"])</pre>
<h3>Parameter</h3>
<table class="info">
  <tbody>
<tr>
    <td width="15%">Ausgabevariable</td>
    <td width="85%">
<p>Der Name der Variable, in der der Status der Taste gespeichert wird. D f&uuml;r Unten (Down) und U f&uuml;r Oben (Up) (aber die Funktion <a href="../Functions.htm#GetKeyState">GetKeyState()</a> &uuml;bergibt Wahr (1) f&uuml;r Down und Falsch (0) f&uuml;r Up). Wenn der Status der Taste nicht ermittelt werden kann, dann wird die Variable leer gemacht.</p>
      <p>Die n&auml;chsten 2 Methoden gelten nur f&uuml;r Joysticks:</p>
    <p>1) Bei einer Joystick-Achse wie JoyX enth&auml;lt die <em>Ausgabevariable</em> eine Flie&szlig;kommazahl zwischen 0 und 100, die Position des Joysticks im Bewegungsbereich der Achse in Prozent. Das Format der Zahl kann mittels <a href="SetFormat.htm">SetFormat</a> ge&auml;ndert werden. Mit dem <a href="../scripts/JoystickTest.htm">Test-Script</a> kann ein Joystick analysiert werden.</p>
    <p>2) Wenn der <em>Tastenname</em> JoyPOV enth&auml;lt, dann liegt der ermittelte Wert zwischen 0 und 35900. Die folgenden POV-Werte werden ungef&auml;hr von den meisten Joysticks verwendet:<br> -1: keinen Winkel erkannt<br> 0: nach vorne gerichtet<br> 9000 (90 Grad): nach rechts gerichtet <br> 27000 (270 Grad): nach links gerichtet<br> 18000 (180 Grad): nach hinten gerichtet</p>    </td>
  </tr>
  <tr>
    <td>Tastenname</td>
    <td>
<p>Ein einzelnes Zeichen der Tastatur oder ein Tastenname aus der <a href="../KeyList.htm">Tastenliste</a>, darunter auch Maus- und Joysticktasten (obwohl Maustasten in Windows 95/98/Me normalerweise nicht erkannt werden). Beispiele: B, 5, LWin, RControl, Alt, Enter, Escape, LButton, MButton, Joy1</p>
      <p>Alternativ kann auch ein eindeutiger virtueller Tastencode wie vkFF angegeben werden. Das ist n&uuml;tzlich, wenn im seltenen Fall die Taste keinen Namen besitzt. Der virtuelle Tastencode kann ermittelt werden, indem die Schritte im unteren Bereich der <a href="../KeyList.htm#SpecialKeys">Tastenliste</a> befolgt werden.</p>
      <p><b>Bekannte Einschr&auml;nkung:</b> Diese Funktion kann nicht zwischen zwei Tasten unterscheiden, die den gleichen virtuellen Tastencode haben, wie z. B. Left und NumpadLeft.</p></td>
  </tr>
  <tr>
    <td>Modus</td>
    <td>
<p>Dieser Parameter wird ignoriert, wenn der Joystick-Status ermittelt wird.</p>
      <p>Wenn nicht vorhanden, dann wird automatisch der logischen Tastenstatus ermittelt. Dieser Status macht dem Betriebssystem und aktivem Fenster glauben, dass die Taste gedr&uuml;ckt wurde, welches aber nicht unbedingt dem physischen Status entspricht.</p>
	  <p>Alternativ kann ein Buchstabe angegeben werden:</p>
      <p><strong>P</strong>: Ermittelt den physischen Status (z. B. wenn der Benutzer eine Taste gedr&uuml;ckt h&auml;lt). In Windows 95/98/Me entspricht der physische Tastenstatus (<em>Modus</em> = P) fast immer dem logischen Status. In Windows NT/2000/XP oder h&ouml;her entspricht der physische Status normalerweise erst dem logischen Status, wenn Tastatur- und/oder Maus-Hooks installiert sind, die dann genau widerspiegeln k&ouml;nnen, ob der Benutzer eine Taste gedr&uuml;ckt h&auml;lt oder nicht (solange sie gedr&uuml;ckt gehalten wurde, w&auml;hrend das Script lief). Mittels dem <a href="KeyHistory.htm">KeyHistory</a>-Befehl oder Men&uuml;punkt kann die Installation eines Hooks festgestellt werden. Die Installation eines Hooks kann mit <a href="_InstallKeybdHook.htm">#InstallKeybdHook</a> und/oder <a href="_InstallMouseHook.htm">#InstallMouseHook</a> erzwungen werden.</p>
      <p><strong>T</strong>: Ermittelt den Umschaltstatus (nur f&uuml;r umschaltbare Tasten wie Feststelltaste, Num, Rollen und Einf g&uuml;ltig). Der ermittelte D-Wert bedeutet "An", w&auml;hrend U "Aus" bedeutet (aber die Funktion <a href="../Functions.htm#GetKeyState">GetKeyState()</a> &uuml;bergibt Wahr (1) f&uuml;r "An" und Falsch (0) f&uuml;r "Aus").</p>
      <p>Der Umschaltstatus von der <em>Einf</em>-Taste kann wahrscheinlich nur in Windows 2000/XP oder h&ouml;her ermittelt werden.</p>
      <p>In Windows 9x ist das Abrufen des Umschaltstatus weniger zuverl&auml;ssig. Nachdem beispielsweise die Taste unmittelbar gedr&uuml;ckt wurde, kann der neue Status erst nach dem Anzeigen eines Script-Fensters wie <a href="MsgBox.htm">MsgBox</a> korrekt ermittelt werden.</p>
    </td>
  </tr>
</tbody></table>

<h3>Bemerkungen</h3>
<p>F&uuml;r das Warten auf einen neuen Tastenstatus ist normalerweise der Befehl <a href="KeyWait.htm">KeyWait</a> besser geeignet, als eine Schleife mit GetKeyState.</p>
<p>Betriebssysteme mit ungew&ouml;hnlichen Tastaturtreibern k&ouml;nnen die Aktualisierung eines Tastenstatus verlangsamen, besonders bei Umschalttasten (z. B. Feststelltaste). Ein Script, das den Status solch einer Taste sofort &uuml;berpr&uuml;ft, sollte mit einem <a href="Sleep.htm">Sleep</a>-Befehl verwenden werden, damit das Betriebssystem genug Zeit hat, den Tastenstatus zu aktualisieren.</p>
<p>Beispiele f&uuml;r die Verwendung mit GetKeyState und einem Joystick, siehe <a href="../misc/RemapJoystick.htm">Joystick-Neubelegung</a> und <a href="../scripts/JoystickMouse.htm">Joystick-To-Mouse</a>.</p>
<h3>Verwandte Befehle</h3>
<p><a href="../Functions.htm#GetKeyState">GetKeyState()</a>, <a href="KeyWait.htm">KeyWait</a>, <a href="../KeyList.htm">Tastenliste</a>, <a href="../misc/RemapJoystick.htm">Joystick-Neubelegung</a>, <a href="KeyHistory.htm">KeyHistory</a>, <a href="_InstallKeybdHook.htm">#InstallKeybdHook</a>, <a href="_InstallMouseHook.htm">#InstallMouseHook</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent"><em>; Einfache Beispiele:</em>
GetKeyState, Status, RButton  <em>; Rechte Maustaste.</em>
GetKeyState, Status, Joy2  <em>; Die zweite Taste des ersten Joysticks.</em>

GetKeyState, Status, Shift
If Status = D
    MsgBox Mindestens eine Umschalttaste wird gedr&uuml;ckt gehalten.
Else
    MsgBox Keine Umschalttaste wird gedr&uuml;ckt gehalten.

GetKeyState, Status, CapsLock, T <em>;  D, wenn Feststelltaste AN ist, ansonsten U f&uuml;r AUS.</em>
Status := GetKeyState("Capslock", "T")  <em>; Wahr, wenn Feststelltaste AN ist, ansonsten Falsch f&uuml;r AUS.</em>

<em>; Neubelegungsbeispiel (dient nur zur Veranschaulichung,
; die interne <a href="../misc/Remap.htm">Neubelegungsfunktion</a> ist leichter zu handhaben):
; Beim folgenden Hotkey wird die Maustaste gedr&uuml;ckt halten, w&auml;hrend NumpadAdd
; gedr&uuml;ckt gehalten wird (NumpadAdd wird zu einer Maustaste). Diese Methode
; kann zur Wiederholung einer Aktion benutzt werden, w&auml;hrend der Benutzer eine Taste gedr&uuml;ckt h&auml;lt:</em>
*NumpadAdd::
MouseClick, left,,, 1, 0, D  <em>; H&auml;lt die linke Maustaste gedr&uuml;ckt.</em>
Loop
{
    Sleep, 10
    GetKeyState, Status, NumpadAdd, P
    If Status = U  <em>; Schleife verlassen, da die Taste losgelassen wurden ist.</em>
        break
    <em>; ... andere m&ouml;gliche Aktionen, die wiederholt werden k&ouml;nnen.</em>
}
MouseClick, left,,, 1, 0, U  <em>; L&auml;sst die Maustaste los.</em>
Return

<em>; Beispiel: Macht eine Joystick-Taste von der Achsenpostion des Joysticks abh&auml;ngig.</em>
joy2::
GetKeyState, joyx, JoyX
If joyx &gt; 75
    MsgBox Aktion #1 (Taste gedr&uuml;ckt, w&auml;hrend Joystick nach rechts bewegt wurde).
Else If joyx &lt; 25
    MsgBox Aktion #2 (Taste gedr&uuml;ckt, w&auml;hrend Joystick nach links bewegt wurde).
Else
    MsgBox Aktion #3 (Taste gedr&uuml;ckt, w&auml;hrend Joystick horizontal zentriert wurde).
Return

<em>; Siehe <a href="../misc/RemapJoystick.htm">Joystick-Neubelegung</a> und <a href="../scripts/JoystickMouse.htm">Joystick-To-Mouse</a> f&uuml;r weitere Beispiele.</em></pre>
</div>
</div>
</body></html>