<!DOCTYPE HTML>
<html>
<head>
<title>GroupDeactivate</title>
<meta name="keywords" content="Befehl, Fenster">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <article>
    <h1>GroupDeactivate</h1>
    <p>&Auml;hnelt <a href="GroupActivate.htm">GroupActivate</a>, nur wird das n&auml;chste Fenster aktiviert, welches <strong>nicht</strong> zur Gruppe geh&ouml;rt.</p>
    <pre class="Syntax">GroupDeactivate, Gruppenname [, R] </pre>
    <h3>Parameter</h3>
    <table class="info">
      <tr>
        <td style="width: 15%;">Gruppenname</td>
        <td style="width: 85%;">Der Name der Gruppe, urspr&uuml;nglich von <a href="GroupAdd.htm">GroupAdd</a> definiert.</td>
      </tr>
      <tr>
        <td>R</td>
        <td>Damit wird festgelegt, ob das &auml;lteste oder das neueste Fenster au&szlig;erhalb der Gruppe aktiviert wird, sobald kein Fenster der Gruppe aktiv ist. Wenn nicht vorhanden, dann wird immer das &auml;lteste Fenster au&szlig;erhalb der Gruppe aktiviert. Mit dem Buchstaben R wird das neueste (zuletzt aktive) Fenster au&szlig;erhalb der Gruppe aktiviert, aber mit der Bedingung, dass kein Fenster der Gruppe aktiv ist, wenn der Befehl ausgef&uuml;hrt wird. "R" ist beispielsweise n&uuml;tzlich, falls der Benutzer sich vor&uuml;bergehend mit einer anderen Aufgabe besch&auml;ftigt. Kehrt er dann mittels <a href="GroupActivate.htm">GroupActivate</a>, <a href="GroupDeactivate.htm">GroupDeactivate</a> oder <a href="GroupClose.htm">GroupClose</a> zur Gruppe zur&uuml;ck, wird das am aktuellsten genutzte Fenster aktiviert.</td>
      </tr>
    </table>
    <h3>Bemerkungen</h3>
    <p>Dieser Befehl aktiviert das erste Fenster, das <strong>nicht</strong> mit den Spezifikationen der Fenstergruppe &uuml;bereinstimmt. Beim nochmaligen Verwenden wird das n&auml;chste Fenster in der Reihe aktiviert und so weiter. Normalerweise wird dieser Befehl einem Hotkey zugewiesen, damit dieses Verhalten beim Dr&uuml;cken einer Taste automatisiert wird.</p>
    <p>Dieser Befehl ist n&uuml;tzlich, falls der Benutzer Lieblingsfenster hat, die immer vorhanden sein sollen. Durch das Hinzuf&uuml;gen dieser Fenster zu einer Gruppe kann der Benutzer mit dem Befehl GroupDeactivate jedes Fenster aufsuchen, das nicht zu den Favoriten geh&ouml;rt und dann entscheiden, ob dieses Fenster geschlossen werden soll oder nicht. Damit kann der Benutzer den Desktop im Gegensatz zur manuellen Vorgehensweise schnell aufr&auml;umen.</p>
    <p>Siehe <a href="GroupAdd.htm">GroupAdd</a> f&uuml;r mehr Details &uuml;ber Fenstergruppen.</p>
    <h3>Verwandte Befehle</h3>
    <p><a href="GroupAdd.htm">GroupAdd</a>, <a href="GroupActivate.htm">GroupActivate</a>, <a href="GroupClose.htm">GroupClose</a></p>
    <h3>Beispiel</h3>
    <pre class="NoIndent">GroupDeactivate, EigeneLieblingsfenster  <em>; Nicht favorisierte Fenster schlie&szlig;en.</em></pre>
  </article>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>
