<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>GroupAdd</title>
<meta name="keywords" content="Befehl, Fenster">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>GroupAdd</h1>

<p>F&uuml;gt eine Fensterspezifikation zur Fenstergruppe hinzu und erstellt je nach Bedarf die Gruppe.</p>

<pre class="Syntax">GroupAdd, Gruppenname [, Fenstertitel, Fenstertext, Label, Titelausnahme, Textausnahme]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">Gruppenname</td>
    <td width="85%">Der Name der Gruppe, der die Fenster hinzugef&uuml;gt werden. Wenn die Gruppe nicht existiert, dann wird sie erstellt. Gruppennamen sind nicht von der Gro&szlig;- bzw. Kleinschreibung abh&auml;ngig. </td>
  </tr>
  <tr>
    <td>Fenstertitel</td>
    <td><p>Der Titel oder Teiltitel eines oder mehrerer Fenster(s). Dieser Parameter kann auch leer sein. <strong>Hinweis</strong>: Obwohl <a href="SetTitleMatchMode.htm">SetTitleMatchMode</a> und <a href="DetectHiddenWindows.htm">DetectHiddenWindows</a> das Verhalten des Befehls nicht direkt beeinflussen, beeinflussen sie jedoch andere Gruppenbefehle wie <a href="GroupActivate.htm">GroupActivate</a> und <a href="GroupClose.htm">GroupClose</a>. Sie beeinflussen auch das Benutzen von ahk_group in anderen <em>Fenstertitel</em>-Parametern.</p>
      <p>Bei Verwendung einer Fensterklasse muss ahk_class ExakterKlassenname angegeben werden (wird von Windows Spy angezeigt). Bei Verwendung einer <a href="Process.htm">Prozess-Kennung (PID)</a> muss ahk_pid %VariableMitPID% angegeben werden.</p>
      <p>Bei Verwendung einer <a href="WinGet.htm">eindeutigen ID-Nummer</a> eines Fensters muss ahk_id %VariableMitID% angegeben werden. Um eine Fenstergruppe zu benutzen, verwendet "ahk_group Gruppenname" (d. h. Gruppen k&ouml;nnen andere Gruppen enthalten).</p>
      <p>Die Suche kann durch Angabe <a href="../LastFoundWindow.htm#multi">mehrerer Kriterien</a> eingeschr&auml;nkt werden. Zum Beispiel: <em>Eigene Datei.txt ahk_class Notepad</em></p></td>
  </tr>
  <tr>
    <td>Fenstertext</td>
    <td>Wenn vorhanden, dann muss dieser Parameter einen Teil der einzelnen Textelemente des Fensters enthalten (wird von Windows Spy angezeigt). Versteckte Textelemente werden erfasst, wenn <a href="DetectHiddenText.htm">DetectHiddenText</a> aktiv ist, w&auml;hrend <a href="GroupActivate.htm">GroupActivate</a>, <a href="GroupDeactivate.htm">GroupDeactivate</a> und <a href="GroupClose.htm">GroupClose</a> verwendet wird.</td>
  </tr>
  <tr>
    <td>Label</td>
    <td>Die Bezeichnung einer auszuf&uuml;hrenden Subroutine, wenn kein Fenster zur Gruppe (oder zur <i>Fensterbeschreibung</i> vor AHK_L 54) passt, w&auml;hrend der <a href="GroupActivate.htm">GroupActivate</a>-Befehl verwendet wird. Der Sprung zum Label verh&auml;lt sich wie bei einem <a href="Gosub.htm">Gosub</a>. Dieser Parameter kann leer- oder weggelassen werden.</td>
  </tr>
  <tr>
    <td>Titelausnahme</td>
    <td>Ignoriert Fenster, deren Titel diesen Wert enthalten.</td>
  </tr>
  <tr>
    <td>Textausnahme</td>
    <td>Ignoriert Fenster, deren Textelemente diesen Wert enthalten.</td>
  </tr>
</table>

<h3>Bemerkungen</h3>
<p>Jedes Mal wird eine neue Regel hinzugef&uuml;gt, wenn dieser Befehl benutzt wird. Das hei&szlig;t, dass eine Gruppe aus einer Reihe von Kriterien besteht, anstatt einer feste Liste von Fenstern. Wenn eine Gruppe sp&auml;ter von Befehlen wie <a href="GroupActivate.htm">GroupActivate</a> verwendet wird, dann wird jedes Fenster auf dem Desktop mit diesen Kriterien verglichen. Wenn ein Fenster mit einem Kriterium der Gruppe &uuml;bereinstimmt, dann ist die &Uuml;bereinstimmung erfolgreich.</p>
<p>F&uuml;r gew&ouml;hnlich werden verwandte Fenster miteinander verbunden, besonders f&uuml;r Aufgaben, die solche Fenster mit einbeziehen, oder f&uuml;r eine Anwendung, die mehrere Unterfenster besitzt. Wenn der Benutzer beispielsweise sehr oft mit mehreren Instanzen von Grafikprogrammen oder Texteditoren arbeitet, dann kann er <a href="GroupActivate.htm">GroupActivate</a> in Verbindung mit einem Hotkey verwenden, um jede Instanz solcher Programme hintereinander aufzusuchen, ohne dass er dazu Alt+Tab oder die Taskleiste benutzt.</p>
<p>Da die Eintr&auml;ge in jeder Gruppe nur einmal aufgenommen werden m&uuml;ssen, wird dieser Befehl in der Regel im automatischen Ausf&uuml;hrungsbereich verwendet (oberster Bereich des Scripts). Doppelt vorkommende Eintr&auml;ge werden ignoriert.</p>
<p>Um <u>alle</u> Fenster in einer Gruppe mit einzuschlie&szlig;en (au&szlig;er Programm-Manager), verwendet dieses Beispiel:</p>
<pre>GroupAdd, AllWindows</pre>
<p>Alle Fensterbefehle k&ouml;nnen eine Fenstergruppe bearbeiten, wenn <em>ahk_group EigenerGruppenname</em> im <em>Fenstertitel</em>-Parameter verwendet wird. Die Befehle <a href="WinMinimize.htm">WinMinimize</a>, <a href="WinMaximize.htm">WinMaximize</a>, <a href="WinRestore.htm">WinRestore</a>, <a href="WinHide.htm">WinHide</a>, <a href="WinShow.htm">WinShow</a>, <a href="WinClose.htm">WinClose</a> und <a href="WinKill.htm">WinKill</a> beeinflussen <strong>alle</strong> Fenster einer Gruppe. Um stattdessen nur das oberste Fenster zu beeinflussen, befolgt dieses Beispiel:</p>
<pre>WinHide % "ahk_id " . WinExist("ahk_group <strong>EigeneGruppe</strong>")</pre>
<p>Andere Fensterbefehle wie <a href="WinActivate.htm">WinActivate</a> und <a href="IfWinExist.htm">IfWinExist</a> bearbeiten hingegen nur das oberste Fenster einer Gruppe.</p>
<h3>Verwandte Befehle</h3>
<p><a href="GroupActivate.htm">GroupActivate</a>, <a href="GroupDeactivate.htm">GroupDeactivate</a>, <a href="GroupClose.htm">GroupClose</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent"><em>; Im automatischen Ausf&uuml;hrungsbereich (oberster Bereich des Scripts): </em>
GroupAdd, MSIE, ahk_class IEFrame <em>; Nur den Internet Explorer zur Gruppe hinzuf&uuml;gen.</em>
Return <em>; Ende des automatischen Ausf&uuml;hrungsbereichs.</em>

<em>; Ein Hotkey, um nacheinander zwischen
; alle offenen MSIE-Fenster zu schalten
; (d. h. bei jedem Dr&uuml;cken des Hotkeys).</em>
Numpad1::GroupActivate, MSIE, r

<em>; Hier ist eine komplexere Gruppe f&uuml;r MS Outlook 2002.
; Im automatischen Ausf&uuml;hrungsbereich (oberster Bereich des Scripts): </em>
SetTitleMatchMode, 2
GroupAdd, mail, Nachricht - Microsoft Word <em>; F&uuml;r E-Mails, die gerade entwurfen werden </em>
GroupAdd, mail, - Nachricht ( <em>; F&uuml;r bereits offene E-Mails
; Ben&ouml;tigt zus&auml;tzlichen Text, um das Aktivieren eines Phantom-Fensters zu verhindern:</em>
GroupAdd, mail, Erweiterte Suche, Dur&chsuchen...
GroupAdd, mail, , Recurrence:
GroupAdd, mail, Erinnerungsfenster
GroupAdd, mail, - Microsoft Outlook
Return  <em>; Ende des automatischen Ausf&uuml;hrungsbereichs.</em>


Numpad5::GroupActivate, mail <em>; Ein Hotkey, um hintereinander zwischen jedes Outlook-Fenster zu schalten.</em></pre>

</body>
</html>