<!DOCTYPE HTML>
<html>
<head>
<title>GuiControl</title>
<meta name="keywords" content="Befehl, Grafische Benutzeroberfl&auml;che">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
  <div id="content"> 
    <script src="../navbar/NavScript.js" type="text/javascript"></script> 
    <script type="text/javascript">WriteNavLink(1);</script>
    <h1>GuiControl</h1>
    <p>Erm&ouml;glicht &Auml;nderungen eines Steuerelements in einem GUI-Fenster.</p>
    <pre class="Syntax">GuiControl, Unterbefehl, SteuerelementID [, Param3] </pre>
    <h3>Parameter</h3>
    <table class="info">
      <tr>
        <td>Unterbefehl</td>
        <td>Siehe untere Liste.</td>
      </tr>
      <tr>
        <td style="width: 15%;">SteuerelementID</td>
        <td style="width: 85%;"><p>Wenn das Ziel-Steuerelement eine zugewiesene Variable hat, dann kann der Name der Variable als <em>SteuerelementID</em> angegeben werden (diese Methode hat Vorrang vor der n&auml;chsten Methode). Daher ist es am besten, dem Steuerelement eine Variable zuzuweisen, auf das sp&auml;ter mit GuiControl oder GuiControlGet zugegriffen wird, selbst wenn es nicht eingabef&auml;hig ist (z. B. GroupBox oder Text).</p>
          <p>Ansonsten ist die <em>SteuerelementID</em> entweder die ClassNN (Klassenname und Instanznummer des Steuerelements) oder der Name/Text des Steuerelements, die beide mit Windows Spy ermittelt werden k&ouml;nnen. Beim Name/Text wird das &Uuml;bereinstimmungsverhalten mit <a href="SetTitleMatchMode.htm">SetTitleMatchMode</a> bestimmt. Hinweis: Der Dateiname eines Picture-Steuerelements kann auch als <em>SteuerelementID</em> verwendet werden.</p>
          <p><span class="ver">[v1.1.04+]:</span> <em>SteuerelementID</em> kann das <a href="Gui.htm#HwndOutputVar">HWND</a> des Steuerelements sein.</p></td>
      </tr>
      <tr>
        <td>Param3</td>
        <td>Dieser Parameter kann weggelassen werden, solange er nicht von einem Unterbefehl aus der unteren Liste ben&ouml;tigt wird.</td>
      </tr>
    </table>
    <h3>ErrorLevel</h3>
    <p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
    <p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 1 gesetzt, wenn das angegebene Fenster/Steuerelement nicht existiert oder ein anderes Problem aufgetreten ist. Ansonsten auf 0.</p>
    <h3>Unterbefehle</h3>
    <p><strong>(Leer)</strong>: Falls der <em>Unterbefehl</em> leer ist, k&ouml;nnen neue Inhalte &uuml;ber <em>Param3</em> in das Steuerelement eingef&uuml;gt werden. Im Einzelnen:</p>
    <p><a href="GuiControls.htm#Picture">Picture</a>: Bestimmt mit <em>Param3</em> den Dateinamen des neuen Bildes, das geladen werden soll (siehe <a href="GuiControls.htm#Picture">Gui Picture</a> f&uuml;r unterst&uuml;tzte Dateitypen). Direkt vor dem Dateinamen k&ouml;nnen beliebig viele der folgenden Optionen angegeben werden: *wN (Breite N), *hN (H&ouml;he N) und *IconN (Gruppennummer des Icons N in einer DLL- oder EXE-Datei).  Im folgenden Beispiel wird das Standard-Icon aus der zweiten Icon-Gruppe geladen - mit einer Breite von 100 Pixel und einer automatischen H&ouml;he via "Seitenverh&auml;ltnis beibehalten": <code>GuiControl,, EigenesBild, *icon2 *w100 *h-1 C:\Eigene Anwendung.exe</code>. Mit <em>*w0 *h0</em> wird die aktuelle Breite und H&ouml;he des Bildes beibehalten. Wenn *w und *h nicht vorhanden sind, passt sich das Bild an die Steuerelementgr&ouml;&szlig;e an. Falls ein Icon aus einer ICO-Datei geladen wird, die mehrere Icons enth&auml;lt, dann bewirkt die Angabe von Breite und H&ouml;he zudem, welches Icon geladen wird. Hinweis: Zwischen der letzten Option und dem Dateinamen selbst sollte nur ein Leer- oder Tabulatorzeichen verwendet werden; weitere Leer- und Tabulatorzeichen werden als Teil des Dateinamens betrachtet.</p>
    <p><a href="GuiControls.htm#Text">Text</a>/<a href="GuiControls.htm#Button">Button</a>/<a href="GuiControls.htm#GroupBox">GroupBox</a>/<a href="GuiControls.htm#StatusBar">StatusBar</a>: Bestimmt mit <em>Param3</em> den neuen Text des Steuerelements. Da das Steuerelement sich dabei nicht automatisch breiter macht, verwendet, falls n&ouml;tig, <code><a href="#Move">GuiControl</a>, Move, EigenerText, W300</code>. Beim <a href="GuiControls.htm#StatusBar">StatusBar</a>-Steuerelement wird nur der Text im ersten Teil ge&auml;ndert (verwendet daher <a href="GuiControls.htm#SB_SetText">SB_SetText()</a> f&uuml;r eine h&ouml;here Flexibilit&auml;t).</p>
    <p><a href="GuiControls.htm#Edit">Edit</a>: Jedes LF-Zeichen (`n) in <em>Param3</em> ohne vorhergehendes CR-Zeichen (`r) wird automatisch in CR+LF (`r`n) umgewandelt, damit diese korrekt angezeigt werden. Allerdings ist das normalerweise kein Grund zur Sorge, weil diese Umwandlung durch die Befehle "Gui Submit" und "GuiControlGet Ausgabevariable" automatisch r&uuml;ckg&auml;ngig gemacht wird, indem CR+LF mit LF (`n) ersetzt wird.</p>
    <p><a href="GuiControls.htm#Hotkey">Hotkey</a>: Mit leerem <em>Param3</em>-Wert kann das Steuerelement freigemacht werden, ansonsten k&ouml;nnen mehrere Modifikatortasten mit einem Tastennamen angegeben werden. Beispiele: ^!c, ^Numpad1, +Home. Es werden nur die Modifikatortasten ^ (Steuerung), ! (Alt) und + (Umschalt) unterst&uuml;tzt. Siehe <a href="../KeyList.htm">Keyboard, Maus und Joystickreferenz</a> f&uuml;r weitere Tasten.</p>
    <p><a href="GuiControls.htm#Checkbox">Checkbox</a>: Mit einer 1 in <em>Param3</em> wird das H&auml;kchen im Kontrollk&auml;stchen hinzugef&uuml;gt, mit 0 entfernt und mit -1 grau gemacht. Ansonsten wird <em>Param3</em> als neue Bezeichnung/neuer Text angesehen. Siehe <strong>Text</strong> weiter unten, wie dieses Verhalten &uuml;berschrieben werden kann.</p>
    <p><a href="GuiControls.htm#Radio">Radio</a>: Das Gleiche wie Checkbox. Wenn das Optionsfeld allerdings ausgew&auml;hlt wird und zu einer Gruppe von Optionsfeldern geh&ouml;rt, werden die anderen Optionsfelder in der Gruppe automatisch abgew&auml;hlt. Um ein neues Optionsfeld innerhalb einer Gruppe von Optionsfeldern auszuw&auml;hlen, welches nur eine Variable hat, ersetzt <em>SteuerelementID</em> mit dem Namen/Text des Optionsfelds, falls es nicht das Optionsfeld ist, mit dem die Variable direkt verbunden wurde.</p>
    <p><a href="GuiControls.htm#DateTime">DateTime</a>/<a href="GuiControls.htm#MonthCal">MonthCal</a>: Bestimmt mit <em>Param3</em> einen Zeitstempel im <a href="FileSetTime.htm#YYYYMMDD">YYYYMMDDHH24MISS</a>-Format. Mit %A_Now% kann das aktuelle Datum und die aktuelle Zeit verwendet werden. Bei DateTime-Steuerelementen bewirkt das Weglassen von <em>Param3</em>, dass das Steuerelement keinen Datum bzw. keine Zeit ausgew&auml;hlt hat (falls das Steuerelement mit der <a href="GuiControls.htm#ChooseNone">Nummer 2</a> in den Optionen erstellt wurde). Bei MonthCal-Steuerelementen kann ein Bereich angegeben werden, wenn die <a href="GuiControls.htm#MonthCalMulti">Mehrfachauswahl</a> aktiviert ist.</p>
    <p><a href="GuiControls.htm#UpDown">UpDown</a>/<a href="GuiControls.htm#Slider">Slider</a>/<a href="GuiControls.htm#Progress">Progress</a>: Bestimmt mit <em>Param3</em> die neue Position des Steuerelements. Sobald das erste Zeichen in <em>Param3</em> ein Plus ist, wird die Zahl als Offset von der aktuellen Position angesehen. Zum Beispiel w&uuml;rde mit +10 die Position um 10 Pixel erh&ouml;ht und mit +-10 um 10 Pixel verringert werden. Falls die neue Position au&szlig;erhalb des Bereichs liegt, wird die Position auf den n&auml;chsten g&uuml;ltigen Wert gesetzt.</p>
    <p><a href="GuiControls.htm#Tab">Tab</a>/<a href="GuiControls.htm#DropDownList">DropDownList</a>/<a href="GuiControls.htm#ComboBox">ComboBox</a>/<a href="GuiControls.htm#ListBox">ListBox</a>: Bestimmt mit <em>Param3</em> eine Liste von Eintr&auml;gen, die ans Listenende des Steuerelements angef&uuml;gt werden sollen (durch senkrechte Striche getrennt). Um die Liste stattdessen zu ersetzen (&uuml;berschreiben), f&uuml;gt einen senkrechten Strich als erstes Zeichen hinzu (z. B. |Rot|Gr&uuml;n|Blau). Mit einem einzelnen senkrechten Strich (|) kann das Steuerelement geleert werden. Damit einer der Eintr&auml;ge vorausgew&auml;hlt ist, f&uuml;gt nach ihm zwei senkrechte Striche ein (z. B. Rot|Gr&uuml;n||Blau). Das Trennzeichen zwischen den Feldern muss nicht zwingend ein senkrechter Strich sein. Mit <a href="Gui.htm#Delimiter"><code>Gui +Delimiter`n</code></a> beispielsweise wird es in ein Zeilenumbruchszeichen und mit <code>Gui +DelimiterTab</code> in ein Tabulatorzeichen (`t) umgewandelt.</p>
    <p><a href="GuiControls.htm#Tab">Tab-Steuerelemente</a>: Zus&auml;tzlich zum oben genannten Verhalten bleiben Untersteuerelemente eines Tabs mit ihren urspr&uuml;nglichen Tab-Nummern verbunden. Das hei&szlig;t, dass sie nie dem tats&auml;chlichen Anzeigenamen des Tabs zugeordnet sind. Daher wirkt sich das Umbenennen oder Entfernen eines Tabs nicht auf die Tab-Nummer aus, auf die sich die Unterelemente beziehen. Wenn zum Beispiel der zweite Tab von insgesamt drei Tabs "Rot|Gr&uuml;n|Blau" mit <code>GuiControl,, EigenesTab, |Rot|Blau</code> entfernt wird, werden die Untersteuerelemente, die urspr&uuml;nglich "Gr&uuml;n" geh&ouml;rten, nun mit "Blau" verbunden. Aus diesem Grund sollten nur Tabs entfernt werden, die sich am Ende befinden. Tabs, die auf diese Weise entfernt werden, k&ouml;nnen sp&auml;ter wieder hinzugef&uuml;gt werden, um die urspr&uuml;nglichen Steuerelemente wiederherzustellen.</p>
    <p><a href="ListView.htm">ListView</a> und <a href="TreeView.htm">TreeView</a>: Diese Steuerelemente werden nicht unterst&uuml;tzt, wenn der <em>Unterbefehl</em> leer ist. Verwendet stattdessen die internen Funktionen von <a href="ListView.htm#BuiltIn">ListView</a> und <a href="TreeView.htm#BuiltIn">TreeView</a>.</p>
    <p id="Text"><strong><span class="CommandSyntax">GuiControl</span>, Text</strong>: Verh&auml;lt sich wie oben, au&szlig;er bei:<br>
      <a href="GuiControls.htm#Checkbox">Checkbox</a>/<a href="GuiControls.htm#Radio">Radio</a>: <em>Param3</em> wird als neue(r) Text/Bezeichnung angesehen, selbst wenn es -1, 0 oder 1 ist.<br>
      <a href="GuiControls.htm#DateTime">DateTime</a>: <em>Param3</em> wird als neues <a href="GuiControls.htm#DateTimeFormat">Datum/Zeit-Format</a> angesehen, das vom Steuerelement angezeigt wird. Beim Weglassen von Param3 werden alle benutzerdefinierten Formate entfernt und das kurze Datumsformat erwirkt.<br>
      <a href="GuiControls.htm#ComboBox">ComboBox</a>: <em>Param3</em> wird als Text angesehen, der direkt in das Eingabefeld der ComboBox eingef&uuml;gt wird.</p>
    <p id="Move"><strong><span class="CommandSyntax">GuiControl</span>, Move</strong>: Verschiebt das Steuerelement und/oder &auml;ndert dessen Gr&ouml;&szlig;e. Es k&ouml;nnen beliebig viele der folgenden Optionsbuchstaben in <em>Param3</em> angegeben werden: X (die X-Koordinate bezieht sich auf den Client-Bereich des GUI-Fensters, ohne Titelleiste, Men&uuml;leiste und Rahmen); Y (die Y-Koordinate), W (Breite), H (H&ouml;he). Jede Zahl muss dezimal angegeben werden. Zum Beispiel:</p>
    <pre>GuiControl, Move, EigenesEdit, x10 y20 w200 h100
GuiControl, Move, EigenesEdit, % "x" VarX+10 "y" VarY+5 "w" VarW*2 "h" VarH*1.5 <em>; Verwendet ein <a href="../Variables.htm#Expressions">Ausdruck</a> mithilfe des Pr&auml;fixes "% ".</em></pre>
    <p id="MoveDraw"><strong><span class="CommandSyntax">GuiControl</span>, MoveDraw</strong>: Das Gleiche wie "Move" (oben), jedoch wird zus&auml;tzlich der GUI-Fensterbereich beim Setzen des Steuerelements neu gezeichnet. Falls dieser Befehl schnell und mehrmals hintereinander aufgerufen wird, kann es passieren, dass es zu unerw&uuml;nschtem Flackern kommt. Allerdings ist er in der Lage, entstandene Artefakte beim Zeichnen von bestimmten Steuerelementen wie <a href="GuiControls.htm#GroupBox">GroupBox</a> aufzul&ouml;sen. Seit v1.0.48.04 kann der letzte Parameter weggelassen werden, um das Steuerelement neu zu zeichnen, ohne es dabei zu verschieben.</p>
    <p><strong><span class="CommandSyntax">GuiControl</span>, Focus</strong>: Setzt den Tastaturfokus auf das Steuerelement. Damit dieser Befehl richtig funktioniert, darf das Fenster des Steuerelements generell nicht minimiert oder versteckt sein.</p>
    <p><strong><span class="CommandSyntax">GuiControl</span>, Enable / Disable</strong>: Aktiviert oder deaktiviert ("ergraut") ein Steuerelement. Bei Tab-Steuerelementen werden dabei auch alle Untersteuerelemente aktiviert oder deaktiviert. Beachtet aber, das jedes Untersteuerelement, das direkt mit "GuiControl Disable" deaktiviert wurde, sich diese Einstellung merkt und folglich deaktiviert bleibt, falls das Tab-Steuerelement wieder aktiviert wird. Optional kann nach dem Wort Disabled oder Enable eine 0 oder 1 erfolgen. Eine 0 bewirkt, dass die Wirkung umgekehrt wird. Zum Beispiel wird das Steuerelement sowohl mit <em>Enable</em> als auch mit <em>Enable%VarMitEins%</em> aktiviert, aber mit <em>Enable%VarMitNull%</em> deaktiviert.</p>
    <p><strong><span class="CommandSyntax">GuiControl</span>, Hide / Show</strong>: Das Steuerelement verstecken oder anzeigen. Bei Tab-Steuerelementen werden dabei auch alle Untersteuerelemente versteckt oder angezeigt. Falls zus&auml;tzlich der Bedarf besteht, die Tastenkombination des Steuerelements (unterstrichener Buchstabe) zu unterdr&uuml;cken, verwendet "GuiControl Disable". Optional kann nach dem Wort Hide oder Show eine 0 oder 1 erfolgen. Eine Null bewirkt, dass die Wirkung umgekehrt wird. Zum Beispiel wird das Steuerelement sowohl mit <em>Show</em> als auch mit <em>Show%VarMitEins%</em> angezeigt, aber mit <em>Show%VarMitNull%</em> versteckt.</p>
    <p><strong><span class="CommandSyntax">GuiControl</span>, Delete (noch nicht implementiert)</strong>: Dieser Unterbefehl ist zurzeit noch nicht vorhanden. Als &Uuml;bergangsl&ouml;sung kann <strong>Hide</strong> und/oder <strong>Disable</strong> (siehe oben) verwendet werden, oder das ganze Fenster mit <a href="Gui.htm#Destroy">Gui Destroy</a> zerst&ouml;rt und neu erstellt werden.</p>
    <p><strong><span class="CommandSyntax">GuiControl</span>, Choose, SteuerelementID, N</strong>: Setzt die Auswahl auf den N-ten Eintrag in einem ListBox-, ComboBox- oder Tab-Steuerelement. <em>N</em> ist mit der Nummer 1 der erste Eintrag, mit der Nummer 2 der zweite Eintrag und so weiter (sobald <em>N</em> kein Integer ist, wird die unten genannte ChooseString-Methode verwendet). Im Gegensatz zu <a href="Control.htm">Control Choose</a> wird dieser Unterbefehl keinen <a href="Gui.htm#label">g-Label</a> ausl&ouml;sen, es sei denn, <em>N</em> wird mit einem senkrechten Strich vorangestellt (selbst dann wird das g-Label nur ausgel&ouml;st, wenn die neue Auswahl sich von der alten Auswahl unterscheidet, zumindest bei <a href="GuiControls.htm#Tab">Tab-Steuerelementen</a>). Zum Beispiel: <code>GuiControl, Choose, EigeneListBox, <strong>|3</strong></code>.</p>
    <p>Damit zudem ein abschlie&szlig;endes Ereignis erfolgen kann (z. B. Doppelklick in einer ListBox), m&uuml;ssen zwei senkrechte Striche anstelle von einem vorangestellt werden (bei Tab-Steuerelementen nicht unterst&uuml;tzt).</p>
    <p>Um <u>alle</u> Eintr&auml;ge in einer <a href="GuiControls.htm#ListBoxMulti">ListBox mit Mehrfachauswahl</a> aus- oder abzuw&auml;hlen, siehe Beispiel:</p>
    <pre>Gui +LastFound  <em>; Verhindert, dass der Fenstertitel darunter angegeben werden muss.</em>
<a href="PostMessage.htm">PostMessage</a>, 0x185, 1, -1, ListBox1  <em>; Alle ListBox-Eintr&auml;ge ausw&auml;hlen. 0x185 ist LB_SETSEL.</em>
<a href="PostMessage.htm">PostMessage</a>, 0x185, 0, -1, ListBox1  <em>; Alle ListBox-Eintr&auml;ge abw&auml;hlen.</em></pre>
    <p><strong><span class="CommandSyntax">GuiControl</span>, ChooseString, SteuerelementID, String</strong>: Setzt die Auswahl auf den ersten Eintrag in einem ListBox-, ComboBox- und Tab-Steuerelement, dessen f&uuml;hrender Teil mit <em>String</em> &uuml;bereinstimmt. Die Suche ist nicht von der Gro&szlig;- und Kleinschreibung abh&auml;ngig. Wenn zum Beispiel das Steuerelement den Eintrag "UNIX-Text" enth&auml;lt, dann gen&uuml;gt das Wort unix (kleingeschrieben), um es auszuw&auml;hlen. Als Pr&auml;fix werden zudem "|" oder "||" unterst&uuml;tzt (siehe "Choose" f&uuml;r Details).</p>
    <p><strong><span class="CommandSyntax">GuiControl</span>, Font</strong>: &Auml;ndert die Schriftart, Schriftgr&ouml;&szlig;e, Schriftstil und/oder Schriftfarbe des Steuerelements. Zum Beispiel:</p>
    <pre><a href="Gui.htm#Font">Gui, Font</a>, s18 cRed Bold, Verdana  <em>; Verwendet je nach Bedarf so eine Zeile, um eine neue Standard-Schrift zu setzen.</em>
GuiControl, Font, EigenesEdit  <em>; Setzt die obere Schrift f&uuml;r ein Steuerelement in Kraft.</em></pre>
    <p><strong><span class="CommandSyntax">GuiControl</span>, +/-Option1 +/-Option2 ... </strong>: Hinzuf&uuml;gen oder Entfernen von verschiedenen <a href="GuiControls.htm">steuerelement-spezifischen</a> oder <a href="Gui.htm#OtherOptions">allgemeinen</a> Optionen und Styles. Im folgenden Beispiel wird die <a href="Gui.htm#AltSubmit">AltSubmit</a>-Option aktiviert, aber <a href="Gui.htm#label">g-Label</a> entfernt:</p>
    <pre>GuiControl, +AltSubmit -g, EigeneListBox</pre>
    <p>Im n&auml;chsten Beispiel wird die OK-Schaltfl&auml;che zur neuen Standardschaltfl&auml;che:</p>
    <pre>GuiControl, +Default, OK</pre>
    <p>Obwohl <a href="../misc/Styles.htm">Styles</a> und erweiterte Styles auch erkannt werden, k&ouml;nnen einige von ihnen nicht angewendet oder entfernt werden, nachdem ein Steuerelement erstellt wurde. ErrorLevel wird auf 0 gesetzt, wenn mindestens eine der angegebenen &Auml;nderungen erfolgreich durchgef&uuml;hrt wurde. Ansonsten wird es auf 1 gesetzt, um klarzustellen, dass keine einzige &Auml;nderung durchf&uuml;hrbar war. Es ist m&ouml;glich, dass das Steuerelement eine &Auml;nderung ignoriert, auch wenn diese erfolgreich durchgef&uuml;hrt wurde.</p>
    <h3>Bemerkungen</h3>
    <p>Um neben dem <a href="Gui.htm#DefaultWin">Standard</a>-Fenster auch andere Fenster bearbeiten zu k&ouml;nnen, f&uuml;gt dessen Name oder Nummer (oder seit v1.1.03 dessen <a href="Gui.htm#GuiHwndOutputVar">HWND</a>) gefolgt von einem Doppelpunkt vor dem Unterbefehl wie folgt ein:</p>
    <pre>GuiControl, EigenesGui:Show, EigenerButton
GuiControl, EigenesGui:, EigeneListBox, Element1|Element2</pre>
    <p>Ein <a href="../misc/Threads.htm">GUI-Thread</a> wird wie jeder andere Thread definiert, der aufgrund einer GUI-Aktion gestartet wurde. Zu den GUI-Aktionen geh&ouml;rt beispielsweise das Ausw&auml;hlen eines Men&uuml;punkts oder das Ausf&uuml;hren eines <a href="Gui.htm#label">g-Labels</a> (z. B. beim Dr&uuml;cken einer Schaltfl&auml;che).</p>
    <p>Der <a href="Gui.htm#DefaultWin">Standardfenstername</a> f&uuml;r einen GUI-Thread ist von dem Fenster, das diesen Thread gestartet hat. Nicht-GUI-Threads verwenden standardm&auml;&szlig;ig die 1.</p>
    <h3>Verwandte Befehle</h3>
    <p><a href="Gui.htm">Gui</a>, <a href="GuiControlGet.htm">GuiControlGet</a>, <a href="Control.htm">Control</a></p>
    <h3>Beispiele</h3>
    <pre class="NoIndent">GuiControl,, EigeneListBox, |Rot|Gr&uuml;n|Blau  <em>; Ersetzt die aktuelle Liste mit einer neuen Liste.</em>
GuiControl,, EigenesEdit, Neue Textzeile 1.`nNeue Textzeile 2.
GuiControl,, EigenesRadio2, 1  <em>; Aktiviert das Optionsfeld und deaktiviert alle anderen in dieser Gruppe.</em>
GuiControl, Move, OK, x100 y200  <em>; Verschiebt die OK-Schaltfl&auml;che zur neuen Position.</em>
GuiControl, Focus, Nachname  <em>; Setzt den Tastaturfokus auf ein Steuerelement, dessen Variable oder Text "Nachname" ist.</em></pre>
  </div>
</div>
</body>
</html>