<!DOCTYPE HTML>
<html>
<head>
<title>GUI-Steuerelementarten</title>
<meta name="keywords" content="Befehl, Grafische Benutzeroberfl&auml;che">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
  <div id="content"> 
    <script src="../navbar/NavScript.js" type="text/javascript"></script> 
    <script type="text/javascript">WriteNavLink(1);</script>
    <h1><a href="Gui.htm">GUI</a>-Steuerelementarten</h1>
    <h2>Inhaltsverzeichnis</h2>
    <ul>
      <li><a href="#Text">Text</a>, <a href="#Edit">Edit</a>, <a href="#UpDown">UpDown</a>, <a href="#Picture">Picture</a></li>
      <li><a href="#Button">Button</a>, <a href="#Checkbox">Checkbox</a>, <a href="#Radio">Radio</a></li>
      <li><a href="#DropDownList">DropDownList</a>, <a href="#ComboBox">ComboBox</a></li>
      <li><a href="#ListBox">ListBox</a>, <a href="ListView.htm">ListView</a>, <a href="TreeView.htm">TreeView</a></li>
      <li><a href="#Link">Link</a>, <a href="#Hotkey">Hotkey</a>, <a href="#DateTime">DateTime</a></li>
      <li><a href="#MonthCal">MonthCal</a>, <a href="#Slider">Slider</a>, <a href="#Progress">Progress</a></li>
      <li><a href="#GroupBox">GroupBox</a>, <a href="#Tab">Tab2</a>, <a href="#StatusBar">StatusBar</a></li>
      <li><a href="#ActiveX">ActiveX</a> (z. B. Internet Explorer Control)</li>
    </ul>
    <h2 id="Text">Text</h2>
    <p>Beschreibung: Ein Textfeld ohne Rand, den der Benutzer nicht bearbeiten kann. Oft verwendet, um andere Steuerelemente zu beschriften.</p>
    <pre>Beispiel: Gui, Add, Text,, Bitte Name eingeben:</pre>
    <p>In diesem Fall ist der letzte Parameter der String, der angezeigt wird. Der String kann Zeilenumbruchszeichen (`n) enthalten, um neue Zeilen zu beginnen. Mithilfe eines <a href="../Scripts.htm#continuation">Fortsetzungsbereichs</a> kann eine lange Zeile au&szlig;erdem in mehreren kurzen Zeilen aufgeteilt werden.</p>
    <p>Wenn  in den <em>Optionen</em> die Breite (W) angegeben wird, aber die <a href="Gui.htm#R">Zeilen (R)</a> oder die H&ouml;he (H) weggelassen werden, wird der Text wie vorgesehen automatisch umbrochen und die H&ouml;he der Steuerelemente automatisch gesetzt.</p>
    <p>Da der Inhalt des Steuerelements der letzte Parameter vom GUI-Befehl ist, m&uuml;ssen direkte Kommas nicht gesch&uuml;tzt werden. Das gilt auch f&uuml;r den letzten Parameter aller anderen Befehle.</p>
    <p>Es ist m&ouml;glich, ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> in den Optionen des Steuerelements anzugeben. Dadurch w&uuml;rde das Label <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer auf den Text klickt. Beispielsweise kann damit ein unterstrichener, blauer Hyperlink simuliert werden:</p>
    <pre>Gui, Font, underline
Gui, Add, Text, cBlue gGoogleStarten, Hier klicken, um Google zu starten.

<em>; Alternativ kann auch das Link-Steuerelement verwendet werden:</em>
Gui, Add, Link,, &lt;a href="www.google.com"&gt;Hier&lt;/a&gt; klicken, um Google zu starten.

Gui, Font, norm
Gui, Show
Return

GoogleStarten:
Run www.google.com
Return</pre>
    <p>Es kann auch ein Doppelklick erkannt werden, wenn &uuml;berpr&uuml;ft wird, ob <a href="../Variables.htm#GuiEvent">A_GuiEvent</a> das Wort DoubleClick enth&auml;lt.</p>
    <p>Ein Und-Zeichen (&amp;) kann im Text verwendet werden, um einen Buchstaben zu unterstreichen. Zum Beispiel:</p>
    <pre>Gui, Add, Text,, &amp;Vorname:
Gui, Add, Edit</pre>
    <p>Im obigen Beispiel wird der Buchstabe F unterstrichen. Das erm&ouml;glicht den Benutzer, die <a href="Gui.htm#ShortcutKey">Tastenkombination</a> <kbd>Alt</kbd>+<kbd>V</kbd> zu dr&uuml;cken, um den Tastaturfokus auf das erste eingabef&auml;hige Steuerelement zu setzen, welches nach dem Text-Steuerelement hinzugef&uuml;gt wurde. Um stattdessen ein Und-Zeichen direkt anzeigen zu lassen, verwendet zwei aufeinanderfolgende Und-Zeichen (&amp;&amp;). Um die Sonderbehandlung der Und-Zeichen zu deaktivieren, f&uuml;gt <a href="../misc/Styles.htm#SS_NOPREFIX">0x80</a> in den Optionen des Steuerelements ein.</p>
    <p>Siehe <a href="Gui.htm#OtherOptions">allgemeine Optionen</a> f&uuml;r weitere Optionen wie <em>Right</em>, <em>Center</em> und <em>Hidden</em>. Siehe auch: <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
    <h2 id="Edit">Edit</h2>
    <p>Beschreibung: Ein Eingabefeld, in dem formatloser Text eingegeben werden kann.</p>
    <pre>Beispiel: Gui, Add, Edit, r9 vEigenesEdit, Text erscheint innerhalb des Eingabefeldes (lasst diesen Parameter weg, um anfangs leer zu sein).</pre>
    <p>Das Steuerelement wird mehrzeilig, sobald es mehr als eine Textzeile enth&auml;lt. Mit r3 in den <em>Optionen</em> wird zum Beispiel ein dreizeiliges Eingabefeld mit folgenden Standardeigenschaften erstellt:</p>
    <ul>
      <li>eine vertikale Bildlaufleiste</li>
      <li>automatischer Zeilenumbruch</li>
      <li><kbd>Enter</kbd> erzeugt einen Zeilenumbruch, anstatt die <a href="#DefaultButton">Standard-Schaltfl&auml;che</a> des Fensters auszul&ouml;sen.</li>
    </ul>
    <p>Um eine neue Zeile in einem mehrzeiligen Eingabefeld zu beginnen, f&uuml;gt im letzten Parameter ein Zeilenumbruchszeichen (`n) oder CR+LF (`r`n) ein. Beide Methoden erzeugen  innerhalb des Eingabefeldes direkte CR+LF-Paare (`r`n). Falls das Steuerelement jedoch mit <a href="Gui.htm#Submit">Gui Submit</a> oder <a href="GuiControlGet.htm">GuiControlGet</a> in seine Variable gespeichert wird, wird jedes CR+LF-Paar (`r`n) immer in ein Zeilenumbruchszeichen (`n) umgewandelt. Der Text kann wie folgt in eine Datei geschrieben werden: <code><a href="FileAppend.htm">FileAppend</a>, %EigenesEingabefeld%, C:\Gespeicherte Datei.txt</code>.</p>
    <p>Bei einem Steuerelement mit automatischem Zeilenumbruch (Standard bei mehrzeiligen Eingabefeldern) wird jeder Zeilenumbruch nicht als Zeilenumbruchszeichen interpretiert (nur die Entertaste ist dazu f&auml;hig).</p>
    <p>In Windows 95/98/Me sind mehrzeilige Eingabefelder auf 64 KB Text begrenzt, aber in Windows NT/2k/XP oder h&ouml;her auf ungef&auml;hr 4 GB. Die zugewiesene Speichergr&ouml;&szlig;e passt sich je nach Benutzereingabe an.</p>
    <p>Es ist m&ouml;glich, ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> in den Optionen des Steuerelements anzugeben. Dadurch w&uuml;rde das Label <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer oder das Script den Inhalt des Steuerelements &auml;ndert.</p>
    <p>Um eine Textdatei in ein Eingabefeld zu laden, verwendet <a href="FileRead.htm">FileRead</a> und <a href="GuiControl.htm">GuiControl</a>. Zum Beispiel:</p>
    <pre>Gui, Add, Edit, R20 vEigenesEdit
FileRead, Dateiinhalt, C:\Eigene Datei.txt
GuiControl,, EigenesEdit, %Dateiinhalt%</pre>
    <h3>Optionen</h3>
    <p>Hinweis: Um eine Option stattdessen zu entfernen, setzt ein Minuszeichen davor.</p>
    <strong>Limit</strong>: Beschr&auml;nkt die Benutzereingabe auf die sichtbare Breite des Eingabefeldes. Alternativ kann direkt danach eine Zahl angegeben werden, um die Eingabe auf eine bestimmte Anzahl an Zeichen zu begrenzen. Zum Beispiel w&uuml;rde Limit10 nicht mehr als 10 Zeichen erlauben.
    <p><strong>Lowercase</strong>: Die Zeichen werden bei Benutzereingabe automatisch in Kleinbuchstaben umgewandelt.</p>
    <p id="EditMulti"><strong>Multi</strong>: Erm&ouml;glicht mehrere Textzeilen. Allerdings muss diese Option normalerweise nicht angegeben werden, weil sie automatisch erkannt wird, basierend auf H&ouml;he (H), <a href="Gui.htm#R">Zeilen (R)</a> oder Inhalt (<em>Text</em>).</p>
    <p id="EditNum"><strong>Number</strong>: Hindert den Benutzer daran, etwas anderes als Zahlen in das Feld einzugeben (allerdings ist es noch m&ouml;glich, Nicht-Zahlen von der Zwischenablage einzuf&uuml;gen). Alternativ kann die numerische Eingabe auch erzwungen werden, wenn ein <a href="#UpDown">UpDown</a> ans Eingabefeld angef&uuml;gt wird.</p>
    <p><strong>Password</strong>: Versteckt die Benutzereingabe (z. B. f&uuml;r ein Passwort), indem die eingegebenen Zeichen mit Maskierungszeichen ersetzt werden. Es ist m&ouml;glich, nach dem Wort Password ein benutzerdefiniertes Maskierungszeichen anzugeben. Zum Beispiel wird mit Password* das Standard-Maskierungszeichen (schwarzer Punkt in Windows XP) mit einem Sternchen ersetzt. Hinweis: Diese Option funktioniert nicht bei mehrzeiligen Eingabefeldern.</p>
    <p><strong>ReadOnly</strong>: Hindert den Benutzer daran, den Inhalt des Steuerelements zu &auml;ndern. Der Text kann aber weiterhin gescrollt, markiert und in die Zwischenablage kopiert werden.</p>
    <p><strong>Tn</strong>: Der Buchstabe T kann dazu verwendet werden, Tabstopps innerhalb eines <a href="#EditMulti">mehrzeiligen Eingabefeldes</a> zu setzen (da Tabstopps die Spaltenpositionen bestimmen, zu denen direkte TAB-Zeichen springen werden, k&ouml;nnen sie dazu verwendet werden, den Text in Spalten zu formatieren). Wenn der Buchstabe T nicht verwendet wird, werden die Tabstopps alle 32 Dialogeinheiten (DLU) gesetzt (die Breite jeder Dialogeinheit wird vom Betriebssystem bestimmt). Falls der Buchstabe T nur einmal verwendet wird, werden die Tabstopps auf je <strong>n</strong> Einheiten &uuml;ber die gesamte Breite des Steuerelements verteilt. Zum Beispiel wird mit <code>Gui, Add, Edit, vEigenesEingabefeld r16 t64</code> der Standardabstand zwischen den Tabstopps verdoppelt. Zum Setzen benutzerdefinierter Tabstopps k&ouml;nnte der Buchstabe T wie folgt mehrmals verwendet werden: <code>Gui, Add, Edit, vEigenesEingabefeld r16 t8 t16 t32 t64 t128</code>. Ein Tabstopp ist jeweils eine absolute Spaltenposition in der Liste. Es k&ouml;nnen nur maximal 50 Tabstopps angegeben werden. Hinweis: Tabstopps ben&ouml;tigen ein mehrzeiliges Eingabefeld.</p>
    <p><strong>Uppercase</strong>: Die Zeichen werden bei Benutzereingabe automatisch in Gro&szlig;buchstaben umgewandelt.</p>
    <p><strong>WantCtrlA</strong> <span class="ver">[v1.0.44+]:</span> Mit -WantCtrlA wird der Benutzer daran gehindert, den ganzen Text im Eingabefeld mit <kbd>Strg</kbd>+<kbd>A</kbd> zu markieren.</p>
    <p id="WantReturn"><strong>WantReturn</strong>: Mit -WantReturn ist ein mehrzeiliges Eingabefeld nicht mehr in der Lage, <kbd>Enter</kbd> f&uuml;r sich selbst zu nutzen. Folglich bewirkt das Dr&uuml;cken dieser Taste dann, dass die <a href="#DefaultButton">Standard-Schaltfl&auml;che</a> im Fenster ausgel&ouml;st wird (falls vorhanden). Als &Uuml;bergangsl&ouml;sung k&ouml;nnte der Benutzer <kbd>Strg</kbd>+<kbd>Enter</kbd> dr&uuml;cken, um eine neue Zeile zu beginnen.</p>
    <p><strong>WantTab</strong>: F&uuml;hrt dazu, dass <kbd>Tab</kbd> ein Tabulatorzeichen erzeugt, anstatt das n&auml;chste Steuerelement anzusteuern. Ohne diese Option kann der Benutzer <kbd>Strg</kbd>+<kbd>Tab</kbd> dr&uuml;cken, um ein neues Tabulatorzeichen innerhalb eines mehrzeiligen Eingabefeldes zu erzeugen. Hinweis: Obwohl <em>WantTab</em> auch in einem einzeiligen Eingabefeld funktioniert, werden Tabulatorzeichen als kastenf&ouml;rmige Zeichen dargestellt (die aber weiterhin g&uuml;ltige Tabulatorzeichen sind).</p>
    <p><strong>-Wrap</strong>: Deaktiviert den automatischen Zeilenumbruch in einem mehrzeiligen Eingabefeld. Da dieser Style nach dem Erstellen des Steuerelements nicht mehr ge&auml;ndert werden kann, verwendet eine der folgenden Methoden: </p>
    <ol>
      <li>Das Fenster und die dazugeh&ouml;rigen Steuerelemente <a href="Gui.htm#Destroy">zerst&ouml;ren</a> und danach neu erstellen.</li>
      <li>Zwei &uuml;bereinander liegende Eingabefelder erstellen, bei denen das erste den automatischen Zeilenumbruch aktiviert hat und beim anderen nicht. Dabei bleibt das nicht benutzte Eingabefeld leer und/oder versteckt.</li>
    </ol>
    <p>Siehe <a href="Gui.htm#OtherOptions">allgemeine Optionen</a> f&uuml;r weitere Optionen wie <em>Right</em>, <em>Center</em> und <em>Hidden</em>. Siehe auch: <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
    <p><strong>Eingabefeld mit mehr Funktionen:</strong> HiEdit ist ein frei verf&uuml;gbares Eingabefeld, das unter anderem mehrere Tabs erm&ouml;glicht, gro&szlig;e Dateien &ouml;ffnet und sehr wenig Speicher verbraucht. Es kann sowohl Text- als auch Bin&auml;rdateien bearbeiten. F&uuml;r Details siehe <a href="http://www.autohotkey.com/forum/topic19141.html">Thread von majkinetor</a>.</p>
    <h2 id="UpDown">UpDown</h2>
    <p>Beschreibung: Zwei Pfeiltasten, die der Benutzer dr&uuml;cken kann, um einen Wert zu erh&ouml;hen oder zu verringern. Standardm&auml;&szlig;ig f&uuml;gt sich ein UpDown automatisch an das zuvor hinzugef&uuml;gte Steuerelement an. Dieses vorherige Steuerelement wird auch als <em>Buddy</em> bezeichnet. Das bekannteste Beispiel daf&uuml;r ist der "Spinner" (Drehrad) - ein UpDown, verbunden mit einem <a href="#Edit">Eingabefeld</a>. Zum Beispiel:</p>
    <pre>Gui, Add, Edit
Gui, Add, UpDown, vEigenesUpDown Range1-10, 5</pre>
    <p>Im obigen Beispiel ist das Eingabefeld das Buddy von UpDown. Sobald der Benutzer eine der Pfeiltasten dr&uuml;ckt, wird die Zahl im Eingabefeld automatisch erh&ouml;ht oder verringert.</p>
    <p>Ein Buddy von UpDown kann auch ein <a href="#Text">Textfeld</a> oder <a href="#ListBox">Listenfeld</a> sein. Aufgrund von Einschr&auml;nkungen des Betriebssystems funktionieren alle anderen Steuerelemente (wie Kombinationsfeld oder Dropdownliste) m&ouml;glicherweise nicht richtig mit <a href="Gui.htm#label">g-Labels</a> und anderen Funktionen.</p>
    <p>Die Anfangsposition des UpDowns kann im letzten Parameter angegeben werden (wird dieser weggelassen, beginnt die Position bei 0 oder bei der n&auml;chstm&ouml;glichen Zahl).</p>
    <p>Beim Verwenden des Befehls <a href="Gui.htm#Submit">Gui Submit</a> erh&auml;lt die <a href="Gui.htm#var">zugewiesene Ausgabevariable</a> des Steuerelements (falls vorhanden) die numerische Position von UpDown. Falls das UpDown mit einem Eingabefeld verbunden ist und die G&uuml;ltigkeit der Benutzereingabe irrelevant ist, dann sollte man am besten den Wert vom UpDown verwenden, anstatt den vom Eingabefeld. Das liegt daran, dass das UpDown immer eine Zahl im g&uuml;ltigen Bereich zur&uuml;ckgibt, auch dann, wenn der Benutzer  im Eingabefeld keine Zahl oder eine Zahl au&szlig;erhalb des Bereichs eingegeben hat. Beachtet zudem, dass Zahlen mit mehr als 3 Stellen standardm&auml;&szlig;ig einen <a href="../misc/Styles.htm#UpDownSep">Tausender-Trennzeichen</a> (z. B. Komma) erhalten. Diese Trennzeichen werden in die Ausgabevariable des Eingabefeldes gespeichert, aber nicht in die vom UpDown.</p>
    <p>Falls das UpDown ein <a href="Gui.htm#label">g-Label</a> hat, wird es ausgef&uuml;hrt, sobald der Benutzer eine der Pfeiltasten anklickt oder eine Pfeiltaste auf der Tastatur dr&uuml;ckt. Beim Ausf&uuml;hren des g-Labels wird zudem die UpDown-Position in die <a href="Gui.htm#var">zugewiesene Ausgabevariable</a> gespeichert (falls vorhanden).</p>
    <h3>Optionen</h3>
    <p id="Horz"><strong>Horz</strong>: Die Pfeiltasten zeigen nach links und rechts, anstatt nach oben und unten. Standardm&auml;&szlig;ig wird dabei das Steuerelement vom Buddy getrennt. Dieses Verhalten kann aber mit <em>Horz 16</em> in den Optionen des Steuerelements &uuml;berschrieben werden.</p>
    <p><strong>Left</strong>: Setzt das UpDown an die linke Seite des Buddys, anstatt an die rechte Seite.</p>
    <p><strong>Range</strong>: Bestimmt einen benutzerdefinierten Bereich (standardm&auml;&szlig;ig von 0 bis 100). Nach dem Wort Range erfolgt der Minimalwert, ein Bindestrich und der Maximalwert. Zum Beispiel w&uuml;rde Range1-1000 eine Zahl zwischen 1 und 1000 erlauben, Range-50-50 eine Zahl zwischen -50 und 50 und Range-10--5 eine Zahl zwischen -10 und -5. Die Minimal- und Maximalwerte k&ouml;nnen vertauscht werden, damit die Pfeiltasten in die entgegengesetzte Richtung wirken. Der gr&ouml;&szlig;te zul&auml;ssige Bereich geht von -2147483648 bis 2147483647. Windows 95 und NT4 ben&ouml;tigen jedoch Internet Explorer 5.0 oder h&ouml;her, um einen gr&ouml;&szlig;eren Bereich als -32767 bis 32767 zu unterst&uuml;tzen. Wenn das Buddy eine <a href="#ListBox">ListBox</a> ist, gilt der Standardbereich von 32767 bis 0 f&uuml;r vertikal und umgekehrt f&uuml;r horizontal (<a href="#Horz">Horz</a>).</p>
    <p><strong>Wrap</strong>: Bewirkt, dass das Steuerelement auf das entgegengesetzte Bereichsende springt, falls der Minimal- oder Maximalwert &uuml;berschritten wird. Ohne <em>Wrap</em> stoppt das Steuerelement beim Erreichen des Minimal- oder Maximalwertes.</p>
    <p><strong>-16</strong>: Bewirkt, dass ein vertikales UpDown vom Buddy getrennt wird. Das f&uuml;hrt auch dazu, dass das Steuerelement jede angegebene Breite, H&ouml;he und Position ber&uuml;cksichtigt, anstatt sich nach der Gr&ouml;&szlig;e des Buddys zu richten. Dar&uuml;ber hinaus merkt sich ein isoliertes UpDown intern die eigene Position. Diese Position kann beispielsweise mit <a href="Gui.htm#Submit">Gui Submit</a> ermittelt werden.</p>
    <p id="UpDownSep"><strong>0x80</strong>: Mit 0x80 in den <em>Optionen</em> werden die Tausender-Trennzeichen weggelassen, die jeweils zwischen drei Dezimalstellen im Buddy vorkommen. Normalerweise wird dieser Style nicht verwendet, weil die Trennzeichen weggelassen werden, sobald die Zahl vom UpDown selbst abgerufen wird (statt vom Buddy).</p>
    <p><strong>Beliebige Schrittweite</strong>: In <a href="http://numeric.nerim.net/AutoHotkey/Scripts/UpDown%20-%20Non-unitary%20increments.ahk">diesem Script</a> von NumEric wird deutlich, wie die UpDown-Schrittweite ge&auml;ndert werden kann (z. B. 5 oder 0.1).</p>
    <p>Siehe auch: <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
    <h2 id="Picture">Picture (oder Pic)</h2>
    <p>Beschreibung: Ein Bereich, in dem ein Bild angezeigt wird (siehe die letzten beiden Abs&auml;tze f&uuml;r unterst&uuml;tzte Dateitypen). Der letzte Parameter ist der Dateiname des Bildes, das sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis befindet, falls kein absoluter Pfad angegeben ist.</p>
    <pre>Beispiel: Gui, Add, Picture, w300 h-1, C:\Eigene Bilder\Firmenlogo.gif</pre>
    <p>Um die aktuelle Breite und/oder H&ouml;he des Bildes zu erhalten, lasst die Optionen W und/oder H weg. Ansonsten wird das Bild auf die angegebene Breite und/oder H&ouml;he skaliert (diese Breite und H&ouml;he bestimmt auch, welches Icon aus einer ICO-Datei, das mehrere Icons enth&auml;lt, geladen wird). Um das Bild unter Beibehaltung des Seitenverh&auml;ltnisses zu verkleinern oder zu vergr&ouml;&szlig;ern, verwendet -1 bei einer Abmessung und eine positive Zahl bei der anderen. Zum Beispiel w&uuml;rde mit "w200 h-1" das Bild 200 Pixel breit gemacht und dessen H&ouml;he automatisch gesetzt werden. Sobald das Bild nicht geladen oder angezeigt werden kann (z. B. Datei nicht gefunden), wird das Steuerelement leer gelassen und die Breite und H&ouml;he auf 0 gesetzt.</p>
    <p>Es ist m&ouml;glich, ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> in den Optionen des Steuerelements anzugeben. Dadurch w&uuml;rde das Label <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer das Bild anklickt. Ein Doppelklick kann erkannt werden, wenn &uuml;berpr&uuml;ft wird, ob <a href="../Variables.htm#GuiEvent">A_GuiEvent</a> das Wort DoubleClick enth&auml;lt.</p>
    <p>Um ein Bild als Hintergrund bei anderen Steuerelementen zu verwenden, sollte es normalerweise vor diesen Steuerelementen eingef&uuml;gt werden. Wenn diese Steuerelemente allerdings eingabef&auml;hig sind und das Bild ein <a href="Gui.htm#label">g-Label</a> hat, sollte das Bild erst nach diesen Steuerelementen erstellt und 0x4000000 (WS_CLIPSIBLINGS) in den <em>Optionen</em> von Picture eingef&uuml;gt werden. Mit diesem Trick kann das Bild auch der Hintergrund eines <a href="#Tab">Tab</a>- oder <a href="ListView.htm">ListView</a>-Steuerelements sein.</p>
    <p><strong>Icon, Cursor und animierte Cursor</strong>: Icon und Cursor k&ouml;nnen von folgenden Dateitypen geladen werden: ICO, CUR, ANI, EXE, DLL, CPL, SCR und andere Typen, die Icon-Ressourcen enthalten. Um anstelle der ersten Icon-Gruppe eine andere zu verwenden, f&uuml;gt in den <em>Optionen</em> das Wort Icon und danach die Gruppennummer ein. Im folgenden Beispiel wird das Standard-Icon aus der zweiten Icon-Gruppe verwendet: <code>Gui, Add, Picture, Icon2, C:\Eigene Anwendung.exe</code>.</p>
    <p id="PicAltSubmit">Das Wort AltSubmit in den <em>Optionen</em> teilt dem Programm mit, zum Laden des Bildes die Microsoft-Datei GDIPlus.dll zu verwenden. Das k&ouml;nnte dazu f&uuml;hren, dass GIF-, BMP- und Icon-Bilder anders dargestellt werden. Zum Beispiel k&ouml;nnte dadurch mithilfe von <a href="Gui.htm#BackgroundTrans">BackgroundTrans</a> der transparente Hintergrund eines ICO/GIF-Bildes wirksam gemacht werden. Wenn GDIPlus nicht verf&uuml;gbar ist (siehe n&auml;chster Absatz), wird AltSubmit ignoriert und das Bild mit der normalen Methode geladen.</p>
    <p>Alle Betriebssysteme unterst&uuml;tzen GIF, JPG, BMP, ICO, CUR und ANI. In Windows XP (oder h&ouml;her) werden zus&auml;tzliche Bildformate wie PNG, TIF, Exif, WMF und EMF unterst&uuml;tzt. Zur Unterst&uuml;tzung von Betriebssystemen &auml;lter als XP kann die frei verf&uuml;gbare GDIPlus.dll von Microsoft in den AutoHotkey-Ordner kopiert werden (bei <a href="../Scripts.htm#ahk2exe">kompilierten Scripts</a> muss diese Datei jedoch in den Ordner des Scripts kopiert werden). Um diese Datei herunterzuladen, sucht mit Begriffen wie "gdi redistributable" auf&nbsp;<a href="http://www.microsoft.com">www.microsoft.com</a>.</p>
    <p>In Windows 95/98/Me verursachen animierte Cursor gr&ouml;&szlig;er als 90x90 einen Absturz des Scripts.</p>
    <p><strong>Animierte GIF-Bilder</strong>: Animierte GIF-Dateien werden zwar in einem Bild-Steuerelement angezeigt, aber nicht animiert. Zur L&ouml;sung dieses Problems kann die AniGIF.dll verwendet werden (frei verf&uuml;gbar, solange sie nicht kommerziell genutzt wird). Siehe dazu "<a href="http://www.autohotkey.com/forum/topic19264.html">Show animated Gifs in your GUI</a>".</p>
    <h2 id="Button">Button</h2>
    <p>Beschreibung: Eine Schaltfl&auml;che, die gedr&uuml;ckt werden kann, um eine Aktion auszul&ouml;sen.  In diesem Fall ist der letzte Parameter der Name der Schaltfl&auml;che (auf der Schaltfl&auml;che selbst angezeigt), der LF-Zeichen (`n) enthalten kann, um neue Zeilen zu beginnen.</p>
    <pre>Beispiel: Gui, Add, Button, Default, OK</pre>
    <p id="DefaultButton">Das obige Beispiel enth&auml;lt das Wort Default in den <em>Optionen</em>, um das "OK" als Standard-Schaltfl&auml;che zu definieren. Die Aktion der Standard-Schaltfl&auml;che wird automatisch ausgel&ouml;st, sobald der Benutzer <kbd>Enter</kbd> dr&uuml;ckt, sofern der Tastaturfokus nicht auf einer anderen Schaltfl&auml;che oder auf ein mehrzeiliges Eingabefeld mit aktiviertem <a href="#WantReturn">WantReturn</a>-Style liegt. Die Standard-Schaltfl&auml;che kann jederzeit gewechselt werden, wenn wie folgt vorgegangen wird: <code><a href="GuiControl.htm">GuiControl</a>, +default, Cancel</code>. Diese Eigenschaft kann sp&auml;ter wieder wie folgt entfernt werden: <code>GuiControl, -default, OK</code>.</p>
    <p>Falls der Name der Schaltfl&auml;che ein Und-Zeichen (&amp;) enth&auml;lt, wird der nachfolgende Buchstabe unterstrichen. Zum Beispiel:</p>
    <pre>Gui, Add, Button,, &amp;Pause</pre>
    <p>Im obigen Beispiel wird der Buchstabe P unterstrichen, dass dem Benutzer erlaubt, <kbd>Alt</kbd>+<kbd>P</kbd> als <a href="Gui.htm#ShortcutKey">Tastenk&uuml;rzel</a> zu verwenden. Um dieses Und-Zeichen stattdessen direkt anzuzeigen, verwendet zwei aufeinanderfolgende Und-Zeichen (&amp;&amp;).</p>
    <p>Sollte der Schaltfl&auml;che ein <a href="Gui.htm#label">g-Label</a> fehlen, wird ihr automatisch ein Label zugewiesen. Wenn zum Beispiel das erste GUI-Fenster eine OK-Schaltfl&auml;che enth&auml;lt, wird das ButtonOK-Label (falls vorhanden) ausgef&uuml;hrt, sobald die Schaltfl&auml;che gedr&uuml;ckt wird. <a href="Gui.htm#MultiWin">Abgesehen vom ersten GUI-Fenster</a> werden bei anderen GUI-Fenstern deren Nummer vor dem Label angef&uuml;gt, wie zum Beispiel 2ButtonOK.</p>
    <p>Wenn der Text auf der Schaltfl&auml;che Leerzeichen, <code>&amp;</code>, <code>`r</code>, <code>`n</code>, <code>`t</code> oder <code>`</code> enth&auml;lt, werden diese automatisch beim dazugeh&ouml;rigen Label weggelassen. Zum Beispiel w&uuml;rde der Schaltfl&auml;che mit der Bezeichnung "&amp;Pause" automatisch das Label ButtonPause zugewiesen. Ebenso w&uuml;rde der Schaltfl&auml;che mit dem Namen "Speichern &amp;&amp; Beenden" das Label ButtonSpeichernBeenden bereitgestellt (das Und-Zeichen-Paar wird dazu verwendet, ein Und-Zeichen direkt anzuzeigen).</p>
    <p>Bekannte Einschr&auml;nkung: Es ist m&ouml;glich, dass bestimmte Desktop-Designs den Text einer Schaltfl&auml;che nicht richtig darstellen. Daher k&ouml;nnte die Option <em>-Wrap</em> dabei helfen, dieses Problem zu umgehen.&nbsp;Allerdings ist dadurch der Text nicht l&auml;nger mehrzeilig.</p>
    <h2 id="Checkbox">CheckBox</h2>
    <p>Beschreibung: Ein Kontrollk&auml;stchen, in der eine Markierung gesetzt oder entfernt werden kann, um An/Aus, Ja/Nein und so weiter darzustellen.</p>
    <pre>Beispiel: Gui, Add, Checkbox, vSendenAnRechnungsadresse, An Rechnungsadresse senden?</pre>
    <p>Der letzte Parameter ist eine Bezeichnung, die neben dem K&auml;stchen angezeigt wird. Diese Bezeichnung dient normalerweise als Abfrage, oder beschreibt die Funktionsweise des Kontrollk&auml;stchens n&auml;her. Es k&ouml;nnen LF-Zeichen (`n) enthalten sein, um neue Zeilen zu beginnen. Wenn eine Breite (W) in den <em>Optionen</em> angegeben ist, aber keine <a href="Gui.htm#R">Zeilen (R)</a> oder H&ouml;he (H), wird der Text des Steuerelements je nach Bedarf umbrochen und dessen H&ouml;he automatisch gesetzt. Die <a href="Gui.htm#var">zugewiesene Ausgabevariable</a> des Kontrollk&auml;stchen (falls vorhanden) erh&auml;lt eine 1 f&uuml;r markiert, 0 f&uuml;r nicht markiert, und -1 f&uuml;r grau/unbestimmt.</p>
    <p>Mit dem Wort Check3 in den <em>Optionen</em> wird der dritte Status aktiviert, um anstelle des schwarzen ein graues H&auml;kchen anzuzeigen (dieser Status zeigt an, dass die Markierung des Kontrollk&auml;stchens weder gesetzt noch entfernt wurde). Mit dem Wort Checked oder CheckedGray in den <em>Optionen</em> hat das Kontrollk&auml;stchen anfangs jeweils ein schwarzes oder graues H&auml;kchen. Nach dem Wort Checked kann optional eine 0, 1 oder -1 f&uuml;r den Anfangsstatus angegeben werden. Das hei&szlig;t, dass "Checked" und "Checked%VarMitEins%" identisch sind.</p>
    <p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Diese Option bewirkt, dass <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt wird, sobald der Benutzer das Kontrollk&auml;stchen anklickt oder &auml;ndert.</p>
    <p>Bekannte Einschr&auml;nkung: Es ist m&ouml;glich, dass bestimmte Desktop-Designs die Bezeichnung nicht richtig darstellen. Daher k&ouml;nnte die Option <em>-Wrap</em> dabei helfen, dieses Problem zu umgehen.&nbsp;Allerdings ist dadurch der Text nicht l&auml;nger mehrzeilig.</p>
    <h2 id="Radio">Radio</h2>
    <p>Beschreibung: Ein Optionsfeld in Form eines kleinen leeren Kreises, in der eine Markierung gesetzt (An) oder entfernt (Aus) werden kann.</p>
    <pre>Beispiel: Gui, Add, Radio, vEigeneRadioGruppe, Warten, bis alle Artikel auf Lager sind, bevor sie abgeschickt werden.</pre>
    <p>Diese Steuerelemente befinden sich f&uuml;r gew&ouml;hnlich in <em>Optionsfeldgruppen</em>, bestehend aus 2 oder mehr Optionsfelder. Sobald der Benutzer ein Optionsfeld anklickt, um es zu aktivieren, werden alle anderen Optionsfelder in der Gruppe automatisch deaktiviert (innerhalb einer Gruppe kann der Benutzer au&szlig;erdem mit Pfeiltasten navigieren). Eine Optionsfeldgruppe wird automatisch um alle hintereinander hinzugef&uuml;gten Optionsfelder erstellt. Um eine neue Gruppe zu beginnen, verwendet das Wort Group in den <em>Optionen</em> des ersten Optionsfeldes - oder f&uuml;gt dazwischen einfach ein anderes Steuerelement ein, dass automatisch eine neue Gruppe startet.</p>
    <p>Der letzte Parameter ist eine Bezeichnung, die neben dem Optionsfeld angezeigt wird. Diese Bezeichnung dient normalerweise als Abfrage, oder beschreibt die Funktionsweise des Kontrollk&auml;stchens n&auml;her.  Es k&ouml;nnen LF-Zeichen (`n) enthalten sein, um neue Zeilen zu beginnen. Wenn eine Breite (W) in den <em>Optionen</em> angegeben ist, aber keine Zeilen (R) oder H&ouml;he (H), wird der Text des Steuerelements je nach Bedarf umbrochen und dessen H&ouml;he automatisch gesetzt.</p>
    <p>Mit dem Wort Checked in den <em>Optionen</em> wird die Schaltfl&auml;che anfangs aktiviert. Nach dem Wort Checked kann optional eine 0 oder 1 f&uuml;r den Anfangsstatus angegeben werden: 0 f&uuml;r markiert und 1 f&uuml;r nicht markiert. Das hei&szlig;t, dass "Checked" und "Checked%VarMitEins%" identisch sind.</p>
    <p>Die <a href="Gui.htm#var">zugewiesene Ausgabevariable</a> des Optionsfeldes (falls vorhanden) erh&auml;lt eine 1 f&uuml;r markiert und 0 f&uuml;r nicht markiert. Wenn jedoch nur ein Optionsfeld in einer Optionsfeldgruppe eine Variable hat, wird in dieser Variable stattdessen die Nummer des aktuell ausgew&auml;hlten Optionsfeldes gespeichert, dabei steht die 1 f&uuml;r das erste Optionsfeld (gem&auml;&szlig; der originalen Erstellungsreihenfolge), 2 f&uuml;r das zweite und so weiter. Sollte kein Optionsfeld markiert sein, wird 0 gespeichert.</p>
    <p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Diese Option bewirkt, dass <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt wird, sobald der Benutzer das Optionsfeld aktiviert. Im Gegensatz zum Einzelvariablenmodus vom vorherigen Abschnitt muss das g-Label f&uuml;r jedes Optionsfeld in einer Gruppe angegeben werden. Dadurch wird die Flexibilit&auml;t gew&auml;hrleistet, das Anklicken von bestimmten Optionsfeldern zu ignorieren. Ein Doppelklick kann erkannt werden, wenn &uuml;berpr&uuml;ft wird, ob <a href="../Variables.htm#GuiEvent">A_GuiEvent</a> das Wort DoubleClick enth&auml;lt.</p>
    <p>Bekannte Einschr&auml;nkung: Es ist m&ouml;glich, dass bestimmte Desktop-Designs die Bezeichnung nicht richtig darstellen. Daher k&ouml;nnte die Option <em>-Wrap</em> dabei helfen, dieses Problem zu umgehen.&nbsp;Allerdings ist dadurch der Text nicht l&auml;nger mehrzeilig.</p>
    <h2 id="DropDownList">DropDownList (oder DDL)</h2>
    <p>Beschreibung: Eine Auswahlliste, die angezeigt wird, wenn eine kleine Schaltfl&auml;che gedr&uuml;ckt wird.  In diesem Fall ist der letzte Parameter eine Auswahlliste, deren Eintr&auml;ge durch senkrechte Striche getrennt sind.</p>
    <pre>Beispiel: Gui, Add, DropDownList, vFarbauswahl, Schwarz|Wei&szlig;|Rot|Gr&uuml;n|Blau</pre>
    <p>Damit einer der Eintr&auml;ge beim erstmaligen Anzeigen des Fensters vorausgew&auml;hlt ist, f&uuml;gt nach diesem Eintrag zwei senkrechte Striche an (z. B. Rot|Gr&uuml;n||Blau). Alternativ kann mit dem Wort Choose in den <em>Optionen</em>, unmittelbar gefolgt von der Nummer, ein Eintrag auch vorausgew&auml;hlt werden. Zum Beispiel w&uuml;rde mit Choose5 der f&uuml;nfte Eintrag vorausgew&auml;hlt (wie bei anderen Optionen kann hierbei auch eine Variable angegeben werden, zum Beispiel Choose%Var%). Mit <a href="GuiControl.htm">GuiControl</a> k&ouml;nnen Eintr&auml;ge in der Auswahlliste nachtr&auml;glich ge&auml;ndert oder hinzugef&uuml;gt bzw. entfernt werden.</p>
    <p>Mit dem Wort Uppercase oder Lowercase in den <em>Optionen</em> werden alle Eintr&auml;ge in der Liste jeweils automatisch in Gro&szlig;- oder Kleinbuchstaben umgewandelt. Mit dem Wort Sort wird der Inhalt der Liste automatisch alphabetisch sortiert (das auch Auswirkung auf sp&auml;ter hinzugef&uuml;gte Eintr&auml;ge mittels <a href="GuiControl.htm">GuiControl</a> hat). Diese Option aktiviert zudem die inkrementelle Suche, sobald die Liste aufgeklappt wird. Das hei&szlig;t, dass ein Eintrag ausgew&auml;hlt wird, sobald die ersten Zeichen des Namens eingegeben werden.</p>
    <p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, wird in der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) der Text des zurzeit ausgew&auml;hlten Eintrags gespeichert. Falls das Steuerelement allerdings die <a href="Gui.htm#AltSubmit">AltSubmit</a>-Eigenschaft hat, wird die Ausgabevariable stattdessen die Positionsnummer des Eintrags enthalten (der erste Eintrag ist 1, der zweite 2 und so weiter).</p>
    <p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Diese Option bewirkt, dass <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt wird, sobald der Benutzer einen neuen Eintrag ausw&auml;hlt.</p>
    <p>Mit der <a href="Gui.htm#R">R- oder H-Option</a> kann die H&ouml;he der Aufklappliste bestimmt werden. Zum Beispiel wird mit R5 die Liste 5 Zeilen hoch gemacht. Wenn sowohl R als auch H weggelassen wird, erweitert sich die Liste automatisch, um die Vorteile der verf&uuml;gbaren Desktoph&ouml;he des Benutzers zu &uuml;bernehmen (allerdings zeigen Betriebssysteme &auml;lter als Windows XP standardm&auml;&szlig;ig 3 Zeilen).</p>
    <p>Das Trennzeichen zwischen den Feldern muss nicht zwingend ein senkrechter Strich sein. Zum Beispiel kann das Trennzeichen mit <code>Gui +<a href="Gui.htm#Delimiter">Delimiter</a>`n</code> in ein Zeilenumbruchszeichen und mit <code>Gui +DelimiterTab</code> in ein Tabulatorzeichen (`t) ge&auml;ndert werden.</p>
    <h2 id="ComboBox">ComboBox</h2>
    <p>Beschreibung: Ein Kombinationsfeld, &auml;hnlich wie die Dropdownliste, aber mit dem Unterschied, dass alternativ auch Text eingegeben werden kann.</p>
    <pre>Beispiel: Gui, Add, ComboBox, vFarbauswahl, Rot|Gr&uuml;n|Blau|Schwarz|Wei&szlig;</pre>
    <p>Neben den bereits oben genannten Optionen kann auch das Wort Limit in den <em>Optionen</em> angegeben werden, um die Benutzereingabe auf die sichtbare Breite des Eingabefeldes zu beschr&auml;nken. Zudem kann das Wort Simple hinzugef&uuml;gt werden, damit sich das Kombinationsfeld so verh&auml;lt, als w&auml;re es ein Eingabefeld mit einem Listenfeld darunter.</p>
    <p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, wird in der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) der Text des zurzeit ausgew&auml;hlten Eintrags gespeichert. Falls das Steuerelement allerdings die <a href="Gui.htm#AltSubmit">AltSubmit</a>-Eigenschaft
      hat, wird die Ausgabevariable stattdessen die Positionsnummer des 
      Eintrags enthalten (der erste Eintrag ist 1, der zweite 2 und so 
      weiter). Ist ansonsten kein Eintrag ausgew&auml;hlt, enth&auml;lt die Ausgabevariable den Inhalt vom Eingabefeld des Kombinationsfeldes.</p>
    <p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Diese Option bewirkt, dass <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt wird, sobald der Benutzer einen neuen Eintrag ausw&auml;hlt.</p>
    <h2 id="ListBox">ListBox</h2>
    <p>Beschreibung: Ein relativ hohes Listenfeld, das mehrere Auswahlm&ouml;glichkeiten enth&auml;lt. In diesem Fall ist der letzte Parameter eine Auswahlliste, deren Eintr&auml;ge durch senkrechte Striche getrennt sind.</p>
    <pre>Beispiel: Gui, Add, ListBox, vColorChoice, Rot|Gr&uuml;n|Blau|Schwarz|Wei&szlig;</pre>
    <p id="ChooseLB">Damit beliebig viele der Eintr&auml;ge beim erstmaligen Anzeigen des Fensters 
      vorausgew&auml;hlt sind, f&uuml;gt nach jedem Eintrag zwei senkrechte Striche an (ben&ouml;tigt die <a href="#ListBoxMulti">Multi</a>-Option, falls mehrere Eintr&auml;ge vorausgew&auml;hlt werden sollen) Alternativ kann mit dem Wort Choose in den <em>Optionen</em>, unmittelbar gefolgt von der Nummer, ein Eintrag auch vorausgew&auml;hlt werden. Zum Beispiel wird mit Choose5 der f&uuml;nfte Eintrag vorausgew&auml;hlt. Mit <a href="GuiControl.htm">GuiControl</a> k&ouml;nnen Eintr&auml;ge in der Auswahlliste nachtr&auml;glich ge&auml;ndert oder hinzugef&uuml;gt bzw. entfernt werden.</p>
    <p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, wird in der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) der Text des zurzeit ausgew&auml;hlten Eintrags gespeichert. Falls das Steuerelement allerdings die <a href="Gui.htm#AltSubmit">AltSubmit</a>-Eigenschaft
      hat, wird die Ausgabevariable stattdessen die Positionsnummer des Eintrags enthalten (der erste Eintrag ist 1, der zweite 2 und so 
      weiter).</p>
    <p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Diese Option bewirkt, dass <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt wird, sobald der Benutzer einen neuen Eintrag ausw&auml;hlt. Klickt der Benutzer zweimal auf einen Eintrag, enth&auml;lt die interne Variable A_GuiEvent den String DoubleClick, anstatt den String Normal. Au&szlig;erdem wird in die Variable A_EventInfo die Positionsnummer des Eintrags gespeichert, das zweimal angeklickt wurde (1 ist der erste Eintrag, 2 der zweite und so weiter).</p>
    <p id="LBRedraw">Die Performance kann beim Einf&uuml;gen vieler Eintr&auml;ge verbessert werden, wenn vor der Operation <code>GuiControl, -Redraw, EigenesListenfeld</code> und nach Operation <code>GuiControl, +Redraw, EigenesListenfeld</code> verwendet wird.</p>
    <h3>Optionen</h3>
    <p><strong>Choose</strong>: Siehe <a href="#ChooseLB">oben</a>.</p>
    <p id="ListBoxMulti"><strong>Multi</strong>: Erm&ouml;glicht die Auswahl mehrerer Eintr&auml;ge mittels <kbd>Umschalt</kbd>+Klick und <kbd>Strg</kbd>+Klick (wird stattdessen die <a href="../misc/Styles.htm#LBS_MULTI">Nummer 8</a> in den Optionen verwendet, k&ouml;nnen mehrere Eintr&auml;ge ohne Modifikatortasten markiert werden). In diesem Fall speichert <a href="Gui.htm#Submit">Gui Submit</a> eine Liste mit Eintr&auml;gen, getrennt durch senkrechte Striche, in die <a href="Gui.htm#var">Ausgangsvariable</a> des Steuerelements. Wenn jedoch die Option <a href="Gui.htm#AltSubmit">AltSubmit</a> aktiv ist, speichert <a href="Gui.htm#Submit">Gui Submit</a> stattdessen eine Liste mit Eintragsnummern, getrennt durch senkrechte Striche. Zum Beispiel w&uuml;rde 1|2|3 bedeuten, dass die ersten drei Eintr&auml;ge ausgew&auml;hlt sind. Um die Eintr&auml;ge einzeln aus den String zu extrahieren, verwendet eine <a href="LoopParse.htm">Parsing-Schleife</a> wie folgt:</p>
    <pre>Loop, Parse, EigenesListenfeld, |
{
    MsgBox Auswahlnummer %A_Index% ist %A_LoopField%.
}</pre>
    <p>Das Trennzeichen zwischen den Feldern muss nicht zwingend ein senkrechter Strich sein. Zum Beispiel kann das Trennzeichen mit <code>Gui +<a href="Gui.htm#Delimiter">Delimiter</a>`n</code> in ein Zeilenumbruchszeichen und mit <code>Gui +DelimiterTab</code> in ein Tabulatorzeichen (`t) ge&auml;ndert werden.</p>
    <p><strong>ReadOnly</strong>: Verhindert, dass die Eintr&auml;ge beim Markieren sichtbar hervorgehoben werden (<a href="Gui.htm#Submit">Gui Submit</a> speichert aber weiterhin den ausgew&auml;hlten Eintrag).</p>
    <p><strong>Sort</strong>: Sortiert automatisch den Inhalt der Liste in alphabetischer Reihenfolge (das auch Auswirkung auf sp&auml;ter hinzugef&uuml;gte Eintr&auml;ge mittels <a href="GuiControl.htm">GuiControl</a> hat). Diese Option aktiviert zudem die inkrementelle Suche. Das hei&szlig;t, dass ein Eintrag ausgew&auml;hlt wird, sobald 
      die ersten Zeichen des Namens eingegeben werden.</p>
    <p><strong>Tn</strong>: Mit dem Buchstaben T k&ouml;nnen Tabstopps gesetzt werden, um den Text in Spalten aufzuteilen. Wenn der Buchstabe T nicht verwendet wird, werden die Tabstopps alle 32 Dialogeinheiten (DLU) gesetzt (die Breite jeder Dialogeinheit wird vom Betriebssystem bestimmt). Falls der Buchstabe T nur einmal verwendet wird, werden die Tabstopps auf je <strong>n</strong> Einheiten &uuml;ber die gesamte Breite des Steuerelements verteilt. Zum Beispiel wird mit <code>Gui, Add, ListBox, vEigenesListenfeld t64</code> der Standardabstand zwischen den Tabstopps verdoppelt. Zum Setzen benutzerdefinierter Tabstopps k&ouml;nnte der Buchstabe T wie folgt mehrmals verwendet werden: <code>Gui, Add, ListBox, vEigenesListenfeld t8 t16 t32 t64 t128</code>. Ein Tabstopp ist jeweils eine absolute Spaltenposition in der Liste. Es k&ouml;nnen nur maximal 50 Tabstopps angegeben werden.</p>
    <p><strong>0x100</strong>: F&uuml;gt 0x100 in den <i>Optionen</i> ein, um den Style LBS_NOINTEGRALHEIGHT zu aktivieren. Dadurch muss das Listenfeld exakt in der angegebenen H&ouml;he sein, anstatt zu gew&auml;hrleisten, dass die Zeile am unteren Rand angezeigt wird. Zudem verhindert diese Option, dass das Listenfeld beim &Auml;ndern der Schrift kleiner wird.</p>
    <p>Um die Anzahl der Textzeilen zu bestimmen (oder die H&ouml;he und Breite), siehe <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
    <h2>ListView und TreeView</h2>
    <p>Siehe separate Seiten f&uuml;r <a href="ListView.htm">ListView</a> und <a href="TreeView.htm">TreeView</a>.</p>
    <h2 id="Link">Link</h2>
    <p>Beschreibung: Ein Textfeld, das anklickbare Links enthalten kann. Link-Steuerelemente verwenden die HTML-Sprache (Hypertext Markup Language), von der jedoch nur das A-Tag unterst&uuml;tzt wird. Innerhalb des &ouml;ffnenden Tags kann ein Attribut im Format Attribut="Wert" angegeben werden. Normalerweise wird hierbei ein ID- oder HREF-Attribut verwendet, zum Beispiel:</p>
    <pre>Beispiel: Gui, Add, Link,, Das ist ein &lt;a href="http://de.autohotkey.com"&gt;Link&lt;/a&gt;
Beispiel: Gui, Add, Link,, Links k&ouml;nnen &uuml;berall im Text angegeben werden, wie beispielsweise &lt;a id="1"&gt;hier&lt;/a&gt; oder &lt;a id="2"&gt;dort&lt;/a&gt;</pre>
    <p>Das Anklicken eines Links wird automatisch bearbeitet, falls das HREF-Attribut gesetzt wurde und ausf&uuml;hrbar ist (z. B. eine URL oder ein Befehl). Wenn das HREF-Attribut nicht verwendet wird oder ausf&uuml;hrbar ist, k&ouml;nnte ein bereitgestelltes <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> ausgef&uuml;hrt werden. In diesem Fall enth&auml;lt <a href="../misc/ErrorLevel.htm">ErrorLevel</a> den Attributswert, damit der angeklickte Link identifiziert werden kann.</p>
    <h2 id="Hotkey">Hotkey</h2>
    <p>Beschreibung: Sieht wie ein einzeiliges Eingabefeld aus, das aber nur eine gedr&uuml;ckte Tastenkombination vom Benutzer akzeptiert. Wenn der Benutzer zum Beispiel <kbd>Strg</kbd>+<kbd>Alt</kbd>+<kbd>C</kbd> auf einer deutschen Tastaturbelegung dr&uuml;ckt, erscheint im Feld "STRG + ALT + C".</p>
    <pre>Beispiel: Gui, Add, Hotkey, vGew&auml;hlterHotkey</pre>
    <p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, wird in der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) die Modifikatoren und der Name des Hotkeys gespeichert, die kompatibel mit dem <a href="Hotkey.htm">Hotkey</a>-Befehl sind. Beispiele: ^!C, +!Home, +^Down, ^Numpad1, !NumpadEnd. Falls kein Hotkey im Steuerelement zu sehen ist, wird die Ausgabevariable leer gemacht. Hinweis: Einige angezeigten Tasten zeigen das Gleiche an, obwohl sie unterschiedliche Namen haben. Zum Beispiel wird sowohl ^Numpad7 als auch ^NumpadHome als "STRG + 7 (ZEHNERTASTATUR)" angezeigt.</p>
    <p>Standardm&auml;&szlig;ig ist das Steuerelement anfangs leer. Um das zu &auml;ndern, kann im letzten Parameter ein Hotkey angegeben werden, mit oder ohne Modifikatoren. Zum Beispiel: <code>Gui, Add, Hotkey, vGew&auml;hlterHotkey, ^!p</code>.<br>
      Es werden nur die Modifikatoren ^ (Strg), ! (Alt) und + (Umschalt) unterst&uuml;tzt. In der <a href="../KeyList.htm">Tastenliste</a> k&ouml;nnen die verf&uuml;gbaren Tasten eingesehen werden.</p>
    <p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Diese Option bewirkt, dass <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt wird, sobald der Benutzer den Hotkey &auml;ndert. Zudem wird jedes mal, wenn das g-Label ausgef&uuml;hrt wird, der Hotkey in die <a href="Gui.htm#var">zugewiesene Ausgabevariable</a> gespeichert (falls vorhanden). Hinweis: Das g-Label wird auch dann ausgef&uuml;hrt, wenn ein unvollst&auml;ndiger Hotkey vorhanden ist. Sobald der Benutzer beispielsweise <kbd>Strg</kbd> gedr&uuml;ckt h&auml;lt, wird das g-Label ausgef&uuml;hrt und ein Zirkumflex (^) in die Ausgabevariable gespeichert. Wenn der Benutzer dann die Tastenkombination vollendet, wird das g-Label nochmals ausgef&uuml;hrt und der vollst&auml;ndige Hotkey in die Variable gespeichert.</p>
    <p>Um die Benutzereingabe auf bestimmte Hotkeys zu beschr&auml;nken, f&uuml;gt nach dem Wort Limit die Summe folgender Zahlen an:</p>
    <table class="info" style="width: 436px;">
      <tr>
        <td>1</td>
        <td>Tasten ohne Modifikatoren ignorieren</td>
      </tr>
      <tr>
        <td>2</td>
        <td><kbd>Umschalt</kbd>+Tasten ignorieren</td>
      </tr>
      <tr>
        <td>4</td>
        <td><kbd>Strg</kbd>+Tasten ignorieren</td>
      </tr>
      <tr>
        <td>8</td>
        <td><kbd>Alt</kbd>+Tasten ignorieren</td>
      </tr>
      <tr>
        <td>16</td>
        <td><kbd>Umschalt</kbd>+<kbd>Strg</kbd>+Tasten ignorieren</td>
      </tr>
      <tr>
        <td>32</td>
        <td><kbd>Umschalt</kbd>+<kbd>Alt</kbd>+Tasten ignorieren</td>
      </tr>
      <tr>
        <td>64</td>
        <td>Dieser Wert wird nicht unterst&uuml;tzt (verh&auml;lt sich falsch)</td>
      </tr>
      <tr>
        <td>128</td>
        <td><kbd>Umschalt</kbd>+<kbd>Strg</kbd>+<kbd>Alt</kbd>+Tasten ignorieren</td>
      </tr>
    </table>
    <p>Zum Beispiel wird mit Limit1 verhindert, dass Hotkeys ohne Modifikatoren wie Buchstaben und Zahlen eingegeben werden k&ouml;nnen. Ebenso wird mit Limit15 die Anforderung gestellt, mindestens zwei Modifikatortasten einzugeben. Sollte der Benutzer eine verbotene Modifikator-Kombination eingeben, wird diese automatisch und sichtbar mit "STRG + ALT" ersetzt.</p>
    <p>Das Hotkey-Steuerelement hat nur begrenzte M&ouml;glichkeiten. Zum Beispiel werden Maus/Joystick-Hotkeys oder Windows-Tasten (LWin und RWin) nicht unterst&uuml;tzt. Dieses Problem kann zum Beispiel umgangen werden, wenn eine oder mehrere <a href="GuiControls.htm#CheckBox">Kontrollk&auml;stchen</a> bereitgestellt werden, die zus&auml;tzliche Modifikatoren anbieten.</p>
    <h2 id="DateTime">DateTime</h2>
    <p>Beschreibung: Sieht wie ein einzeiliges Eingabefeld aus, das aber nur die Eingabe von Datum und/oder Zeit akzeptiert. Ein ausklappbarer Kalender ist ebenfalls vorhanden.</p>
    <pre>Beispiel: Gui, Add, DateTime, vEigenesDateTime, LongDate</pre>
    <p id="DateTimeFormat">Der letzte Parameter kann eine der folgenden Angaben enthalten:</p>
    <p><strong>(nicht vorhanden)</strong>: Beim Weglassen wird das kurze Datumsformat verwendet, abh&auml;ngig vom aktuellen Gebietsschema des Benutzers. Bei einigen Gebietsschemen k&ouml;nnte das wie folgt aussehen: 17.04.2011.</p>
    <p><strong>LongDate</strong>: Verwendet das lange Datumsformat, abh&auml;ngig vom aktuellen Gebietsschema des Benutzers. Bei einigen Gebietsschemen k&ouml;nnte das wie folgt aussehen: 17.04.2011.</p>
    <p><strong>Time</strong>: Zeigt nur die Zeit an, abh&auml;ngig vom aktuellen Gebietsschema des Benutzers. Auch wenn das Datum nicht angezeigt wird, ist es dennoch im Steuerelement vorhanden und wird zusammen mit der Zeit im <a href="FileSetTime.htm#YYYYMMDD">YYYYMMDDHH24MISS</a>-Format abgerufen.</p>
    <p><strong>(benutzerdefiniertes Format)</strong>: Bestimmt eine beliebige Kombination von <a href="FormatTime.htm">Datum- und Zeitformaten</a>. Zum Beispiel w&uuml;rde <em>d.M.yy HH:mm</em> wie 17.4.11 12:19 aussehen. Ebenso w&uuml;rde <em>dddd MMMM d, yyyy hh:mm:ss</em> dann wie Sonntag April 17, 2011 12:22:45 dargestellt. Buchstaben und Zahlen, die direkt angezeigt werden sollen, m&uuml;ssen wie folgt in Hochkommas gesetzt werden: <em><!--nowiki-->'Datum:' dd.MM.yy 'Zeit:' hh:mm:ss tt<!--/nowiki--></em>. Nicht-alphanumerische Zeichen wie Leerzeichen, Tabulatoren, Schr&auml;gstriche, Doppelpunkte, Kommas und andere Satzzeichen m&uuml;ssen hingegen nicht von Hochkommas umschlossen werden. Die Ausnahme ist das Hochkomma selbst: Zur Darstellung dieses Zeichens m&uuml;ssen vier aufeinanderfolgende Hochkommas ('''') verwendet werden, oder nur zwei, wenn das Hochkomma sich bereits innerhalb von zwei &auml;u&szlig;eren Hochkommas befindet.</p>
    <h3>Verwendung</h3>
    <p id="ChooseDT">Damit anfangs ein beliebiges Datum au&szlig;er Heute vorausgew&auml;hlt ist, f&uuml;gt in den <em>Optionen</em> das Wort Choose ein, unmittelbar gefolgt von einem Datum im YYYYMMDD-Format. Zum Beispiel w&uuml;rde mit Choose20110417 das Datum 17. April 2011 vorausgew&auml;hlt (wie bei anderen Optionen kann hierbei auch eine Variable angegeben werden, zum Beispiel Choose%Var%). Mit ChooseNone wird kein Datum ausgew&auml;hlt. Zudem erstellt diese Option innerhalb des Steuerelements ein Kontrollk&auml;stchen, dessen Markierung entfernt wird, sobald das Steuerelement kein Datum hat. Sollte das Steuerelement kein Datum haben, ermitteln <a href="Gui.htm#Submit">Gui Submit</a> und <a href="GuiControlGet.htm">GuiControlGet</a> einen leeren String.</p>
    <p>Die Tageszeit kann mit angegeben werden. Allerdings muss sich davor ein Datum befinden, wenn es im Steuerelement gesetzt oder abgerufen wird. Das Zeitformat ist HH24MISS (Stunden, Minuten, Sekunden), wobei die Stunden im 24-Stunden-Format angegeben werden m&uuml;ssen. Folglich ist ein vollst&auml;ndiger Datum-Zeit-String im <a href="FileSetTime.htm#YYYYMMDD">YYYYMMDDHH24MISS</a>-Format.</p>
    <p>Bei einem Datum im YYYYMMDDHH24MISS-Format k&ouml;nnen nachfolgende Elemente weggelassen werden, um diese mit Standardwerten zu ersetzen. Element MM wird mit 01 ersetzt, DD mit 01, HH24 mit 00, MI mit 00 und SS mit 00.</p>
    <p>Innerhalb des ausklappbaren Kalenders kann unten der Heute-String angeklickt werden, um das heutige Datum auszuw&auml;hlen. Dar&uuml;ber hinaus ist das Jahr und der Monatsname anklickbar, um die Navigation zwischen den Monaten oder Jahren zu vereinfachen.</p>
    <p>Navigation mit der Tastatur: </p>
    <ul>
      <li>Innerhalb des Eingabefeldes: Mit den Pfeiltasten <kbd>&uarr;</kbd> / <kbd>&darr;</kbd> , den Ziffernblocktasten <kbd>+</kbd> / <kbd>-</kbd> und den Tasten <kbd>Pos1</kbd> / <kbd>Ende</kbd> k&ouml;nnen die Werte erh&ouml;ht oder verringert werden. Mit den Pfeiltasten <kbd>&larr;</kbd> und <kbd>&rarr;</kbd> ist es m&ouml;glich, zwischen den Feldern zu wechseln.</li>
      <li>Innerhalb des ausklappbaren Kalenders: Mit den Tasten <kbd>Bild &uarr;</kbd> / <kbd>Bild &darr;</kbd> einen Monat zur&uuml;ck/vor, mit den Tastenkombinationen <kbd>Strg</kbd>+<kbd>Bild &uarr;</kbd> / <kbd>Bild &darr;</kbd> ein Jahr zur&uuml;ck/vor und mit den Tasten <kbd>Pos1</kbd> / <kbd>Ende</kbd> jeweils den ersten/letzten Tag im Monat ausw&auml;hlen. Mit den Pfeiltasten <kbd>&larr;</kbd> und <kbd>&rarr;</kbd> ist es m&ouml;glich, zwischen den Tagen zu wechseln.</li>
    </ul>
    <p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, wird in der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) das Datum und die Zeit im <a href="FileSetTime.htm#YYYYMMDD">YYYYMMDDHH24MISS</a>-Format gespeichert. Sowohl das Datum als auch die Zeit sind vorhanden, unabh&auml;ngig davon, ob sie tats&auml;chlich im Steuerelement sichtbar sind.</p>
    <p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Diese Option bewirkt, dass <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt wird, sobald der Benutzer das Datum oder die Zeit &auml;ndert. Jedes mal, wenn das Label ausgef&uuml;hrt wird, wird die <a href="Gui.htm#var">zugewiesene Ausgabevariable</a> (falls vorhanden) des Steuerelements auf den aktuell ausgew&auml;hlten Datums-/Zeitwert aktualisiert.</p>
    <p>Windows 95 und NT4 ben&ouml;tigen mindestens Internet Explorer 3.0, damit DateTime unterst&uuml;tzt wird.</p>
    <h3>Optionen</h3>
    <p><strong>Choose</strong>: Siehe <a href="#ChooseDT">oben</a>.</p>
    <p><strong>Range</strong>: Beschr&auml;nkt die Datumsauswahl auf einem bestimmten Zeitraum. Nach dem Wort Range kann das minimale und maximale Datum im YYYYMMDD-Format angegeben werden (mit einem Bindestrich dazwischen). Zum Beispiel wird mit <em>Range20050101-20050615</em> das Datum auf die ersten 5,5 Monaten des Jahres 2005 beschr&auml;nkt. Einer der beiden Werte kann weggelassen werden, um die Beschr&auml;nkung in dieser Richtung aufzuheben. Zum Beispiel w&uuml;rde Range20010101 verhindern, dass ein Tag vor 2001 ausgew&auml;hlt werden kann. Ebenso w&uuml;rde Range-20091231 (Bindestrich davor) verhindern, dass ein Tag nach 2009 ausgew&auml;hlt werden kann. Ist diese Option nicht vorhanden, kann jedes Datum zwischen den Jahren 1601 und 9999 ausgew&auml;hlt werden. Die Tageszeit ist nicht einschr&auml;nkbar.</p>
    <p><strong>Right</strong>: Bewirkt, dass der Kalender auf der rechten Seite des Eingabefeldes aufgeklappt wird.</p>
    <p><strong>1</strong>: Ersetzt die Schaltfl&auml;che des ausklappbaren Kalenders mit einem UpDown, um Datum-Zeit-Werte bearbeiten zu k&ouml;nnen. Funktioniert nicht in Verbindung mit LongDate.</p>
    <p id="ChooseNone"><strong>2</strong>: Erm&ouml;glicht ein Kontrollk&auml;stchen innerhalb des Steuerelements, dessen Markierung entfernt werden kann, um die Auswahl des Datums/der Zeit aufzuheben. Diese Option kann nach Erstellen des Steuerelements nicht mehr ge&auml;ndert werden.</p>
    <h2 id="MonthCal">MonthCal</h2>
    <p>Beschreibung: Ein hohes und breites Steuerelement, das alle Tage des Monats im Kalenderformat anzeigt. Der Benutzer kann ein einzelnes Datum oder einen Datumsbereich ausw&auml;hlen.</p>
    <pre>Beispiel: Gui, Add, MonthCal, vEigenerKalender</pre>
    <p>Damit anfangs ein beliebiges Datum au&szlig;er Heute vorausgew&auml;hlt ist, f&uuml;gt im letzten Parameter ein Datum im YYYYMMDD-Format ein (z. B. 20050531). Zudem kann ein Datumsbereich mithilfe eines Bindestrichs vorausgew&auml;hlt werden (z. B. 20050525-20050531).</p>
    <p>Bei diesem Steuerelement sollte die Breite (W) und H&ouml;he (H) weggelassen werden, weil die Gr&ouml;&szlig;e automatisch auf ein Monat angepasst wird. Um mehrere Monate vertikal darzustellen, verwendet R2 oder h&ouml;her in den <em>Optionen</em>. Um mehrere Monate horizontal darzustellen, verwendet W-2 oder h&ouml;her in den <em>Optionen</em>. Diese Optionen k&ouml;nnen gleichzeitig vorhanden sein, um in beide Richtungen zu erweitern.</p>
    <p>Im unteren Bereich des Steuerelements kann der Heute-String 
      angeklickt werden, um das heutige Datum auszuw&auml;hlen. Dar&uuml;ber hinaus ist 
      das Jahr und der Monatsname anklickbar, um die Navigation zwischen den 
      Monaten oder Jahren zu vereinfachen.</p>
    <p>Im Gegensatz zum ausklappbaren Kalender von <a href="#DateTime">DateTime</a> wird die Tastaturnavigation in MonthCal generell nicht unterst&uuml;tzt.</p>
    <p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, wird in der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) das ausgew&auml;hlte Datum im YYYYMMDD-Format (ohne Zeitangabe) gespeichert. Sollte allerdings die <a href="#MonthCalMulti">Mehrfachauswahl</a>-Option aktiv sein, wird sowohl der Minimal- als auch Maximalwert mit einem Bindestrich dazwischen abgerufen (z. B. 20050101-20050108). Falls in einem Mehrfachauswahl-Kalender nur ein Datum ausgew&auml;hlt wurde, wird auch ein Minimal- und Maximalwert abgerufen, jedoch sind beide identisch. <a href="StringSplit.htm">StringSplit</a> kann dazu verwendet werden, die Datumswerte zu trennen. Im folgenden Beispiel wird der Minimalwert in Datum1 und der Maximalwert in Datum2 gespeichert: <code>StringSplit, Datum, EigenerMonatskalender, -</code>.</p>
    <p>Wenn MonthCal einen <a href="Gui.htm#label">g-Label</a> hat, wird in der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) das aktuell ausgew&auml;hlte Datum oder der Bereich gespeichert. Standardm&auml;&szlig;ig wird das Label nur aufgerufen, wenn: 1) der Benutzer die Auswahl &auml;ndert, oder 2) nur alle zwei Minuten, falls ein neuer Tag erreicht wurde (dieses Verhalten ist eine Eigenart des Betriebssystems). Wenn allerdings das Wort AltSubmit in den <em>Optionen</em> des Steuerelements vorkommt, wird <a href="Gui.htm#label">g-Label</a> &ouml;fters ausgef&uuml;hrt. Zudem wird die interne Variable A_GuiEvent auf "Normal" gesetzt, wenn das Datum ge&auml;ndert wurde; auf 1, falls ein Datum angeklickt wurde; oder auf 2, wenn MonthCal die "Mauserfassung" freigibt. Wenn  der Benutzer zum Beispiel ein neues Datum zweimal anklickt, wird das Label f&uuml;nfmal ausgef&uuml;hrt: Einmal mit Normal, zweimal mit 1 und zweimal mit 2. Das kann verwendet werden, um die Doppelklicks zwischen den Instanzen von Nummer 1 durch <a href="../Variables.htm#TickCount">Messen der Zeit</a> zu erkennen.</p>
    <p>Wenn das Datum im YYYYMMDD-Format angegeben wird, kann der MM- und/oder DD-Teil weggelassen werden, welche dann als 1 angesehen werden. Zum Beispiel wird 200205 als 20020501, und 2005 als 20050101 angesehen.</p>
    <p>Windows 95 und NT4 ben&ouml;tigen mindestens Internet Explorer 3.0, damit MonthCal unterst&uuml;tzt wird.</p>
    <h3>Optionen</h3>
    <p id="MonthCalMulti"><strong>Multi</strong>: Mehrfachauswahl. Erm&ouml;glicht dem Benutzer, mit <kbd>Umschalt</kbd>+Klick oder Ziehen der Maus angrenzende Datumswerte zu markieren (der Benutzer kann weiterhin ein einzelnes Datum ausw&auml;hlen). Entweder kann diese Option direkt angegeben werden oder sie wird automatisch wirksam, wenn ein Auswahlbereich beim Erstellen des Steuerelements angegeben wird. Zum Beispiel: <code>Gui, Add, MonthCal, vEigenerKalender, 20050101-20050108</code>. Diese Option kann nach Erstellen des Steuerelements nicht mehr ge&auml;ndert werden.</p>
    <p><strong>Range</strong>: Beschr&auml;nkt die Datumsauswahl auf einem bestimmten Zeitraum. Nach dem Wort Range kann das minimale und maximale Datum im YYYYMMDD-Format angegeben werden (mit einem Bindestrich dazwischen). Zum Beispiel wird mit <em>Range20050101-20050615</em> die Auswahl auf die ersten 5,5 Monaten des Jahres 2005 beschr&auml;nkt. Einer der beiden Werte kann weggelassen werden, um die Beschr&auml;nkung in dieser Richtung aufzuheben. Zum Beispiel w&uuml;rde Range20010101 verhindern, dass ein Tag vor 2001 ausgew&auml;hlt werden kann. Ebenso w&uuml;rde Range-20091231 (Bindestrich davor) verhindern, dass ein Tag nach 2009 ausgew&auml;hlt werden kann. Ist diese Option nicht vorhanden, kann jedes Datum zwischen den Jahren 1601 und 9999 ausgew&auml;hlt werden.</p>
    <p><strong>4</strong>: Zeigt links neben jeder Tagesreihe die Wochennummern (1-52) an. Woche 1 ist als erste Woche definiert, die mindestens vier Tage enth&auml;lt.</p>
    <p><strong>8</strong>: Verhindert, dass das heutige Datum im Steuerelement umkreist wird.</p>
    <p><strong>16</strong>: Verhindert, dass das heutige Datum im unteren Bereich des Steuerelements angezeigt wird.</p>
    <h2 id="Slider">Slider</h2>
    <p>Beschreibung: Ein Schieberegler, den der Benutzer entlang einer vertikalen oder horizontalen Strecke bewegen kann. Zum Beispiel ist die Standard-Lautst&auml;rkeregelung in der Taskleiste ein Schieberegler.</p>
    <pre>Beispiel: Gui, Add, Slider, vEigenerSchieberegler, 50</pre>
    <p>Im letzten Parameter kann die Startposition des Schiebereglers angegeben werden. Wenn dieser Parameter weggelassen wird, beginnt der Schieberegler bei 0 oder bei der Bereichszahl, die am n&auml;chsten an der Null ist.</p>
    <p>Der Benutzer kann den Regler wie folgt verschieben:</p>
    <ol>
      <li>Mit der Maus ziehen</li>
      <li>Auf den Bereich der Schiene klicken</li>
      <li>Das Mausrad drehen, w&auml;hrend das Steuerelement den Fokus hat</li>
      <li>Folgende Tasten dr&uuml;cken, w&auml;hrend das Steuerelement den Fokus hat: Pfeiltasten, <kbd>Bild &uarr;</kbd>, <kbd>Bild &darr;</kbd>, <kbd>Pos1</kbd> und <kbd>Ende</kbd>.</li>
    </ol>
    <p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, wird in der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) die numerische Position des Schiebereglers gespeichert. Die Position ist auch dann enthalten, wenn das <a href="Gui.htm#label">g-Label</a> des Steuerelements ausgef&uuml;hrt wird.</p>
    <p>Ein <a href="Gui.htm#label">g-Label</a> wird standardm&auml;&szlig;ig nur ausgef&uuml;hrt, wenn der Benutzer aufgeh&ouml;rt hat, den Regler zu bewegen (z. B. durch Loslassen der Maustaste, nachdem die Maus gezogen wurde). Wenn allerdings das Wort AltSubmit in den <em>Optionen</em> des Steuerelements vorkommt, wird das g-Label bei allen Ereignissen des Schiebereglers ausgef&uuml;hrt und die interne Variable A_GuiEvent auf eine der folgenden Zahlen oder Strings gesetzt:</p>
    <table class="info">
      <tr>
        <td>0<br></td>
        <td>Der Benutzer hat <kbd>&larr;</kbd> oder <kbd>&uarr;</kbd> gedr&uuml;ckt.</td>
      </tr>
      <tr>
        <td>1<br></td>
        <td>Der Benutzer hat <kbd>&rarr;</kbd> oder <kbd>&darr;</kbd> gedr&uuml;ckt.</td>
      </tr>
      <tr>
        <td>2<br></td>
        <td>Der Benutzer hat <kbd>Bild &uarr;</kbd> gedr&uuml;ckt.</td>
      </tr>
      <tr>
        <td>3<br></td>
        <td>Der Benutzer hat <kbd>Bild &darr;</kbd> gedr&uuml;ckt.</td>
      </tr>
      <tr>
        <td>4<br></td>
        <td>Der Benutzer hat den Schieberegler mit dem Mausrad oder mit Ziehen und Ablegen verschoben.</td>
      </tr>
      <tr>
        <td>5<br></td>
        <td>Der Benutzer zieht den Schieberegler momentan mit der Maus. Das hei&szlig;t, dass die Maustaste zurzeit gedr&uuml;ckt wird.</td>
      </tr>
      <tr>
        <td>6<br></td>
        <td>Der Benutzer hat <kbd>Pos1</kbd> gedr&uuml;ckt, um den Regler ganz nach links oder nach oben zu verschieben. </td>
      </tr>
      <tr>
        <td>7<br></td>
        <td> Der Benutzer hat <kbd>Ende</kbd> gedr&uuml;ckt, um den Regler ganz nach rechts oder nach unten zu verschieben. </td>
      </tr>
      <tr>
        <td>Normal<br></td>
        <td>Der Benutzer hat das Verschieben des Reglers entweder mit der Maus oder mit der Tastatur beendet. <u>Hinweis</u>: Auch wenn das <a href="Gui.htm#label">g-Label</a> bereits bei einem der oben genannten Zahlenereignissen ausgef&uuml;hrt wurde, wird es bei diesem Ereignis nochmals ausgef&uuml;hrt, au&szlig;er bei Nummer 4 (Mausradbewegung).</td>
      </tr>
    </table>
    <h3>Optionen</h3>
    <p><strong>Buddy1/Buddy2</strong>: Bestimmt bis zu zwei vorhandene Steuerelemente, die automatisch an beiden Enden des Schiebereglers positioniert werden. Buddy1 wird auf der linken oder oberen Seite angezeigt (je nachdem, ob die Option Vertical vorhanden ist). Buddy2 wird auf der rechten oder unteren Seite angezeigt. Nach dem Wort Buddy1 oder Buddy2 kann der <a href="Gui.htm#var">Variablenname</a> eines vorhandenen Steuerelements angegeben werden. Zum Beispiel wird mit Buddy1EigenerObertext das Steuerelement mit dem Variablennamen EigenerObertext zugewiesen. Windows 95 und NT4 ben&ouml;tigen Internet Explorer 3.0 oder h&ouml;her, um diese Option zu unterst&uuml;tzen.</p>
    <p><strong>Center</strong>: Der Einstellknopf (welcher durch den Benutzer verschoben wird) ist in keine Richtung ausgerichtet.</p>
    <p><strong>Invert</strong>: Dreht das Steuerelement um, damit der niedrigere Wert rechts/unten ist, anstatt links/oben. Das wird normalerweise benutzt, um einen vertikalen Schieberegler als traditionelle Lautst&auml;rkeregelung darzustellen. Hinweis: Die unten beschriebene ToolTip-Option ber&uuml;cksichtigt nicht die Umkehrung und sollte in diesem Fall nicht verwendet werden.</p>
    <p><strong>Left</strong>: Der Einstellknopf (welcher durch den Benutzer verschoben wird) wird nach oben, anstatt nach unten ausgerichtet. Ist jedoch die Vertical-Option vorhanden, wird der Einstellknopf nach links, anstatt nach rechts ausgerichtet.</p>
    <p><strong>Line</strong>: Bestimmt die Anzahl der Positionen, die verschoben werden, falls der Benutzer eine Pfeiltaste dr&uuml;ckt. Nach dem Wort Line kann die Anzahl der zu bewegenden Positionen angegeben werden. Zum Beispiel: Line2</p>
    <p><strong>NoTicks</strong>: Entfernt die Skalenstriche entlang der Strecke.</p>
    <p><strong>Page</strong>: Bestimmt die Anzahl der Positionen, die verschoben werden, falls der Benutzer <kbd>Bild &uarr;</kbd> oder <kbd>Bild &darr;</kbd> dr&uuml;ckt. Nach dem Wort Page kann die Anzahl der zu bewegenden Positionen angegeben werden. Zum Beispiel: Page10</p>
    <p><strong>Range</strong>: Bestimmt einen benutzerdefinierten Bereich (standardm&auml;&szlig;ig von 0 bis 100). Nach dem Wort Range erfolgt der Minimalwert, ein Bindestrich und der Maximalwert. Zum Beispiel kann mit Range1-1000 eine Zahl zwischen 1 und 1000 ausgew&auml;hlt werden, mit Range-50-50 eine Zahl zwischen -50 und 50 und mit Range-10--5 eine Zahl zwischen -10 und -5.</p>
    <p><strong>Thick</strong>: Bestimmt die L&auml;nge des Einstellknopfs (welcher durch den Benutzer verschoben wird). Nach dem Wort Thick erfolgt die Dicke in Pixel (z. B. Thick30). Um die Dicke in Windows XP oder h&ouml;her zu erh&ouml;hen, ist es wahrscheinlich notwendig, die Center-Option anzugeben oder das Design des Steuerelements zu entfernen (dazu muss <em>-Theme</em> in den Optionen des Steuerelements angegeben werden).</p>
    <p><strong>TickInterval</strong>: Erm&ouml;glicht Skalenstriche entlang der Strecke in einem bestimmten Intervall. Nach dem Wort TickInterval erfolgt das Intervall, um zus&auml;tzliche Skalenstriche anzuzeigen (sollte der Intervall weggelassen werden, wird standardm&auml;&szlig;ig 1 verwendet). Zum Beispiel wird mit TickInterval10 alle 10 Positionen ein Skalenstrich angezeigt.</p>
    <p><strong>ToolTip</strong>: Erstellt ein Tooltip, der die numerische Position beim Verschieben des Reglers anzeigt. Um den Tooltip an einer anderen Position anzuzeigen, verwendet Folgendes: ToolTipLeft oder ToolTipRight (f&uuml;r horizontale Schieberegler); ToolTipTop oder ToolTipBottom (f&uuml;r vertikale Schieberegler). Windows 95 und NT4 ben&ouml;tigen Internet Explorer 3.0 oder h&ouml;her, um diese Option zu unterst&uuml;tzen.</p>
    <p><strong>Vertical</strong>: Damit kann der Schieberegler nach oben oder nach unten verschoben werden, anstatt nach links oder nach rechts.</p>
    <p>Die oben genannten Optionen k&ouml;nnen mit <a href="GuiControl.htm">GuiControl</a> nachtr&auml;glich ge&auml;ndert werden.</p>
    <h2 id="Progress">Progress</h2>
    <p>Beschreibung: Ein Fortschrittsbalken in zwei Farben, der visuell darstellt, wie weit eine Operation voran geschritten ist.</p>
    <pre>Beispiel: Gui, Add, Progress, w300 h20 cBlue vEigenesProgress</pre>
    <p>Im letzten Parameter kann die Anfangsposition des Balkens angegeben werden (ist dieser nicht vorhanden, beginnt der Balken bei 0 oder bei der Bereichszahl, die am n&auml;chsten an der Null ist). Um die Position des Balkens sp&auml;ter zu &auml;ndern, befolgt diese Beispiele, die sich auf einen Fortschrittsbalken mit dem <a href="Gui.htm#var">zugewiesenen Variablennamen</a> EigenesProgress beziehen:</p>
    <pre><a href="GuiControl.htm">GuiControl</a>,, EigenesProgress, +20  <em>; Die Position wird um 20 erh&ouml;ht.</em>
<a href="GuiControl.htm">GuiControl</a>,, EigenesProgress, 50  <em>; Die Position wird auf 50 gesetzt.</em></pre>
    <p>Bei horizontalen Fortschrittsbalken wird die Dicke des Balkens durch die H&ouml;he des Steuerelements bestimmt. Bei vertikalen Fortschrittsbalken durch die Breite des Steuerelements.</p>
    <h3>Optionen</h3>
    <p><strong>Cn</strong>: &Auml;ndert die Farbe des Balkens. Ersetzt <strong>n</strong> mit einer HTML-Prim&auml;rfarbe oder einem 6-stelligen RGB-<a href="Progress.htm#colors">Farbwert</a>. Beispiele: cRed, cFFFF33, cDefault. Sollte die C-Option nie verwendet werden (oder cDefault angegeben sein), wird die Standardfarbe des Betriebssystems verwendet.</p>
    <p><strong>BackgroundN</strong>: &Auml;ndert die Hintergrundfarbe des Balkens. Ersetzt <strong>n</strong> mit einer HTML-Prim&auml;rfarbe oder einem 6-stelligen RGB-<a href="Progress.htm#colors">Farbwert</a>. Beispiele: BackgroundGreen, BackgroundFFFF33, BackgroundDefault. Sollte die Background-Option nie verwendet werden (oder BackgroundDefault angegeben sein), wird standardm&auml;&szlig;ig die Hintergrundfarbe des Fensters oder <a href="#Tab">Tab-Steuerelements</a> verwendet.</p>
    <p><strong>Range</strong>: Bestimmt einen benutzerdefinierten Bereich (standardm&auml;&szlig;ig von 0 bis 100). Nach dem Wort Range erfolgt der Minimalwert, ein Bindestrich und der Maximalwert. Zum Beispiel erm&ouml;glicht Range1-1000 eine Zahl zwischen 1 und 1000, Range-50-50 eine Zahl zwischen -50 und 50 und Range-10--5 eine Zahl zwischen -10 und -5. In Windows 95 und NT4 verhalten sich negative Bereiche und Bereiche &uuml;ber 65535 erst korrekt, wenn Internet Explorer 3.0 oder h&ouml;her installiert ist.</p>
    <p><strong>-Smooth</strong>: Teilt den Balken im mehrere Segmente, anstatt einen durchgehenden Balken anzuzeigen. Zudem ist -Smooth eine der Voraussetzungen, um einen thematisch gestalteten Fortschrittsbalken in Windows XP oder h&ouml;her anzuzeigen. Die andere Voraussetzung ist, dass der Balken keine benutzerdefinierten Farben enthalten darf. Das hei&szlig;t, dass die Optionen C und Background weggelassen werden m&uuml;ssen. Windows 95 und NT4 ben&ouml;tigen Internet Explorer 3.0 oder h&ouml;her, um diese Option zu unterst&uuml;tzen.</p>
    <p><strong>Vertical</strong>: Bewirkt, dass der Balken vertikal steigt oder f&auml;llt, anstatt sich auf horizontaler Ebene zu bewegen. Windows 95 und NT4 ben&ouml;tigen Internet Explorer 3.0 oder h&ouml;her, um diese Option zu unterst&uuml;tzen.</p>
    <p>Die oben genannten Optionen k&ouml;nnen mit <a href="GuiControl.htm">GuiControl</a> nachtr&auml;glich ge&auml;ndert werden.</p>
    <h2 id="GroupBox">GroupBox</h2>
    <p>Beschreibung: Ein Gruppenfeld mit rechteckigem Rahmen, das dazu verwendet wird, die gemeinschaftliche Beziehung mehrere Steuerelemente darzustellen. In diesem Fall enth&auml;lt der letzte Parameter den Titel des Rahmens, der in der oberen linken Ecke angezeigt wird.</p>
    <pre>Beispiel: Gui, Add, GroupBox, w400 h300, Geographische Kriterien</pre>
    <p>Standardm&auml;&szlig;ig ist der Titel des Gruppenfeldes nur einzeilig. Das kann mit <em>Wrap</em> in den Optionen des Steuerelements &uuml;berschrieben werden.</p>
    <p>Um die Anzahl der Zeilen innerhalb des Steuerelements zu bestimmen (oder die H&ouml;he und Breite), siehe <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
    <h2 id="Tab">Tab2</h2>
    <p>Beschreibung: Ein gro&szlig;es Steuerelement mit mehreren Seiten, die jeweils weitere Steuerelemente enthalten. Von diesem Punkt an werden diese Seiten "Tabs" genannt.</p>
    <p><strong>Tab2 vs. Tab</strong>: In v1.0.47.05 wurde das Tab2-Steuerelement hinzugef&uuml;gt, das im originalen Tab-Steuerelement seltene Probleme beim Neuzeichnen behebt (tritt zum Beispiel auf, wenn ein GUI-Fenster durch Anklicken bestimmter Bereiche der Steuerelemente, wie bei Fortschrittsbalken, aktiviert wird). Das urspr&uuml;ngliche Tab-Steuerelement wird f&uuml;r die Abw&auml;rtskompatibilit&auml;t beibehalten, weil Tab2 das Tab-Steuerelement erst einf&uuml;gt, wenn es Steuerelemente in Navigationsreihenfolge von <kbd>Tab</kbd> enth&auml;lt. Wenn m&ouml;glich sollten neue Scripts immer Tab2 verwenden.</p>
    <pre>Beispiel: Gui, Add, Tab2,, Allgemein|Ansicht|Aussehen|Einstellungen</pre>
    <p id="ChooseTab">Der letzte Parameter enth&auml;lt eine Liste mit Tabnamen, die durch senkrechte Striche getrennt sind. Damit einer der Tabs beim erstmaligen Anzeigen des Fensters vorausgew&auml;hlt ist, f&uuml;gt nach diesem zwei senkrechte Striche an (z. B. Rot|Gr&uuml;n||Blau). Alternativ kann mit dem Wort Choose in den <em>Optionen</em>, unmittelbar gefolgt von der Nummer, ein Eintrag sofort vorausgew&auml;hlt werden. Zum Beispiel w&uuml;rde mit Choose5 der f&uuml;nfte Tab vorausgew&auml;hlt (wie bei anderen Optionen kann hierbei auch eine Variable angegeben werden, zum Beispiel Choose%Var%). Mit <a href="GuiControl.htm">GuiControl</a> kann der ausgew&auml;hlte Tab nachtr&auml;glich durch Hinzuf&uuml;gen oder Entfernen von Tabs ge&auml;ndert werden.</p>
    <p id="TabCmd">Steuerelemente, die nach dem Tab-Steuerelement hinzugef&uuml;gt werden, geh&ouml;ren automatisch zum ersten Tab. Mit den folgenden Beispielen kann das jederzeit ge&auml;ndert werden:</p>
    <pre>Gui, Tab  <em>; Nachfolgende Steuerelemente geh&ouml;ren nicht mehr zum Tab-Steuerelement.</em>
Gui, Tab, 3  <em>; Nachfolgende Steuerelemente werden dem dritten Tab im Tab-Steuerelement untergeordnet.</em>
Gui, Tab, 3, 2  <em>; Nachfolgende Steuerelemente werden dem dritten Tab im zweiten Tab-Steuerelement untergeordnet.</em>
Gui, Tab, Name  <em>; Nachfolgende Steuerelemente werden dem Tab mit der Bezeichnung <i>Name</i> untergeordnet (unabh&auml;ngig von Gro&szlig;-/Kleinschreibung).</em>
Gui, Tab, Name,, Exact  <em>; Das Gleiche wie oben, aber mit exakter &Uuml;bereinstimmung (und abh&auml;ngig von Gro&szlig;-/Kleinschreibung).</em></pre>
    <p>Die oben genannten Beispiele k&ouml;nnen auch dazu verwendet werden, Steuerelemente einem Tab zuzuweisen oder einem Tab-Steuerelement, das noch nicht vorhanden ist (au&szlig;er bei der <em>Name</em>-Methode). In diesem Fall aber werden die unten genannten Optionen zur relativen Positionierung nicht unterst&uuml;tzt.</p>
    <p>Positionierung: Sobald jeder Tab eines Tab-Steuerelements sein erstes Untersteuerelement erh&auml;lt, hat dieses Untersteuerelement unter folgenden Bedingungen eine besondere Standardposition:</p>
    <ol>
      <li>Ist sowohl die X- als auch Y-Koordinate nicht vorhanden, wird das erste Untersteuerelement in die obere linke Ecke des Tab-Steuerelements positioniert (mit Standard-<a href="Gui.htm#Margin">Abstand</a>). Die restlichen Untersteuerelemente werden jeweils unter dem vorherigen Steuerelement positioniert.</li>
      <li>Falls die Positionierungsoptionen <a href="Gui.htm#PosPlus">X+n und/oder Y+n </a>angegeben sind, wird das Untersteuerelement in Bezug auf die linke obere Ecke des Innenbereichs vom Tab-Steuerelement positioniert. Zum Beispiel w&uuml;rde mit "x+10 y+10" das Steuerelement von der linken oberen Ecke 10 Pixel nach rechts und 10 Pixel nach unten positioniert.</li>
    </ol>
    <p>Untersteuerelemente m&uuml;ssen nicht unbedingt in der Abgrenzung des Tab-Steuerelements vorhanden sein: Sie werden weiterhin versteckt und sichtbar gemacht, sobald ihr Tab ausgew&auml;hlt oder abgew&auml;hlt wird. Dieses Verhalten ist besonders f&uuml;r den unten beschriebenen Button-Style geeignet.</p>
    <p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, wird in der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) der Name des zurzeit ausgew&auml;hlten Tabs gespeichert. Hat das Steuerelement jedoch die <a href="Gui.htm#AltSubmit">AltSubmit</a>-Eigenschaft, erh&auml;lt die Ausgabevariable stattdessen die Positionsnummer des Tabs (der erste Tab ist 1, der zweite ist 2 und so weiter).</p>
    <p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Diese Option bewirkt, dass <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt wird, sobald der Benutzer auf einen anderen Tab wechselt. Wenn das Tab-Steuerelement sowohl ein <a href="Gui.htm#label">g-Label</a> als auch eine <a href="Gui.htm#var">Ausgabevariable</a> hat, wird die Ausgabevariable beim Wechseln des Tabs auf den zuvor ausgew&auml;hlten Tabnamen gesetzt (oder bei <a href="Gui.htm#AltSubmit">AltSubmit</a> auf die Nummer).</p>
    <p>Navigation mit der Tastatur: Der Benutzer kann mit <kbd>Strg</kbd>+<kbd>Bild &uarr;</kbd> oder mit <kbd>Strg</kbd>+<kbd>Bild &darr;</kbd> zwischen den Tabs wechseln. Befindet sich der Tastaturfokus auf einem Steuerelement, das nicht zum Tab-Steuerelement geh&ouml;rt, wird das erste Tab-Steuerelement des Fensters angesteuert. <kbd>Strg</kbd>+<kbd>Tab</kbd> und <kbd>Strg</kbd>+<kbd>Umschalt</kbd>+<kbd>Tab</kbd> k&ouml;nnen auch verwendet werden, aber mit der Ausnahme, dass sie nicht funktionieren, wenn das aktuell fokussierte Steuerelement ein mehrzeiliges Eingabefeld ist.</p>
    <p>Jedes Fenster kann nicht mehr als 255 Tab-Steuerelemente enthalten. Jedes Tab-Steuerelement kann nicht mehr als 256 Tabs (Seiten) haben. Dar&uuml;ber hinaus ist es nicht m&ouml;glich, dass ein Tab-Steuerelement weitere Tab-Steuerelemente enth&auml;lt.</p>
    <h3>Optionen</h3>
    <p><strong>Choose</strong>: Siehe <a href="#ChooseTab">oben</a>.</p>
    <p><strong>-Background</strong>: &Uuml;berschreibt die <a href="Gui.htm#Color">benutzerdefinierte Hintergrundfarbe des Fensters</a> und verwendet die Standardfarbe des Tab-Steuerelements vom Betriebssystem. Verwendet <em>+Theme -Background</em>, damit sich das Tab-Steuerelement am aktuellen Desktop-Design anpasst. Allerdings werden dadurch die meisten Steuerelementarten im Tab-Steuerlement merkw&uuml;rdig dargestellt, da ihre Hintergr&uuml;nde nicht dem Hintergrund des Tab-Steuerelements entsprechen. Bei einigen Steuerelementarten (wie <a href="#Text">Text</a>) kann das Problem behoben werden, wenn BackgroundTrans in deren Optionen eingef&uuml;gt wird.</p>
    <p><strong>Buttons</strong>: Erstellt anstelle von Tabs mehrere Schaltfl&auml;chen im oberen Bereich des Steuerelements (in diesem Fall wird standardm&auml;&szlig;ig kein Rahmen angezeigt, weil die Anzeigefl&auml;che normalerweise keine Steuerelemente enth&auml;lt).</p>
    <p><strong>Left/Right/Bottom</strong>: Mit diesen W&ouml;rtern werden die Tabs an der linken, rechten oder unteren Seite angezeigt, anstatt an der oberen. F&uuml;r Left und Right gelten Einschr&auml;nkungen, die in <a href="../misc/Styles.htm#tcs_vertical">TCS_VERTICAL</a> eingesehen werden k&ouml;nnen.</p>
    <p><strong>-Wrap</strong>: Verhindert, dass die Tabs mehr als eine Reihe verbrauchen (sind hierbei zu viele Tabs vorhanden, werden Schaltfl&auml;chen mit Pfeilen angezeigt, damit der Benutzer zwischen den Tabs wechseln kann).</p>
    <p>Um die Anzahl der Textreihen innerhalb des Steuerelements zu bestimmen (oder deren H&ouml;he und Breite), siehe <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
    <p><strong>Icons in Tabs</strong>: Mit <a href="PostMessage.htm">SendMessage</a> kann ein Icon neben dem Tabnamen angezeigt werden. Siehe dazu im Forumsbeitrag <a href="http://www.autohotkey.com/forum/topic6060.html">Icons in tabs</a>.</p>
    <h2 id="StatusBar">StatusBar<span class="ver">[v1.0.44+]</span></h2>
    <p>Beschreibung: Eine Statusleiste am unteren Rand des Fensters, in der sich mehrere Texte und/oder Icons befinden. Dieses Steuerelement wird normalerweise dazu verwendet, ge&auml;nderte Zust&auml;nde zu melden.</p>
    <pre><em>; Beispiel:</em>
Gui, Add, StatusBar,, Starttext der Leiste (kann leer gelassen werden).
SB_SetText(RowCount . " Zeilen markiert.")</pre>
    <p>Die einfachste Anwendungsm&ouml;glichkeit der Statusleiste ist das Aufrufen von <a href="#SB_SetText">SB_SetText()</a>, sobald sich etwas &auml;ndert, das dem Benutzer gemeldet werden soll. Um mehr als eine Information zu melden, kann die Leiste mittels <a href="#SB_SetParts">SB_SetParts()</a> in mehrere Abschnitte aufgeteilt werden. Mit <a href="#SB_SetIcon">SB_SetIcon()</a> k&ouml;nnen Icons in der Leiste angezeigt werden.</p>
    <p>Alle folgenden Funktionen gelten f&uuml;r das <a href="Gui.htm#DefaultWin">Standard-GUI-Fenster</a> des aktuellen Threads (das zum Beispiel mit <a href="Gui.htm#Default"><code>Gui, 2:Default</code></a> ge&auml;ndert werden kann). Falls das Standardfenster weder vorhanden ist noch eine Statusleiste hat, geben alle Funktionen eine 0 zur&uuml;ck, um das Problem zu kennzeichnen.</p>
    <p id="SB_SetText"><strong>SB_SetText(NeuerText [, Bereichsnummer, Style])</strong>: Zeigt <em>NeuerText</em> im angegebenen Bereich der Statusleiste an. Falls die <em>Bereichsnummer</em> weggelassen wird, gilt 1 als Standardwert. Andernfalls kann ein Integer zwischen 1 und 256 angegeben werden. Wenn <em>Style</em> weggelassen wird, gilt 0 als Standardwert, um den traditionellen Rahmen zu verwenden, der den Bereich aussehen l&auml;sst, als w&auml;re er im Boden versunken. Ansonsten kann eine 1 angegeben werden, um den Rahmen zu entfernen oder eine 2, um den Bereich aussehen zu lassen, als w&uuml;rde er sich vom Boden abheben. Letztendlich k&ouml;nnen bis zu zwei Tabulatorzeichen (`t) in <em>NeuerText</em> angegeben werden, um den Text rechts neben dem ersten Tabulator im Bereich zu zentrieren und den Text rechts neben dem zweiten Tabulator rechts auszurichten. Diese Funktion gibt bei Erfolg eine 1 und bei Misserfolg eine 0 zur&uuml;ck.</p>
    <p id="SB_SetParts"><strong>SB_SetParts([Breite1, Breite2, ... Breite255])</strong>: Teilt die Leiste in mehrere Abschnitte auf, abh&auml;ngig von der angegebenen Breite (in Pixel). Wenn alle Parameter weggelassen werden, wird ein einzelner langer Bereich wiederhergestellt. Andernfalls kann f&uuml;r jeden Bereich, au&szlig;er dem letzten, die Breite angegeben werden (der letzte Bereich wird mit der verbliebenen Leistenbreite aufgef&uuml;llt). Zum Beispiel werden mit <code>SB_SetParts(50, 50)</code> drei Bereiche erstellt: Die ersten zwei mit einer Breite von 50 und der letzte mit der verbliebenen Breite. Hinweis: Jeder Bereich, der mit SB_SetParts() "gel&ouml;scht" wurde, startet beim n&auml;chsten Mal ohne Text (au&szlig;erdem werden die Icons automatisch zerst&ouml;rt). Diese Funktion gibt bei Erfolg einen Wert ungleich 0 (<a href="ControlGet.htm#Hwnd">HWND</a> der Statusleiste) und bei Misserfolg eine 0 zur&uuml;ck.</p>
    <p id="SB_SetIcon"><strong>SB_SetIcon(Dateiname [, Iconnummer, Bereichsnummer])</strong>: Zeigt im angegebenen Bereich ein kleines Icon links neben den Text an (falls die <em>Bereichsnummer</em> weggelassen wird, gilt 1 als Standardwert). Der <em>Dateiname</em> ist der Name einer ICO-, CUR- oder ANI-Datei (animierte Cursor werden in der Leiste zurzeit nicht animiert). Weitere Icons k&ouml;nnen in folgenden Dateitypen enthalten sein: EXE, DLL, CPL, SCR und andere Typen, die Icon-Ressourcen enthalten. Um anstelle der ersten Icon-Gruppe eine andere zu verwenden, f&uuml;gt deren Nummer in <em>Iconnummer</em> ein. Zum Beispiel w&uuml;rde mit <code>SB_SetIcon("Shell32.dll", 2)</code> das Standard-Icon aus der zweiten Icon-Gruppe verwendet werden. Diese Funktion gibt bei Erfolg das HICON des Icons und bei Misserfolg eine 0 zur&uuml;ck. Das HICON ist eine Systemressource, die bei den meisten Scripts getrost ignoriert werden kann, weil es automatisch zerst&ouml;rt wird, sobald das Fenster der Statusleiste zerst&ouml;rt wird. Ebenso wird jedes alte Icon zerst&ouml;rt, sobald es mit einer neuen ersetzt wird. Das kann wie folgt verhindert werden:</p>
    <pre>Gui +LastFound
<a href="PostMessage.htm">SendMessage</a>, 0x40F, Bereichsnummer - 1, EigenesHicon, msctls_statusbar321  <em>; 0x40F ist SB_SETICON.</em></pre>
    <p id="SB_SetProgress"><strong>SB_SetProgress()</strong>: Erstellt und steuert einen Fortschrittsbalken innerhalb einer Statusleiste. Diese Funktion ist auf <a href="http://www.autohotkey.com/forum/topic37754.html">www.autohotkey.com/forum/topic37754.html</a> verf&uuml;gbar.</p>
    <p><strong>G-Label-Meldungen:</strong> Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Diese Option bewirkt, dass <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt wird, sobald der Benutzer auf die Leiste klickt. Diese Subroutine kann auf die internen Variablen <a href="../Variables.htm#Gui">A_Gui</a> und <a href="../Variables.htm#GuiControl">A_GuiControl</a> zur&uuml;ckgreifen. Noch wichtiger ist, dass sie zudem auf die interne Variable <strong>A_GuiEvent</strong> zur&uuml;ckgreifen kann, die einen der folgenden Strings enth&auml;lt (aus Kompatibilit&auml;tsgr&uuml;nden mit zuk&uuml;nftigen Versionen sollte ein Script nicht davon ausgehen, dass das die einzigen m&ouml;glichen Werte sind):</p>
    <ul>
      <li><strong>Normal</strong>: Der Benutzer hat mit der linken Maustaste auf die Leiste geklickt. Die interne Variable A_EventInfo enth&auml;lt die Bereichsnummer (die ein sehr gro&szlig;er Integer sein kann, falls der Benutzer in der N&auml;he des Gr&ouml;&szlig;enziehpunktes rechts neben der Leiste klickt).</li>
      <li><strong>RightClick</strong>: Der Benutzer hat mit der rechten Maustaste auf die Leiste geklickt. Die interne Variable A_EventInfo enth&auml;lt die Bereichsnummer. HINWEIS: <a href="Gui.htm#GuiContextMenu">GuiContextMenu</a> wird bei der Statusleiste nicht aufgerufen, wenn ein g-Label vorhanden ist. Zudem sollte stattdessen das RightClick-Ereignis des g-Labels verwendet werden, wenn das Script wissen muss, auf welche Bereichsnummer der Benutzer geklickt hat (A_EventInfo).</li>
      <li><strong>DoubleClick</strong>: Der Benutzer hat mit der linken Maustaste zweimal auf die Leiste geklickt. Die interne Variable A_EventInfo enth&auml;lt die Bereichsnummer.</li>
      <li><strong>R</strong>: Der Benutzer hat mit der <em>rechten</em> Maustaste <em>zweimal</em> auf die Leiste geklickt.  Die interne Variable A_EventInfo enth&auml;lt die Bereichsnummer.</li>
    </ul>
    <p><strong>Schrift und Farbe</strong>: Obwohl Gr&ouml;&szlig;e, Art und Stil der Schrift mittels <a href="Gui.htm#Font">Gui Font</a> eingestellt werden kann (wie bei einem normalen Steuerelement), kann die Textfarbe dennoch nicht ge&auml;ndert werden. Auch "<a href="Gui.htm#Color">Gui Color</a>" wird nicht ber&uuml;cksichtigt; stattdessen kann die Hintergrundfarbe der Statusleiste mit dem Wort <strong>Background</strong> in den <em>Optionen</em> ge&auml;ndert werden, unmittelbar gefolgt vom Farbnamen (siehe <a href="Progress.htm#colors">Farbtabelle</a>) oder RGB-Wert (0x-Pr&auml;fix ist optional). Beispiele: BackgroundSilver, BackgroundFFDD99, BackgroundDefault.</p>
    <p><strong>Statusleiste verstecken</strong>: Bei ihrer Erstellung kann die Leiste mit <code>Gui, Add, StatusBar, Hidden vEigeneStatusleiste</code> versteckt werden. Nach ihrer Erstellung kann sie nur mit <code>GuiControl, Hide, EigeneStatusleiste</code> versteckt werden. Um sie wieder sichtbar zu machen, verwendet <code>GuiControl, Show, EigeneStatusleiste</code>. Hinweis: Das Verstecken der Leiste reduziert nicht die Fensterh&ouml;he. Wenn das gew&uuml;nscht ist, verwendet einfach <code><a href="Gui.htm#AutoSize">Gui, Show, AutoSize</a></code>.</p>
    <p><strong>Styles</strong> (selten verwendet): Siehe <a href="../misc/Styles.htm#StatusBar">Style-Tabelle der Statusleiste</a>.</p>
    <p><strong>Bekannte Einschr&auml;nkungen</strong>: </p>
    <ol>
      <li>Jedes Steuerelement, das sich mit der Statusleiste &uuml;berschneidet, wird manchmal dar&uuml;ber gezeichnet.  Dieses Problem kann zum Beispiel verhindert werden, wenn solche Steuerelemente mit dem <a href="Gui.htm#GuiSize">GuiSize-Label</a> dynamisch verkleinert werden.</li>
      <li>Es kann nicht mehr als eine Statusleiste in einem Fenster vorhanden sein.</li>
    </ol>
    <p><strong>Beispiel</strong>: Im unteren Bereich der <a href="TreeView.htm#Examples">TreeView-Seite</a> wird eine Statusleiste mit mehreren Bereichen demonstriert.</p>
    <h2 id="ActiveX">ActiveX <span class="ver">[v1.1.03+]</span></h2>
    <p>ActiveX-Komponenten wie das MSIE-Browser-Steuerelement k&ouml;nnen wie folgt eingebettet werden:</p>
    <pre>Gui Add, ActiveX, w980 h640 vWB, <a href="http://msdn.microsoft.com/en-us/library/aa752085">Shell.Explorer</a>  <em>; Der letzte Parameter ist der Name der ActiveX-Komponente.</em>
WB.<a href="http://msdn.microsoft.com/en-us/library/aa752093">Navigate</a>("http://www.autohotkey.com/forum/")  <em>; Speziell f&uuml;r das Web-Browser-Steuerelement.</em>
Gui Show</pre>
    <p>Sobald das Steuerelement erstellt ist, wird ein ActiveX-Objekt in die zugewiesenen Variable des Steuerelements gespeichert, falls vorhanden. Zudem kann <a href="GuiControlGet.htm">GuiControlGet</a> verwendet werden, um das Objekt abzurufen.</p>
    <p>Damit die Ereignisse des Objekts bearbeitet werden k&ouml;nnen, verwendet <a href="ComObjConnect.htm">ComObjConnect</a> wie unten gezeigt:</p>
    <pre>Gui Add, Edit, w930 r1 vURL, http://www.autohotkey.com/forum/
Gui Add, Button, x+6 yp w44 Default, Laden
Gui Add, ActiveX, xm w980 h640 vWB, Shell.Explorer
<strong>ComObjConnect</strong>(WB, WB_events)  <em>; Verbindet die WB-Ereignisse mit dem Klassenobjekt WB_events.</em>
Gui Show
<em>; Fortfahren, um die Startseite zu laden:</em>
ButtonLaden:
Gui Submit, NoHide
WB.Navigate(URL)
return

class WB_events
{
    <a href="http://msdn.microsoft.com/en-us/library/aa768334">NavigateComplete2</a>(wb, NewURL)
    {
        GuiControl,, URL, %NewURL%  <em>; URL-Eingabefeld aktualisieren.</em>
    }
}

GuiClose:
ExitApp</pre>
    <p><a href="ComObjType.htm">ComObjType</a> kann verwendet werden, um den Typ des Objekts zu bestimmen, das in der Variable des Steuerelements gespeichert ist.</p>
    <h2>Verwandte Seiten</h2>
    <p><a href="ListView.htm">ListView</a>, <a href="TreeView.htm">TreeView</a>, <a href="Gui.htm">Gui</a>, <a href="GuiControl.htm">GuiControl</a>, <a href="GuiControlGet.htm">GuiControlGet</a>, <a href="Menu.htm">Menu</a></p>
  </div>
</div>
</body>
</html>