<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>GUI-Steuerelementarten</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<style type="text/css">
<!--
h1 {font-size: 200%;}
hr {margin-bottom: 0em;}
-->
</style>
</head>
<body>

<h1><a href="Gui.htm">GUI</a>-Steuerelementarten</h1>

<h2>Inhaltsverzeichnis</h2>
<ul>
  <li><a href="#Text">Text</a>, <a href="#Edit">Edit</a>, <a href="#UpDown">UpDown</a>, <a href="#Picture">Picture</a></li>
  <li><a href="#Button">Button</a>, <a href="#Checkbox">Checkbox</a>, <a href="#Radio">Radio</a></li>
  <li><a href="#DropDownList">DropDownList</a>, <a href="#ComboBox">ComboBox</a></li>
  <li><a href="#ListBox">ListBox</a>, <a href="ListView.htm">ListView</a>, <a href="TreeView.htm">TreeView</a></li>
  <li><a href="#Hotkey">Hotkey</a>, <a href="#DateTime">DateTime</a>, <a href="#MonthCal">MonthCal</a></li>
  <li><a href="#Slider">Slider</a>, <a href="#Progress">Progress</a></li>
  <li><a href="#GroupBox">GroupBox</a>, <a href="#Tab">Tab2</a>, <a href="#StatusBar">StatusBar</a></li>
  <li><a href="#ActiveX">ActiveX</a> (z. B. Internet Explorer Control)</li>
</ul>

<h2 id="Text">Text</h2>
<p>Beschreibung: Ein Bereich mit randlosem Text, den der Benutzer nicht bearbeiten kann. Oft verwendet, um andere Steuerelemente zu bezeichnen.</p>
<pre>Beispiel: Gui, Add, Text,, Bitte Name eingeben:</pre>
<p>In diesem Fall ist der letzte Parameter der String, welcher angezeigt werden soll. Der String kann LF-Zeichen (`n) enthalten, um neue Zeilen zu beginnen. Au&szlig;erdem kann eine lange Zeile in mehreren kurzen Zeilen mit einem <a href="../Scripts.htm#continuation">Fortsetzungsbereich</a> aufgetrennt werden.</p>
<p>Wenn eine Breite (W) in den <em>Optionen</em> angegeben ist, aber keine <a href="Gui.htm#R">Zeilen (R)</a> oder H&ouml;he (H), dann erfolgt wie vorgesehen automatischer Zeilenumbruch und die H&ouml;he des Steuerelements wird automatisch gesetzt.</p>
<p>Da der Inhalt des Steuerelements im letzten Parameter des GUI-Befehls ist, m&uuml;ssen direkte Kommas nicht gesch&uuml;tzt werden. Das gilt auch f&uuml;r den letzten Parameter von allen anderen Befehlen.</p>
<p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Damit wird das Label <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer auf den Text klickt. Beispielsweise kann damit ein unterstrichener, blauer Hyperlink simuliert werden:</p>
<pre>Gui, Font, underline
Gui, Add, Text, cBlue gLaunchGoogle, Hier klicken, um Google zu starten.
Gui, Font, norm
Gui, Show
Return

LaunchGoogle:
Run www.google.com
Return</pre>
<p>Ein Doppelklick kann erkannt werden, wenn &uuml;berpr&uuml;ft wird, ob <a href="../Variables.htm#GuiEvent">A_GuiEvent</a> das Wort DoubleClick enth&auml;lt.</p>
<p>Das kaufm&auml;nnische Und (&) kann im Text verwendet werden, um einen Buchstaben zu unterstreichen. Zum Beispiel:</p>
<pre>Gui, Add, Text,, &First Name:
Gui, Add, Edit</pre>
<p>Im obigen Beispiel wird der Buchstabe F unterstrichen, d. h. der Benutzer kann die <a href="Gui.htm#ShortcutKey">Tastenkombination</a> Alt+F benutzen, um den Tastaturfokus auf das erste eingabef&auml;hige Steuerelement zu setzen, welches nach dem Text-Steuerelement hinzugef&uuml;gt wurde. Um stattdessen ein kaufm&auml;nnisches Und direkt anzuzeigen, verwendet zwei aufeinanderfolgende kaufm&auml;nnische Und-Zeichen (&&). Um die spezielle Behandlung der kaufm&auml;nnischen Und-Zeichen zu deaktivieren, f&uuml;gt <a href="../misc/Styles.htm#SS_NOPREFIX">0x80</a> in den Optionen des Steuerelements ein.</p>
<p>Siehe <a href="Gui.htm#OtherOptions">allgemeine Optionen</a> f&uuml;r weitere Optionen (z. B. <em>Right</em>, <em>Center</em> und <em>Hidden</em>). Siehe auch: <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
<h2 id="Edit">Edit</h2>
<p>Beschreibung: Ein Bereich, der mit freiem Text vom Benutzer beschrieben werden kann.</p>
<pre>Beispiel: Gui, Add, Edit, r9 vEigenesEdit, Text erscheint innerhalb des Edit-Steuerelements (Lasst diesen Parameter weg, um anfangs leer zu sein).</pre>
<p>Das Steuerelement wird mehrzeilig, falls der Text mehrere Zeilen hat. Mit r3 in den <em>Optionen</em> wird zum Beispiel ein dreizeiliges Edit-Steuerelement mit den folgenden Standardeigenschaften erstellt: eine vertikale Bildlaufleiste, automatischer Zeilenumbruch und Abfangen der Entertaste bei der Eingabe anstatt Ausl&ouml;sen der <a href="#DefaultButton">Standard-Schaltfl&auml;che</a> im Fenster.</p>
<p>Um eine neue Zeile in einem mehrzeiligen Edit-Steuerelement zu beginnen, f&uuml;gt im letzten Parameter (Inhalte) ein LF-Zeichen (`n) oder das Paar CR+LF (`r`n) ein. Beide Methoden erzeugen direkt vorhandene CR+LF-Paare (`r`n) innerhalb des Edit-Steuerelements. Wenn jedoch das Steuerelement mittels <a href="Gui.htm#Submit">Gui Submit</a> oder <a href="GuiControlGet.htm">GuiControlGet</a> in die dazugeh&ouml;rige Variable gespeichert wird, dann wird immer jedes CR+LF-Paar (`r`n) in ein LF-Zeichen (`n) umgewandelt. Um Text in eine Datei zu speichern, befolgt dieses Beispiel: <a href="FileAppend.htm">FileAppend</a>, %EigenesEdit%, C:\Saved File.txt</p>
<p>Wenn im Steuerelement automatischer Zeilenumbruch aktiviert ist (Standard bei mehrzeiligen Edit-Steuerelementen), dann erzeugt jeglicher Umbruch, der bei der Benutzereingabe entsteht, keine LF-Zeichen (nur die Entertaste ist dazu f&auml;hig).</p>
<p>Mehrzeilige Edit-Steuerelemente in Windows 95/98/Me sind auf 64 KB Text begrenzt, ab Windows NT/2k/XP jedoch auf ca. 4 GB. Sobald der Benutzer Text eingibt, wird mehr Speicher nach Bedarf zugewiesen.</p>
<p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Damit wird das Label <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Inhalt des Steuerelements ge&auml;ndert wird.</p>
<p>TIPP: Um eine Textdatei in ein Edit-Steuerelement zu laden, verwendet <a href="FileRead.htm">FileRead</a> und <a href="GuiControl.htm">GuiControl</a>. Zum Beispiel:</p>
<pre>Gui, Add, Edit, R20 vEigenesEdit
FileRead, FileContents, C:\Eigene Datei.txt
GuiControl,, EigenesEdit, %FileContents%</pre>
<p><strong>Edit-Optionen</strong> (um eine Option zu entfernen, setzt ein Minuszeichen davor):</p>
<span class="green">Limit</span>: Beschr&auml;nkt die Eingabe des Benutzers auf die Breite des sichtbaren Eingabefelds. Alternativ kann auch direkt danach eine Zahl angegeben werden, um die Eingabe auf eine bestimmte Anzahl an Zeichen zu begrenzen. Mit Limit10 beispielsweise k&ouml;nnen nicht mehr als 10 Zeichen eingegeben werden.
<p><span class="green">Lowercase</span>: Die eingegebenen Zeichen vom Benutzer werden automatisch in Kleinbuchstaben umgewandelt.</p>
<p><span class="green"><a name="EditMulti" id="EditMulti"></a>Multi</span>: Erm&ouml;glicht mehrere Textzeilen. Allerdings ist die Angabe normalerweise nicht n&ouml;tig, weil es automatisch erkannt wird, basierend auf H&ouml;he (H), <a href="Gui.htm#R">Zeilen (R)</a> oder Inhalt (<em>Text</em>).</p>
<p><span class="green"><a name="EditNum"></a>Number</span>: Verhindert, dass der Benutzer etwas anderes als Zahlen in das Feld eingeben kann (allerdings ist es noch m&ouml;glich, Nicht-Zahlen einzuf&uuml;gen). Als alternativer Weg kann die numerische Eingabe mit dem <a href="#UpDown">UpDown</a>-Steuerelement erzwungen werden.</p>
<p><span class="green">Password</span>: Versteckt die Eingabe des Benutzers (wie bei einer Passworteingabe) durch das Ersetzen der Zeichen mit dem Maskierungszeichen. Wenn ein benutzerdefiniertes Maskierungszeichen gew&uuml;nscht ist, f&uuml;gt es direkt nach dem Wort Password an. Password* beispielsweise ersetzt den schwarzen Kreis (standardm&auml;&szlig;ig in Windows XP) mit einem Sternchen. Hinweis: Diese Option hat keine Auswirkung auf mehrzeilige Edit-Steuerelemente.</p>
<p><span class="green">ReadOnly</span>: Verhindert, dass der Benutzer den Inhalt des Steuerelements &auml;ndern kann. Allerdings kann der Text noch gescrollt, markiert und in die Zwischenablage kopiert werden.</p>
<p><span class="green">Tn</span>: Mit dem Buchstaben T k&ouml;nnen Tabstopps innerhalb eines <a href="#EditMulti">mehrzeiligen Edit-Steuerelements</a> gesetzt werden (da Tabstopps die Spaltenpositionen der springenden direkten TAB-Zeichen abrufen, k&ouml;nnen sie dazu verwendet werden, den Text in Spalten zu formatieren). Wenn der Buchstabe T nicht verwendet wird, dann werden die Tabstopps alle 32 DLU (Dialogeinheit) gesetzt (die Breite jeder DLU wird vom Betriebssystem bestimmt). Wenn der Buchstabe T nur einmal verwendet wird, dann werden die Tabstopps auf je <strong>n</strong> Einheiten &uuml;ber die gesamte Breite des Steuerelements verteilt. Mit <em>Gui, Add, Edit, vEigenesEdit r16 t64</em> beispielsweise wird die Standard-Distanz zwischen den Tabstopps verdoppelt. Um benutzerdefinierte Tabstopps zusetzen, verwendet den Buchstaben T wie im folgenden Beispiel mehrfach: <em>Gui, Add, Edit, vEigenesEdit r16 t8 t16 t32 t64 t128</em>. Ein Tabstopp ist jeweils eine absolute Spaltenposition in der Liste, bis zu einem Maximum von 50 Tabstopps. Hinweis: Tabstopps erfordern ein mehrzeiliges Edit-Steuerelement.</p>
<p><span class="green">Uppercase</span>: Die eingegebenen Zeichen vom Benutzer werden automatisch in Gro&szlig;buchstaben umgewandelt.</p>
<p><span class="green">WantCtrlA</span> <span class="ver">[v1.0.44+]:</span> Mit -WantCtrlA wird der Benutzer daran gehindert, den ganzen Text mit Steuerung+A im Edit-Steuerelement zu markieren.</p>
<p><span class="green"><a name="WantReturn"></a>WantReturn</span>: Mit -WantReturn erkennt ein mehrzeiliges Edit-Steuerelement nicht die Entertaste. Das Dr&uuml;cken der Entertaste ist dann das gleiche wie das Dr&uuml;cken der <a href="#DefaultButton">Standard-Schaltfl&auml;che</a> im Fenster (falls vorhanden). In diesem Fall kann der Benutzer Steuerung+Enter benutzen, um eine neue Zeile zu beginnen.</p>
<p><span class="green">WantTab</span>: Bei einer Tabulatoreingabe wird ein Tabulator-Zeichen erzeugt und nicht zum n&auml;chsten Steuerelement navigiert. Ohne diese Option kann der Benutzer die Tastenkombination Steuerung+Tab verwenden, um ein Tab-Zeichen in einem mehrzeiligen Edit-Steuerelement zu erzeugen. Hinweis: Obwohl <em>WantTab</em> auch in einem einzeiligen Edit-Steuerelement funktioniert, werden Tab-Zeichen als ein leeres Box-Zeichen angezeigt (gelten aber weiterhin als wahre Tab-Zeichen).</p>
<p><span class="green">-Wrap</span>: Deaktiviert automatischen Zeilenumbruch in einem mehrzeiligen Edit-Steuerelement. Da dieser Style nicht ge&auml;ndert werden kann, nachdem das Steuerelement erstellt wurde, verwendet eine folgende Methode: 1) <a href="Gui.htm#Destroy">Destroy</a> verwenden, danach Fenster und deren Steuerelemente neu erstellen; oder 2) Zwei &uuml;bereinander liegende Edit-Steuerelemente erstellen, eins mit aktiviertem Zeilenumbruch, das andere ohne. Der zurzeit nicht verwendet wird, bleibt leer und/oder versteckt.</p>
<p>Siehe <a href="Gui.htm#OtherOptions">allgemeine Optionen</a> f&uuml;r weitere Optionen (z. B. <em>Right</em>, <em>Center</em> und <em>Hidden</em>). Siehe auch: <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
<p><strong>Ein besseres Edit-Steuerelement:</strong> HiEdit ist ein freies Edit-Steuerelement mit mehreren Tabs und f&uuml;r gro&szlig;e Dateien, welches sehr wenig Speicher verbraucht. Es kann sowohl Text- als auch Bin&auml;rdateien bearbeiten. F&uuml;r Details siehe <a href="http://www.autohotkey.com/forum/topic19141.html">www.autohotkey.com/forum/topic19141.html</a></p>
<h2 id="UpDown">UpDown</h2>
<p>Beschreibung: Ein Paar Pfeiltasten, die der Benutzer verwenden kann, um einen Wert zu erh&ouml;hen oder zu verringern. Standardm&auml;&szlig;ig f&uuml;gt sich ein UpDown-Steuerelement automatisch an das zuvor hinzugef&uuml;gte Steuerelement an. Dieses vorherige Steuerelement ist auch als <em>Buddy-Steuerelement</em> bekannt. Das bekannteste Beispiel daf&uuml;r ist der "Spinner" (Drehrad), ein UpDown-Steuerelement, verbunden mit einem <a href="#Edit">Edit-Steuerelement</a>. Zum Beispiel:</p>
<pre>Gui, Add, Edit
Gui, Add, UpDown, vEigenesUpDown Range1-10, 5</pre>
<p>Im obigen Beispiel ist das Edit-Steuerelement das Buddy-Steuerelement von UpDown. Sobald der Benutzer eine Pfeiltaste verwendet, wird die Zahl im Edit-Steuerelement automatisch erh&ouml;ht oder verringert.</p>
<p>Ein Buddy-Steuerelement von UpDown kann auch ein <a href="#Text">Text</a>- oder <a href="#ListBox">ListBox</a>-Steuerelement sein. Aufgrund von Beschr&auml;nkungen des Betriebssystems funktionieren andere Steuerelemente (z. B. ComboBox und DropDownList) nicht richtig mit <a href="Gui.htm#label">g-Labels</a> und andere Funktionen.</p>
<p>Die Anfangsposition des UpDown-Steuerelements kann im letzten Parameter angegeben werden (wenn nicht vorhanden, dann bei 0 oder bei der Zahl im zul&auml;ssigen Bereich, die am n&auml;chsten an der Null ist).</p>
<p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, dann wird mit der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) die numerische Position des UpDown-Steuerelements abgerufen. Wenn das UpDown-Steuerelement mit einem Edit-Steuerelement verbunden ist und der Benutzer die Eingabe nicht &uuml;berpr&uuml;fen will, dann ist es am besten, den Wert des UpDown-Steuerelements zu verwenden. Denn das UpDown-Steuerelement &uuml;bergibt immer eine Zahl in einem g&uuml;ltigen Bereich, selbst wenn der Benutzer keine Zahl oder eine Zahl au&szlig;erhalb des Bereichs im Edit-Steuerelement eingegeben hat. Zus&auml;tzlich werden Zahlen mit mehr als 3 Stellen standardm&auml;&szlig;ig mit einem <a href="../misc/Styles.htm#UpDownSep">Tausender-Trennzeichen</a> (z. B. Komma) ausgegeben. Diese Trennzeichen werden aber nur in der Ausgabevariable des Edit-Steuerelements gespeichert.</p>
<p>Wenn das UpDown-Steuerelement ein <a href="Gui.htm#label">g-Label</a> hat, dann wird es ausgef&uuml;hrt, sobald der Benutzer eine Pfeil-Schaltfl&auml;che oder Pfeiltaste auf der Tastatur dr&uuml;ckt. Jeder Start von g-Label speichert auch die Position des UpDown-Steuerelements in die <a href="Gui.htm#var">zugewiesene Ausgangsvariable</a> (falls vorhanden).</p>
<p><strong>UpDown-Optionen:</strong></p>
<p><span class="green"><a name="Horz"></a>Horz</span>: Erm&ouml;glicht links/rechts Pfeiltasten, anstatt oben/unten. Standardm&auml;&szlig;ig isoliert <em>Horz</em> auch das Steuerelement (kein Buddy). Das kann mit <em>Horz 16</em> in den Optionen des Steuerelements &uuml;berschrieben werden.</p>
<p><span class="green">Left</span>: Setzt das UpDown-Steuerelement an die linke Seite des Buddy Control, anstatt an die rechte Seite.</p>
<p><span class="green">Range</span>: Bestimmt einen benutzerdefinierten Bereich (standardm&auml;&szlig;ig von 0 bis 100). Nach dem Wort Range erfolgt der Minimalwert, ein Bindestrich und der Maximalwert. Zum Beispiel: Range1-1000 erm&ouml;glicht eine Zahl zwischen 1 und 1000, Range-50-50 eine Zahl zwischen -50 und 50 und Range-10--5 eine Zahl zwischen -10 und -5. Die Minimal- und Maximalwerte k&ouml;nnen vertauscht werden, um die Pfeile in die entgegengesetzte Richtung zu verschieben. Der breiteste zul&auml;ssige Bereich ist von -2147483648 bis 2147483647. Allerdings ben&ouml;tigen Windows 95 und NT4 Internet Explorer 5.0 oder h&ouml;her, um einen breiteren Bereich als -32.767 bis 32.767 zu unterst&uuml;tzen. Wenn das Buddy-Steuerelement eine <a href="#ListBox">ListBox</a> ist, dann wird ein Standardbereich von 32767 bis 0 f&uuml;r vertikale und das Umgekehrte f&uuml;r horizontale Steuerelemente (<a href="#Horz">Horz</a>) verwendet.</p>
<p><span class="green">Wrap</span>: Das Steuerelement springt auf das entgegengesetzte Ende des Bereichs, wenn der Minimal- oder Maximalwert &uuml;berschritten wird. Ohne <em>Wrap</em> stoppt das Steuerelement, wenn der Minimal- oder Maximalwert erreicht ist.</p>
<p><span class="green">-16</span>: Ein vertikales UpDown-Steuerelement wird isoliert, d. h. es hat kein Buddy Control. Somit ber&uuml;cksichtigt das Steuerelement auch jede angegebene Breite, H&ouml;he und Position, anstatt sich nach der Gr&ouml;&szlig;e des Buddy-Steuerelements zu richten. Dar&uuml;ber hinaus merkt sich ein isoliertes UpDown-Steuerelement intern die eigene Position. Diese Position kann beispielsweise mit <a href="Gui.htm#Submit">Gui Submit</a> abgerufen werden.</p>
<p><span class="green"><a name="UpDownSep"></a>0x80</span>: Mit 0x80 in den <em>Optionen</em> werden die Tausender-Trennzeichen weggelassen, die normalerweise jeweils zwischen drei Dezimalstellen im Buddy-Steuerelement vorkommen. Dieser Style wird normalerweise nicht verwendet, weil die Trennzeichen von den Nummern weggelassen werden, sobald es vom UpDown-Steuerelement selbst abgerufen wird (statt vom Buddy-Steuerelement).</p>
<p><span class="green">Beliebige Schrittweite</span>: In <a href="http://numeric.nerim.net/AutoHotkey/Scripts/UpDown%20-%20Non-unitary%20increments.ahk">diesem Script</a> von NumEric wird veranschaulicht, wie die Schrittweite des UpDown-Steuerelements ge&auml;ndert werden kann (z. B. 5 oder 0.1).</p>
<p>Siehe auch: <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
<h2 id="Picture">Picture (oder Pic)</h2>
<p>Beschreibung: Ein Bereich mit einem Bild (siehe die letzten beiden Abs&auml;tze f&uuml;r unterst&uuml;tzte Dateitypen). Der letzte Parameter enth&auml;lt den Dateinamen des Bildes, das sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis befindet, solange kein absoluter Pfad angegeben ist.</p>
<pre>Beispiel: Gui, Add, Picture, w300 h-1, C:\Eigene Bilder\Company Logo.gif</pre>
<p>Um die aktuelle Breite und/oder H&ouml;he des Bildes zu erhalten, lasst die Optionen W und/oder H weg. Ansonsten wird das Bild auf die angegebene Breite und/oder H&ouml;he skaliert (diese Breite und H&ouml;he bestimmt auch, welches Icon von einer .ICO-Datei mit mehreren Icons geladen wird). Um das Bild unter Beibehaltung des Seitenverh&auml;ltnisses zu verkleinern oder zu vergr&ouml;&szlig;ern, verwendet -1 f&uuml;r eine Abmessung und eine positive Zahl f&uuml;r die andere Abmessung. Mit "w200 h-1" beispielsweise wird die Breite des Bildes auf 200 Pixel gesetzt und die H&ouml;he automatisch eingestellt. Wenn das Bild nicht geladen oder angezeigt werden kann (z. B. Datei nicht gefunden), wird das Steuerelement leer gelassen und die Breite und H&ouml;he auf Null gesetzt.</p>
<p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Damit wird <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer auf das Bild klickt. Ein Doppelklick kann erkannt werden, wenn &uuml;berpr&uuml;ft wird, ob <a href="../Variables.htm#GuiEvent">A_GuiEvent</a> das Wort DoubleClick enth&auml;lt.</p>
<p>Um das Bild als Hintergrund f&uuml;r andere Steuerelemente zu verwenden, f&uuml;gt es davor ein. Wenn allerdings diese Steuerelemente eingabef&auml;hig sind und das Bild ein <a href="Gui.htm#label">g-Label</a> hat, dann erstellt das Bild erst nach diesen Steuerelementen und f&uuml;gt 0x4000000 (WS_CLIPSIBLINGS) zu den <em>Optionen</em> des Bildes hinzu. Mit diesem Trick kann das Bild auch der Hintergrund eines <a href="#Tab">Tab</a>- oder <a href="ListView.htm">ListView</a>-Steuerelements sein.</p>
<p><strong>Icon, Cursor und animierte Cursor</strong>: Icon und Cursor k&ouml;nnen von folgenden Dateitypen geladen werden: ICO, CUR, ANI, EXE, DLL, CPL, SCR und andere Typen, die Icon-Ressourcen enthalten. Um eine beliebige Icon-Gruppe in einer Datei zu verwenden, f&uuml;gt in den <em>Optionen</em> das Wort Icon ein, gefolgt von der Gruppennummer. Im folgenden Beispiel wird das Standard-Icon aus der zweiten Icon-Gruppe verwendet: <em>Gui, Add, Picture, Icon2, C:\Eigene Anwendung.exe</em></p>
<p><a name="PicAltSubmit"></a>Mit AltSubmit in den <em>Optionen</em> wird die Datei GDIPlus.dll von Microsoft verwendet, um das Bild laden, welches zu unterschiedlichen Ergebnissen bei der Anzeige von GIF-, BMP- und Icon-Bilder f&uuml;hrt. Damit wird beispielsweise ein ICO/GIF-Bild mit transparentem Hintergrund zu einer transparenten Bitmap, bei der die Option <a href="Gui.htm#BackgroundTrans">BackgroundTrans</a> in Effekt treten kann. Wenn GDIPlus nicht verf&uuml;gbar ist (siehe n&auml;chster Absatz), dann wird AltSubmit ignoriert und das Bild mit der normalen Methode geladen.</p>
<p>Alle Betriebssysteme unterst&uuml;tzen GIF, JPG, BMP, ICO, CUR und ANI-Bilder. In Windows XP (oder h&ouml;her) werden zus&auml;tzliche Bildformate wie PNG, TIF, Exif, WMF und EMF unterst&uuml;tzt. Betriebssysteme &auml;lter als XP k&ouml;nnen unterst&uuml;tzt werden, wenn die freie GDIPlus.dll von Microsoft in den Ordner der AutoHotkey.exe kopiert wird (im Falle eines <a href="../Scripts.htm#ahk2exe">kompilierten Scripts</a> muss die DLL-Datei in den Ordner des Scripts). Um die DLL herunterzuladen, sucht in <a href="http://www.microsoft.com">www.microsoft.com</a> mit folgenden Begriffen: gdi redistributable</p>
<p>Aufgrund eines Fehlers in Windows 95/98/Me verursachen animierte Cursor, die gr&ouml;&szlig;er als 90x90 sind, einen Absturz des Scripts.</p>
<p><strong>Animierte GIF-Bilder</strong>: Animierte GIF-Dateien k&ouml;nnen auch in einem Bild-Steuerelement angezeigt werden, sie werden jedoch nicht animiert. Zur L&ouml;sung dieses Problems kann die AniGIF.dll verwendet werden (die frei ist f&uuml;r nicht-kommerzielle Nutzung), siehe <a href="http://www.autohotkey.com/forum/topic19264.html">www.autohotkey.com/forum/topic19264.html</a></p>
<h2 id="Button">Button</h2>
<p>Beschreibung: Eine Schaltfl&auml;che, die gedr&uuml;ckt werden kann, um eine Aktion auszul&ouml;sen.  In diesem Fall ist der letzte Parameter der Name der Schaltfl&auml;che (wird auf der Schaltfl&auml;che selbst angezeigt), wobei der Name LF-Zeichen (`n) enthalten kann, um neue Zeilen zu beginnen.</p>
<pre>Beispiel: Gui, Add, Button, Default, OK</pre>
<p><a name="DefaultButton"></a>Das obige Beispiel enth&auml;lt das Wort <span class="green">Default</span> in den <em>Optionen</em>, damit wird "OK" zur Standard-Schaltfl&auml;che. Die Aktion der Standard-Schaltfl&auml;che wird automatisch ausgel&ouml;st, sobald der Benutzer die Entertaste dr&uuml;ckt, es sei denn, der Tastatur-Fokus liegt auf einer anderen Schaltfl&auml;che oder ein mehrzeiliges Edit-Steuerelement hat den <a href="#WantReturn">WantReturn</a>-Style. Um sp&auml;ter die Standard-Schaltfl&auml;che zu wechseln, siehe folgendes Beispiel: <em><a href="GuiControl.htm">GuiControl</a>, +default, Cancel</em>. Damit das Fenster sp&auml;ter keine Standard-Schaltfl&auml;che hat, siehe folgendes Beispiel: <em>GuiControl, -default, OK</em></p>
<p>Das kaufm&auml;nnische Und (&) kann im Namen verwendet werden, um einen Buchstaben zu unterstreichen. Zum Beispiel:</p>
<pre>Gui, Add, Button,, &Pause</pre>
<p>Im obigen Beispiel wird der Buchstabe P unterstrichen und erm&ouml;glicht dem Benutzer, Alt+P als <a href="Gui.htm#ShortcutKey">Tastenkombination</a> zu verwenden. Um stattdessen ein kaufm&auml;nnisches Und direkt anzuzeigen, verwendet zwei aufeinanderfolgende kaufm&auml;nnische Und-Zeichen (&&).</p>
<p>Wenn der Schaltfl&auml;che ein eindeutiges <a href="Gui.htm#label">g-Label</a> fehlt, dann wird automatisch ein Label zugewiesen. Wenn zum Beispiel das erste GUI-Fenster eine OK-Schaltfl&auml;che enth&auml;lt, dann wird das ButtonOK-Label (falls vorhanden) ausgef&uuml;hrt, wenn die Schaltfl&auml;che gedr&uuml;ckt wird. Label von anderen GUI-Fenstern <a href="Gui.htm#MultiWin">mit Ausnahme des ersten GUI's</a> beinhalten zus&auml;tzlich die Fensternummer, zum Beispiel: 2ButtonOK.</p>
<p>Wenn der Text auf der Schaltfl&auml;che Leerzeichen oder andere Zeichen (<strong>&`r`n`t`</strong>) enth&auml;lt, dann werden automatisch diese Zeichen weggelassen. Zum Beispiel hat die Schaltfl&auml;che mit der Bezeichnung "&Pause" automatisch das Label ButtonPause. Au&szlig;erdem hat die Schaltfl&auml;che "Save && Exit" das Label ButtonSaveExit (die zwei Und-Zeichen werden verwendet, um ein kaufm&auml;nnisches Und direkt darzustellen).</p>
<p>Bekannte Einschr&auml;nkung: Bei bestimmten Desktop-Designs wird der Text in den Schaltfl&auml;chen nicht richtig angezeigt. Wenn dies geschieht, versucht es mit der Option <em>-Wrap</em>. Allerdings wird dadurch auch verhindert, dass der Text mehrzeilig ist.</p>

<h2 id="Checkbox">Checkbox</h2>
<p>Beschreibung: Ein kleines K&auml;stchen, das markiert oder nicht markiert werden kann, um An/Aus, Ja/Nein, usw. zu repr&auml;sentieren.</p>
<pre>Beispiel: Gui, Add, Checkbox, vShipToBillingAddress, An Rechnungsadresse senden?</pre>
<p>Der letzte Parameter ist die Bezeichnung neben dem K&auml;stchen, die typischerweise als Aufforderung oder als Beschreibung dient. Der String kann LF-Zeichen (`n) enthalten, um neue Zeilen zu beginnen. Wenn eine Breite (W) in den <em>Optionen</em> angegeben ist, aber keine <a href="Gui.htm#R">Zeilen (R)</a> oder H&ouml;he (H), dann erfolgt wie Vorgesehen automatischer Zeilenumbruch und die H&ouml;he des Steuerelements wird automatisch gesetzt. Die <a href="Gui.htm#var">zugewiesene Ausgabevariable</a> der CheckBox (falls vorhanden) erh&auml;lt die Nummer 1 f&uuml;r markiert, 0 f&uuml;r nicht markiert, und -1 f&uuml;r grau/unbestimmt.</p>
<p>Mit dem Wort <span class="green">Check3</span> in den <em>Optionen</em> wird der dritte Status aktiviert und ein graues anstelle eines schwarzen H&auml;ckchens angezeigt (der graue Zustand zeigt an, dass die CheckBox weder markiert noch nicht markiert ist). Mit dem Wort <span class="green">Checked</span> oder <span class="green">CheckedGray</span> in den <em>Optionen</em> hat die CheckBox anfangs jeweils ein schwarzes oder graues H&auml;kchen. Nach dem Wort Checked kann auch eine 0, 1 oder -1 f&uuml;r den Anfangsstatus erfolgen. Das hei&szlig;t, dass "Checked" und "Checked%VarMitEins%" identisch sind.</p>
<p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Damit wird <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer auf die CheckBox klickt oder es &auml;ndert.</p>
<p>Bekannte Einschr&auml;nkung: Bei bestimmten Desktop-Designs wird der Text in den Schaltfl&auml;chen nicht richtig angezeigt. Wenn dies geschieht, versucht es mit der Option <em>-Wrap</em>. Allerdings wird dadurch auch verhindert, dass der Text mehrzeilig ist.</p>
<h2 id="Radio">Radio</h2>
<p>Die Radio-Schaltfl&auml;che ist ein kleiner leerer Kreis, dass markiert (An) oder nicht markiert (Aus) werden kann.</p>
<pre>Beispiel: Gui, Add, Radio, vEigeneRadioGruppe, Auf alle Artikel im Lager warten, bevor sie abgeschickt werden.</pre>
<p>Diese Steuerelemente befinden sich normalerweise in <em>Radio-Gruppen</em>, welche 2 oder mehr Radio-Schaltfl&auml;chen enthalten. Wenn der Benutzer auf eine Radio-Schaltfl&auml;che klickt, um es zu aktivieren, dann werden alle anderen Radio-Schaltfl&auml;chen in der Gruppe automatisch deaktiviert (der Benutzer kann auch innerhalb einer Gruppe mit den Pfeiltasten navigieren). Eine Radio-Gruppe wird automatisch um alle fortlaufend hinzugef&uuml;gten Radio-Schaltfl&auml;chen erstellt. Um eine neue Gruppe zu beginnen, verwendet das Wort <span class="green">Group</span> in den <em>Optionen</em> der ersten Schaltfl&auml;che der neuen Gruppe - oder f&uuml;gt einfach ein anderes Steuerelement ein, dass automatisch eine neue Gruppe startet.</p>
<p>Im letzten Parameter kann die Bezeichnung der Radio-Schaltfl&auml;che angegeben werden. Diese Bezeichnung wird typischerweise als Aufforderung oder als Beschreibung verwendet und kann LF-Zeichen (`n) enthalten, um neue Zeilen zu beginnen. Wenn eine Breite (W) in den <em>Optionen</em> angegeben ist, aber keine Zeilen (R) oder H&ouml;he (H), dann erfolgt wie Vorgesehen automatischer Zeilenumbruch und die H&ouml;he des Steuerelements wird automatisch gesetzt.</p>
<p>Mit dem Wort <span class="green">Checked</span> in den <em>Optionen</em> wird die Schaltfl&auml;che anfangs aktiviert. Nach dem Wort Checked kann auch eine 0 oder 1 f&uuml;r den Anfangsstatus erfolgen: 0 f&uuml;r markiert und 1 f&uuml;r nicht markiert. Das hei&szlig;t, dass "Checked" und "Checked%VarMitEins%" identisch sind.</p>
<p>Die <a href="Gui.htm#var">zugewiesene Ausgabevariable</a> der Radio-Schaltfl&auml;che (falls vorhanden) erh&auml;lt die Nummer 1 f&uuml;r markiert und 0 f&uuml;r nicht markiert. Wenn jedoch nur eine Schaltfl&auml;che in einer Radio-Gruppe eine Variable hat, dann ruft diese Variable stattdessen wird die Nummer der aktuell ausgew&auml;hlten Schaltfl&auml;che ab: 1 ist die erste Radio-Schaltfl&auml;che (nach urspr&uuml;nglicher Erstellungsreihenfolge), 2 die Zweite und so weiter. Wenn keine Schaltfl&auml;che markiert ist, wird 0 gespeichert.</p>
<p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Damit wird <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer die Schaltfl&auml;che aktiviert. Im Gegensatz zum Modus mit einer Variable muss das g-Label f&uuml;r jede Schaltfl&auml;che in einer Radio-Gruppe festgelegt werden. Damit wird Flexibilit&auml;t gew&auml;hrleistet, Klicks von bestimmten Schaltfl&auml;chen zu ignorieren. Ein Doppelklick kann erkannt werden, wenn &uuml;berpr&uuml;ft wird, ob <a href="../Variables.htm#GuiEvent">A_GuiEvent</a> das Wort DoubleClick enth&auml;lt.</p>
<p>Bekannte Einschr&auml;nkung: Bei bestimmten Desktop-Designs wird der Text in den Schaltfl&auml;chen nicht richtig angezeigt. Wenn dies geschieht, versucht es mit der Option <em>-Wrap</em>. Allerdings wird dadurch auch verhindert, dass der Text mehrzeilig ist.</p>
<h2 id="DropDownList">DropDownList (oder DDL)</h2>
<p>Beschreibung: Eine Auswahlliste, die angezeigt wird, wenn eine kleine Schaltfl&auml;che gedr&uuml;ckt wird.  In diesem Fall ist der letzte Parameter eine Auswahlliste, deren Eintr&auml;ge durch senkrechte Striche getrennt werden (z. B. Auswahl1|Auswahl2 |Auswahl3).</p>
<pre>Beispiel: Gui, Add, DropDownList, vColorChoice, Schwarz|Wei&szlig;|Rot|Gr&uuml;n|Blau</pre>
<p>Mit zwei senkrechten Strichen danach wird ein Eintrag vorausgew&auml;hlt (z. B. Rot|Gr&uuml;n||Blau). Alternativ kann mit dem Wort <span class="green">Choose</span> in den <em>Optionen</em>, unmittelbar gefolgt von der Nummer, ein Eintrag sofort vorausgew&auml;hlt werden. Mit Choose5 beispielsweise wird der f&uuml;nfte Eintrag vorausgew&auml;hlt (wie bei anderen Optionen, kann es auch eine Variable wie zum Beispiel Choose%Var% sein). Nachdem das Steuerelement erstellt wurde, kann mit <a href="GuiControl.htm">GuiControl</a> die Auswahl ge&auml;ndert oder Eintr&auml;ge in der Liste hinzugef&uuml;gt/entfernt werden.</p>
<p>Mit dem Wort <span class="green">Uppercase</span> oder <span class="green">Lowercase</span> in den <em>Optionen</em> werden alle Eintr&auml;ge in der Liste automatisch in Gro&szlig;-oder Kleinbuchstaben umgewandelt. Mit dem Wort <span class="green">Sort</span> wird der Inhalt der Liste automatisch alphabetisch sortiert (hat auch Auswirkung auf sp&auml;ter hinzugef&uuml;gte Eintr&auml;ge mittels <a href="GuiControl.htm">GuiControl</a>). Diese Option erm&ouml;glicht auch inkrementelle Suche, sobald die Liste aufgeklappt wird; damit wird ein Eintrag ausgew&auml;hlt, wenn die ersten Zeichen des Namens eingegeben werden.</p>
<p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, dann wird mit der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) der Text des zurzeit ausgew&auml;hlten Eintrags abgerufen. Wenn jedoch das Steuerelement die <a href="Gui.htm#AltSubmit">AltSubmit</a>-Eigenschaft hat, dann wird mit der Ausgabevariable stattdessen die Positionsnummer des Eintrags abgerufen (der erste Eintrag ist 1, der zweite 2 usw.).</p>
<p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Damit wird <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer einen neuen Eintrag ausw&auml;hlt.</p>
<p>Mit der <a href="Gui.htm#R">R- oder H-Option</a> kann die H&ouml;he der Aufklappliste kontrolliert werden. Mit R5 beispielsweise ist die Liste 5 Zeilen hoch. Wenn sowohl R als auch H weggelassen werden, dann wird die Liste automatisch erweitert, um die Vorteile der verf&uuml;gbaren Desktoph&ouml;he des Benutzers zu &uuml;bernehmen (allerdings zeigen Betriebssysteme &auml;lter als Windows XP standardm&auml;&szlig;ig 3 Zeilen).</p>
<p>Das Trennzeichen zwischen den Feldern muss nicht ein senkrechter Strich sein. Mit <a href="Gui.htm#Delimiter"><em>Gui +Delimiter`n</em></a> beispielsweise ist das Trennzeichen ein LF und mit <em>Gui +DelimiterTab</em> ein Tabulator (`t).</p>

<h2 id="ComboBox">ComboBox</h2>
<p>Beschreibung: Das Gleiche wie DropDownList, aber mit dem Unterschied, dass Text als Alternative zur Auswahl eines Eintrags aus der Liste eingegeben werden kann.</p>
<pre>Beispiel: Gui, Add, ComboBox, vColorChoice, Rot|Gr&uuml;n|Blau|Schwarz|Wei&szlig;</pre>
<p>Zus&auml;tzlich zu den gleichen Optionen wie bei DropDownList, kann mit dem Wort <span class="green">Limit</span> in den <em>Optionen</em> die Eingabe des Benutzers auf die sichtbare Breite des Edit-Steuerelements eingeschr&auml;nkt werden. Mit dem Wort <span class="green">Simple</span> verh&auml;lt sich die ComboBox wie ein Edit-Steuerelement mit einer ListBox darunter.</p>
<p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, dann wird mit der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) der Text des zurzeit ausgew&auml;hlten Eintrags abgerufen. Wenn jedoch das Steuerelement die <a href="Gui.htm#AltSubmit">AltSubmit</a>-Eigenschaft hat, dann wird mit der Ausgabevariable stattdessen die Positionsnummer des Eintrags abgerufen (der erste Eintrag ist 1, der zweite 2 usw.). In jedem Fall enth&auml;lt die Ausgabevariable den Inhalt des Edit-Steuerelements der ComboBox, wenn kein Eintrag ausgew&auml;hlt ist.</p>
<p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Damit wird <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer einen neuen Eintrag ausw&auml;hlt.</p>

<h2 id="ListBox">ListBox</h2>
<p>Beschreibung: Ein relativ hohes Feld mit einer Auswahlliste. In diesem Fall ist der letzte Parameter eine Auswahlliste, deren Eintr&auml;ge durch senkrechte Striche getrennt werden (z. B. Auswahl1|Auswahl2 |Auswahl3).</p>
<pre>Beispiel: Gui, Add, ListBox, vColorChoice, Rot|Gr&uuml;n|Blau|Schwarz|Wei&szlig;</pre>
<p><a name="ChooseLB"></a>Mit zwei senkrechten Strichen danach wird ein Eintrag (oder auch mehrere Eintr&auml;ge) vorausgew&auml;hlt (es wird die <a href="#ListBoxMulti">Multi</a>-Option ben&ouml;tigt, um mehrere Eintr&auml;ge auszuw&auml;hlen). Alternativ kann mit dem Wort <span class="green">Choose</span> in den <em>Optionen</em>, unmittelbar gefolgt von der Nummer, ein Eintrag sofort vorausgew&auml;hlt werden. Mit Choose5 beispielsweise wird der f&uuml;nfte Eintrag vorausgew&auml;hlt. Nachdem das Steuerelement erstellt wurde, kann mit <a href="GuiControl.htm">GuiControl</a> die Auswahl ge&auml;ndert oder Eintr&auml;ge in der Liste hinzugef&uuml;gt/entfernt werden.</p>
<p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, dann wird mit der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) der Text des zurzeit ausgew&auml;hlten Eintrags abgerufen. Wenn jedoch das Steuerelement die <a href="Gui.htm#AltSubmit">AltSubmit</a>-Eigenschaft hat, dann wird mit der Ausgabevariable stattdessen die Positionsnummer des Eintrags abgerufen (der erste Eintrag ist 1, der zweite 2 usw.).</p>
<p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Damit wird <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer einen neuen Eintrag ausw&auml;hlt. Sobald der Benutzer auf einen Eintrag doppelt klickt, enth&auml;lt die interne Variable A_GuiEvent den String DoubleClick anstelle von Normal. Au&szlig;erdem enth&auml;lt die Variable A_EventInfo die Position des Eintrags, dass doppelt geklickt wurde (1 ist der erste Eintrag, 2 der Zweite und so weiter).</p>
<p><a name="LBRedraw"></a>Wenn eine hohe Anzahl an Eintr&auml;gen hinzugef&uuml;gt wird, dann kann die Performance verbessert werden, indem <em>GuiControl, -Redraw, EigeneListBox</em> vor der Operation und <em>GuiControl, +Redraw, EigeneListBox</em> nach der Operation verwendet werden.</p>
<p><strong>ListBox-Optionen:</strong></p>
<p><span class="green">Choose</span>: Siehe <a href="#ChooseLB">oben</a>.</p>
<p><span class="green"><a name="ListBoxMulti"></a>Multi</span>: Damit k&ouml;nnen mehrere Eintr&auml;ge mittels Umschalt+Klick und Steuerung+Klick gleichzeitig ausgew&auml;hlt werden (mit der <a href="../misc/Styles.htm#LBS_MULTI">Nummer 8</a> anstelle dem Wort Multi k&ouml;nnen Eintr&auml;ge ohne Umschalt/Steuerung+Klick markiert werden). In diesem Fall speichert <a href="Gui.htm#Submit">Gui Submit</a> eine Liste mit Eintr&auml;gen in die <a href="Gui.htm#var">Ausgangsvariable</a> des Steuerelements, die durch senkrechte Striche getrennt werden. Wenn jedoch die Option <a href="Gui.htm#AltSubmit">AltSubmit</a> aktiv ist, dann speichert <a href="Gui.htm#Submit">Gui Submit</a> stattdessen eine Liste mit Eintragsnummern, die durch senkrechte Striche getrennt werden. 1|2|3 beispielsweise bedeutet, dass die ersten drei Eintr&auml;ge ausgew&auml;hlt sind. Um einzelne Eintr&auml;ge zu extrahieren, verwendet eine <a href="LoopParse.htm">Parsing-Schleife</a> wie in diesem Beispiel:</p>
<pre>Loop, parse, EigeneListBox, |
{
    MsgBox Auswahlnummer %A_Index% ist %A_LoopField%.
}</pre>
<p>Das Trennzeichen zwischen den Feldern muss nicht ein senkrechter Strich sein. Mit <a href="Gui.htm#Delimiter"><em>Gui +Delimiter`n</em></a> beispielsweise ist das Trennzeichen ein LF und mit <em>Gui +DelimiterTab</em> ein Tabulator (`t).</p>
<p><span class="green">ReadOnly</span>: Verhindert, dass die Eintr&auml;ge sichtbar hervorgehoben werden, wenn sie markiert werden (aber <a href="Gui.htm#Submit">Gui Submit</a> speichert weiterhin den ausgew&auml;hlten Eintrag).</p>
<p><span class="green">Sort</span>: Mit dem Wort Sort wird der Inhalt der Liste automatisch alphabetisch sortiert (hat auch Auswirkung auf sp&auml;ter hinzugef&uuml;gte Eintr&auml;ge mittels <a href="GuiControl.htm">GuiControl</a>). Diese Option erm&ouml;glicht auch inkrementelle Suche; damit wird ein Eintrag ausgew&auml;hlt, wenn die ersten Zeichen des Namens eingegeben werden.</p>
<p><span class="green">Tn</span>: Mit dem Buchstaben T k&ouml;nnen Tabstopps gesetzt werden, um den Text in Spalten zu formatieren. Wenn der Buchstabe T nicht verwendet wird, dann werden die Tabstopps alle 32 DLU (Dialogeinheit) gesetzt (die Breite jeder DLU wird vom Betriebssystem bestimmt). Wenn der Buchstabe T nur einmal verwendet wird, dann werden die Tabstopps auf je <strong>n</strong> Einheiten &uuml;ber die gesamte Breite des Steuerelements verteilt. Mit "<em>Gui, Add, ListBox, vEigeneListBox t64</em>" beispielsweise wird die Standard-Distanz zwischen den Tabstopps verdoppelt. Um benutzerdefinierte Tabstopps zusetzen, verwendet den Buchstaben T wie im folgenden Beispiel mehrfach: <em>Gui, Add, ListBox, vEigeneListBox t8 t16 t32 t64 t128</em>. Ein Tabstopp ist jeweils eine absolute Spaltenposition in der Liste, bis zu einem Maximum von 50 Tabstopps.</p>
<p><span class="green">0x100</span>: Mit 0x100 in den <I>Optionen</I> wird der Style LBS_NOINTEGRALHEIGHT aktiviert. Die ListBox wird dazu gezwungen, exakt die angegebene H&ouml;he zu verwenden, anstatt eine H&ouml;he, die das Anzeigen einer Zeile am unteren Rand unterdr&uuml;ckt. Diese Option verhindert auch, dass die ListBox schrumpft, wenn die Schrift ge&auml;ndert wird.</p>
<p>Um die Anzahl der Textzeilen zu bestimmen (oder die H&ouml;he und Breite), siehe <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
<h2>ListView und TreeView</h2>
<p>Siehe separate Seiten <a href="ListView.htm">ListView</a> und <a href="TreeView.htm">TreeView</a>.</p>

<h2 id="Hotkey">Hotkey</h2>
<p>Beschreibung: Sieht aus wie ein einzeiliges Edit-Steuerelement, aber mit dem Unterschied, dass eingegebene Tastenkombinationen vom Benutzer erkannt werden. Wenn der Benutzer zum Beispiel Steuerung+Alt+C auf einer deutschen Tastaturbelegung dr&uuml;ckt, dann erscheint im Feld "STRG + ALT + C".</p>
<pre>Beispiel: Gui, Add, Hotkey, vChosenHotkey</pre>
<p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, dann wird mit der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) die Modifikatoren und der Name des Hotkeys abgerufen, die mit dem <a href="Hotkey.htm">Hotkey</a>-Befehl kompatibel sind. Beispiele: ^!C, +!Home, +^Down, ^Numpad1, !NumpadEnd. Wenn kein Hotkey im Steuerelement ist, dann ist die Ausgabevariable leer. Hinweis: Einige Tasten werden gleich angezeigt, selbst sie als verschiedene Namen abgerufen werden. Zum Beispiel werden sowohl ^Numpad7 wie auch ^NumpadHome als "STRG + 7 (ZEHNERTASTATUR)" angezeigt.</p>
<p>Standardm&auml;&szlig;ig startet das Steuerelement ohne angegebenen Hotkey. Um stattdessen einen Standardwert anzugeben, verwendet Modifikatoren und den Namen im letzten Parameter wie in diesem Beispiel: Gui, Add, Hotkey, vChosenHotkey, ^!p<br> Es werden nur die Modifikatoren ^ (Steuerung), ! und Umschalt (+) werden unterst&uuml;tzt. Siehe <a href="../KeyList.htm">Keyboard, Maus und Joystickreferenz</a> f&uuml;r weitere Tasten.</p>
<p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Damit wird <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer den Hotkey &auml;ndert. Jeder Start von g-Label speichert auch den Hotkey in die <a href="Gui.htm#var">zugewiesene Ausgangsvariable</a> (falls vorhanden). Hinweis: g-Label wird auch ausgef&uuml;hrt, wenn ein unvollst&auml;ndiger Hotkey vorhanden ist. Wenn der Benutzer beispielsweise Strg-Taste gedr&uuml;ckt h&auml;lt, dann wird g-Label einmal gestartet und die Ausgabevariable enth&auml;lt nur einen Zirkumflex (^). Wenn der Benutzer die Tastenkombination abgeschlossen hat, dann wird das g-Label wieder gestartet und die Variable enth&auml;lt den kompletten Hotkey.</p>
<p>Um die Eingabe von Hotkey-Typen einzuschr&auml;nken, f&uuml;gt nach dem Wort <span class="green">Limit</span> die Summe folgender Zahlen an:</p>
<p>1: Verhindert unmodifizierte Tasten<br> 2: Verhindert Umschalt-Tasten <br> 4: Verhindert Steuerungstasten <br> 8: Verhindert Alt-Tasten<br> 16: Verhindert Umschalt-Strg-Tasten <br> 32: Verhindert Umschalt-Alt-Tasten <br> 64: Dieser Wert wird nicht unterst&uuml;tzt (und wird sich nicht korrekt verhalten).<br> 128: Verhindert Umschalt-Steuerung-Alt-Tasten.</p>
<p>Mit Limit1 beispielsweise k&ouml;nnen unmodifizierte Hotkeys  wie Buchstaben und Zahlen nicht eingegeben werden und mit Limit15 werden mindestens zwei Modifikatorentasten ben&ouml;tigt. Wenn der Benutzer eine verbotene Modifikator-Kombination verwendet, dann erscheint Steuerung+Alt automatisch und wird sichtbar ersetzt.</p>
<p>Das Hotkey-Steuerelement hat nur begrenzte M&ouml;glichkeiten. Zum Beispiel werden nicht Maus/Joystick-Hotkeys oder die Windows-Taste (LWin und RWin) unterst&uuml;tzt. Als &Uuml;bergangsl&ouml;sung k&ouml;nnen beliebig viele <a href="#CheckBox">Checkbox</a>-Steuerelemente verwendet werden, die zus&auml;tzliche Modifikatoren wie die Win-Taste anbieten.</p>

<h2 id="DateTime">DateTime</h2>
<p>Beschreibung: Sieht wie ein einzeiliges Edit-Steuerelement aus, das jedoch nur die Eingabe von Datum und/oder Zeit akzeptiert. Ein ausklappbarer Kalender ist ebenfalls vorhanden.</p>
<pre>Beispiel: Gui, Add, DateTime, vEigenesDateTime, LongDate</pre>
<p><a name="DateTimeFormat"></a>Der letzte Parameter kann Folgendes enthalten:</p>
<p><span class="green">(nicht vorhanden)</span>: Wenn weggelassen, dann wird das kurze Datumsformat verwendet, abh&auml;ngig vom aktuellen Gebietsschema des Benutzers. K&ouml;nnte zum Beispiel wie folgt aussehen: 17.04.2011</p>
<p><span class="green">LongDate</span>: Verwendet das lange Datumsformat, abh&auml;ngig vom aktuellen Gebietsschema des Benutzers. K&ouml;nnte zum Beispiel wie folgt aussehen: 17.04.2011</p>
<p><span class="green">Time</span>: Zeigt nur die Zeit an, abh&auml;ngig vom aktuellen Gebietsschema des Benutzers. Obwohl das Datum nicht angezeigt wird, ist es weiterhin im Steuerelement und kann zusammen mit der Zeit im <a href="FileSetTime.htm#YYYYMMDD">YYYYMMDDHH24MISS</a>-Format abgerufen werden.</p>
<p><span class="green">(benutzerdefiniertes Format)</span>: Verwendet eine beliebige Kombination der <a href="FormatTime.htm">Datum- und Zeitformate</a>. <em>d.M.yy HH:mm</em> wird beispielsweise zu 17.4.11 12:19. Und <em>dddd MMMM d, yyyy hh:mm:ss</em> beispielsweise zu Sonntag April 17, 2011 12:22:45. Damit Buchstaben und Zahlen direkt angezeigt werden k&ouml;nnen, umschlie&szlig;t sie wie im diesem Beispiel mit Hochkommas: <em>'Datum:' MM/dd/yy 'Zeit:' hh:mm:ss tt</em> Nicht-alphanumerische Zeichen wie Leerzeichen, Tabulatoren, Schr&auml;gstriche, Doppelpunkte, Kommas und andere Satzzeichen m&uuml;ssen nicht von Hochkommas umschlossen werden. Die Ausnahme ist das Hochkomma selbst: Zur Darstellung dieses Zeichens m&uuml;ssen vier aufeinanderfolgende Hochkommas ('''') verwendet werden, oder nur zwei, wenn das Hochkomma sich bereits innerhalb von zwei &auml;u&szlig;eren Hochkommas befindet.</p>
<p><strong>Verwendung von DateTime</strong></p>
<p><a name="ChooseDT"></a>Um zu Beginn ein anderes Datum als heute zu verwenden, f&uuml;gt in den <em>Optionen</em> das Wort <span class="green">Choose</span> ein, gefolgt von einem Datum im YYYYMMDD-Format. Mit Choose20110417 beispielsweise wird 17. April 2011 vorausgew&auml;hlt (wie bei anderen Optionen, kann es auch eine Variable wie zum Beispiel Choose%Var% sein). Damit kein Datum/Uhrzeit ausgew&auml;hlt ist, verwendet <span class="green">ChooseNone</span>. <em>ChooseNone</em> erstellt au&szlig;erdem eine Checkbox innerhalb des Steuerelements, die deaktiviert ist, sobald das Steuerelement kein Datum hat. Sobald das Steuerelement kein Datum hat, ermittelt <a href="Gui.htm#Submit">Gui Submit</a> und <a href="GuiControlGet.htm">GuiControlGet</a> einen leeren Wert (leerer String).</p>
<p>Die Tageszeit kann optional vorhanden sein. Erfolgt aber immer nach dem Datum, wenn das Format ausgew&auml;hlt oder abgerufen wird. Das Format der Zeitangabe ist HH24MISS (Stunden, Minuten, Sekunden), wo HH24 im 24-Stunden-Format zum Ausdruck kommt. Somit ist ein vollst&auml;ndiger Datum-Zeit-String im <a href="FileSetTime.htm#YYYYMMDD">YYYYMMDDHH24MISS</a>-Format.</p>
<p>Wenn ein Datum im YYYYMMDDHH24MISS-Format angegeben wird, dann ist nur der f&uuml;hrende Teil notwendig. Alle nachfolgende Elemente, die weggelassen werden, haben folgende Standardwerte:<br> MM: Monat 01<br> DD: Tag 01<br> HH24: Stunde 00<br> MI: Minute 00<br> SS: Sekunde 00</p>
<p>In dem ausklappbaren Kalender kann der Heute-String unten angeklickt werden, um das heutige Datum auszuw&auml;hlen. Dar&uuml;ber hinaus ist das Jahr und der Monatsname anklickbar und erm&ouml;glichen eine einfache Navigation zu einem neuen Monat oder Jahr.</p>
<p>Navigation mit der Tastatur: Mit Up/Down (Pfeiltasten), NumpadPlus/Minus und Home/End k&ouml;nnen die Werte des Steuerelements erh&ouml;ht oder verringert werden. Mit Left und Right (Pfeiltasten) kann von Feld zu Feld innerhalb des Steuerelements navigiert werden. Innerhalb des ausklappbaren Kalenders kann mit den Pfeiltasten von Tag zu Tag navigiert werden; mit PageUp/Down einen Monat zur&uuml;ck/vor; mit Strg+PageUp/Down ein Jahr zur&uuml;ck/vor; und mit Home/End jeweils den ersten/letzten Tag im Monat ausw&auml;hlen.</p>
<p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, dann wird mit der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) das Datum und die Uhrzeit im <a href="FileSetTime.htm#YYYYMMDD">YYYYMMDDHH24MISS</a>-Format abgerufen. Sowohl das Datum als auch die Uhrzeit sind vorhanden, unabh&auml;ngig davon, ob sie tats&auml;chlich im Steuerelement sichtbar sind.</p>
<p>Das <a href="Gui.htm#label">g-Label</a> (falls vorhanden) wird ausgef&uuml;hrt, sobald der Benutzer das Datum oder die Uhrzeit &auml;ndert. Bei jedem Start wird die <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> (falls vorhanden) des Steuerelements mit dem aktuell ausgew&auml;hlten Datum/Uhrzeit aktualisiert.</p>
<p>Windows 95 und NT4 ben&ouml;tigen mindestens Internet Explorer 3.0, damit DateTime-Steuerelemente unterst&uuml;tzt werden.</p>
<p><strong>DateTime-Optionen:</strong></p>
<p><span class="green">Choose</span>: Siehe <a href="#ChooseDT">oben</a>.</p>
<p><span class="green">Range</span>: Beschr&auml;nkt die Datumsauswahl auf einem bestimmten Zeitraum. Nach dem Wort Range erfolgt das minimale und maximale Datum im YYYYMMDD-Format (mit einem Bindestrich dazwischen). Mit <em>Range20050101-20050615</em> beispielsweise wird das Datum auf die ersten 5.5 Monaten des Jahres 2005 beschr&auml;nkt. Das Minimum oder Maximum kann weggelassen werden, damit das Steuerelement in dieser Richtung unbegrenzt ist. Beispiele: Mit Range20010101 kann kein Tag vor 2001 ausgew&auml;hlt werden und mit Range-20091231 (f&uuml;hrender Bindestrich) kann kein Tag nach 2009 ausgew&auml;hlt werden. Ohne Range kann jedes Datum zwischen den Jahren 1601 und 9999 ausgew&auml;hlt werden. Die Uhrzeit kann nicht eingeschr&auml;nkt werden.</p>
<p><span class="green">Right</span>: Bewirkt, dass der ausklappbare Kalender auf der rechten anstelle der linken Seite des Steuerelements aufgeklappt wird.</p>
<p>1: Mit der Nummer 1 in den <em>Optionen</em> wird der ausklappbare Monatskalender mit einem UpDown-Steuerelement auf der rechten Seite des Steuerelements ersetzt, um Datum-Zeit-Werte zu modifizieren.</p>
<p><span class="green"><a name="ChooseNone"></a></span>2: Mit der Nummer 2 in den <em>Optionen</em> wird eine CheckBox innerhalb des Steuerelements unterst&uuml;tzt, dass der Benutzer deaktivieren kann, um kein Datum/Uhrzeit auszuw&auml;hlen. Nachdem das Steuerelement erstellt wurde, kann diese Option nicht mehr ge&auml;ndert werden.</p>
<h2 id="MonthCal">MonthCal</h2>
<p>Beschreibung: Ein hohes und breites Steuerelement, das alle Tage des Monats im Kalender-Format anzeigt. Der Benutzer kann ein einzelnes Datum oder einen Datumsbereich ausw&auml;hlen.</p>
<pre>Beispiel: Gui, Add, MonthCal, vEigenesKalender</pre>
<p>Damit ein anderes Datum als heute vorgew&auml;hlt ist, f&uuml;gt im letzten Parameter ein Datum im YYYYMMDD-Format ein (z. B. 20050531). Ein Datumsbereich kann auch vorgew&auml;hlt werden, indem ein Bindestrich zwischen zwei Daten eingef&uuml;gt wird (z. B. 20050525-20050531).</p>
<p>Es ist normalerweise am besten, Breite (W) und H&ouml;he (H) im MonthCal-Steuerlement wegzulassen, weil die Gr&ouml;&szlig;e automatisch auf einem Monat angepasst wird. Um mehrere Monate vertikal darzustellen, verwendet R2 oder h&ouml;her in den <em>Optionen</em>. Um mehrere Monate horizontal darzustellen, verwendet W-2 oder h&ouml;her in den <em>Optionen</em>. Diese Optionen k&ouml;nnen gleichzeitig vorhanden sein, um in beide Richtungen zu erweitern.</p>
<p>Der Heute-String unterhalb des Steuerelements kann angeklickt werden, um das heutige Datum auszuw&auml;hlen. Dar&uuml;ber hinaus ist das Jahr und der Monatsname anklickbar, dass eine einfache Auswahl eines neuen Monats oder Jahrs erm&ouml;glicht.</p>
<p>Im Gegensatz zum ausklappbaren Kalender von <a href="#DateTime">DateTime</a> wird die Tastaturnavigation in einem MonthCal-Steuerelement in der Regel nicht unterst&uuml;tzt.</p>
<p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, dann wird mit der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) das ausgew&auml;hlte Datum im YYYYMMDD-Format (ohne Uhrzeit) abgerufen. Wenn allerdings die <a href="#MonthCalMulti">Mehrfachauswahl</a>-Option aktiv ist, dann werden die minimalen und maximalen Daten mit einem Bindestrich dazwischen ermittelt (z. B. 20050101-20050108). Wenn nur ein einzelnes Datum in einem Kalender mit Mehrfachauswahl ausgew&auml;hlt wurde, dann ist das Minimum und Maximum vorhanden, aber identisch. Mit <a href="StringSplit.htm">StringSplit</a> k&ouml;nnen die Daten getrennt werden. Mit dem folgendem Beispiel wird das Minimum in Date1 und das Maximum in Date2 gespeichert: <em>StringSplit, Date, EigenesMonthCal, -</em></p>
<p>Wenn das MonthCal-Steuerelement einen <a href="Gui.htm#label">g-Label</a> hat, dann wird die <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) mit dem aktuell ausgew&auml;hlten Datum oder Bereich aktualisiert. Standardm&auml;&szlig;ig kann das Label nur aufgerufen werden, wenn: 1) der Benutzer die Auswahl &auml;ndert, oder 2) nur alle zwei Minuten, falls ein neuer Tag beginnt (dieses Verhalten ist eine Eigenart des Betriebssystems). Wenn allerdings das Wort AltSubmit in den <em>Optionen</em> des Steuerelements ist, dann wird <a href="Gui.htm#label">g-Label</a> &ouml;fters ausgef&uuml;hrt und die interne Variable A_GuiEvent enth&auml;lt das Wort "Normal" f&uuml;r eine &Auml;nderung des Datums, die Nummer 1 f&uuml;r das Anklicken des Datums und die Nummer 2, wenn das MonthCal-Steuerelement die "Mauserfassung" losl&auml;sst. Wenn zum Beispiel der Benutzer auf neues Datum doppelklickt, dann wird das Label f&uuml;nfmal ausgef&uuml;hrt: Einmal mit Normal, zweimal mit 1 und zweimal mit 2. Das kann verwendet werden, um die Doppelklicks durch <a href="../Variables.htm#TickCount">Messen der Zeit</a> zwischen den Instanzen der Nummer 1 zu erkennen.</p>
<p>Wenn das Datum im YYYYMMDD-Format angegeben wird, dann kann der MM- und DD-Teil weggelassen werden, welche dann als 1 angesehen werden. Zum Beispiel wird 200205 als 20020501, sowie 2005 als 20050101 angesehen.</p>
<p>Windows 95 und NT4 ben&ouml;tigen mindestens Internet Explorer 3.0, damit MonthCal-Steuerelemente unterst&uuml;tzt werden.</p>
<p><strong>MonthCal-Optionen:</strong></p>
<p><span class="green"><a name="MonthCalMulti"></a>Multi</span>: Mehrfachauswahl. Erlaubt dem Benutzer, mit Umschalt+Klick oder Klicken und Ziehen eine Reihe von benachbarten Daten auszuw&auml;hlen (der Benutzer kann weiterhin ein einzelnes Datum ausw&auml;hlen). Diese Option kann direkt angegeben werden oder automatisch in Kraft treten, wenn ein Auswahlbereich bei der Erstellung des Steuerelements angegeben wird. Zum Beispiel: <em>Gui, Add, MonthCal, vEigenesKal, 20050101-20050108</em>. Nachdem das Steuerelement erstellt wurde, kann diese Option nicht mehr ge&auml;ndert werden.</p>
<p><span class="green">Range</span>: Beschr&auml;nkt die Datumsauswahl auf einem bestimmten Zeitraum. Nach dem Wort Range erfolgt das minimale und maximale Datum im YYYYMMDD-Format (mit einem Bindestrich dazwischen). Mit <em>Range20050101-20050615</em> beispielsweise wird die Auswahl auf die ersten 5.5 Monaten des Jahres 2005 beschr&auml;nkt. Das Minimum oder Maximum kann weggelassen werden, damit das Steuerelement in dieser Richtung unbegrenzt ist. Beispiele: Mit Range20010101 kann kein Tag vor 2001 ausgew&auml;hlt werden und mit Range-20091231 (f&uuml;hrender Bindestrich) kann kein Tag nach 2009 ausgew&auml;hlt werden. Ohne Range kann jedes Datum zwischen den Jahren 1601 und 9999 ausgew&auml;hlt werden.</p>
<p><span class="green">4</span>: Mit der Nummer 4 in den <em>Optionen</em> werden die Wochennummern (1-52) an der linken Seite jeder Reihe angezeigt. Woche 1 wird als erste Woche definiert, die mindestens vier Tage enth&auml;lt.</p>
<p>8: Mit der Nummer 8 in den <em>Optionen</em> wird verhindert, dass das Datum von Heute im Steuerelement umkreist wird.</p>
<p><span class="green">16</span>: Mit der Nummer 16 in den <em>Optionen</em> wird verhindert, dass das Datum von Heute im Steuerelement unten angezeigt wird.</p>

<h2 id="Slider">Slider</h2>
<p>Beschreibung: Ein Schieberegler, dass der Benutzer entlang einer vertikalen oder horizontalen Strecke bewegen kann. Die Standard-Lautst&auml;rkeregelung in der Taskleiste ist ein Beispiel f&uuml;r einen Schieberegler.</p>
<pre>Beispiel: Gui, Add, Slider, vEigenesSlider, 50</pre>
<p>Die Startposition des Schiebereglers kann im letzten Parameter angegeben werden. Wenn der letzte Parameter weggelassen wird, dann beginnt der Schieberegler bei 0 oder bei der Zahl im zul&auml;ssigen Bereich, die am n&auml;chsten an der Null ist.</p>
<p>Der Benutzer kann den Regler wie folgt verschieben: 1) mit der Maus ziehen, 2) auf den Bereich der Schiene klicken, 3) das Mausrad drehen, w&auml;hrend das Steuerelement den Fokus hat, oder 4) folgende Tasten dr&uuml;cken, w&auml;hrend das Steuerelement den Fokus hat: Pfeiltasten, Bild-Auf, Bild-Ab, Pos1 und Ende.</p>
<p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, dann wird mit der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) die numerische Position des Slider-Steuerelements abgerufen. Die Position wird auch in die Ausgabevariable gespeichert, sobald das <a href="Gui.htm#label">g-Label</a> des Steuerelements ausgef&uuml;hrt wird.</p>
<p>Wenn der Schieberegler ein <a href="Gui.htm#label">g-Label</a> hat, dann wird es standardm&auml;&szlig;ig nur ausgef&uuml;hrt, wenn der Benutzer aufgeh&ouml;rt hat, den Regler zu bewegen (z. B. durch Loslassen der Maustaste, nachdem es gezogen wurde). Wenn allerdings das Wort AltSubmit in den <em>Optionen</em> des Steuerelements ist, dann wird das g-Label bei allen Ereignissen des Schiebereglers ausgef&uuml;hrt und die interne Variable A_GuiEvent enth&auml;lt eine folgende Zahl oder einen folgenden String:</p>
<p>0: Der Benutzer bet&auml;tigt die linke oder obere Pfeiltaste.<br> 1: Der Benutzer bet&auml;tigt die rechte oder untere Pfeiltaste.<br> 2: Der Benutzer bet&auml;tigt die Bild-Auf-Taste.<br> 3: Der Benutzer bet&auml;tigt die Bild-Ab-Taste.<br> 4: Der Benutzer bewegt den Schieberegler mit dem Mausrad oder beendet das Ziehen und Ablegen an eine neue Position.<br> 5: Der Benutzer zieht den Schieberegler zurzeit mit der Maus, d. h. die Maustaste wird derzeit gedr&uuml;ckt.<br> 6: Der Benutzer bet&auml;tigt die Pos1-Taste, um den Regler ganz nach links oder nach oben zu verschieben. <br> 7: Der Benutzer bet&auml;tigt die Ende-Taste, um den Regler ganz nach rechts oder nach unten zu verschieben. <br> Normal: Der Benutzer ist mit dem Verschieben des Reglers fertig, entweder mit der Maus oder Tastatur. <u>Hinweis</u>: Mit Ausnahme der Mausradbewegung (#4) wird das <a href="Gui.htm#label">g-Label</a> auch dann wieder bei dem Normal-Ereignis ausgef&uuml;hrt, wenn es bereits bei einem Zahl-Ereignis von oben ausgef&uuml;hrt wurde.</p>
<p><strong>Slider-Optionen:</strong></p>
<p><span class="green">Buddy1</span> und <span class="green">Buddy2</span>: Bestimmt bis zu zwei vorhandene Steuerelemente, die automatisch an den Enden des Schiebereglers positioniert werden. Buddy1 wird an der linken oder oberen Seite angezeigt (je nachdem, ob die Option Vertical vorhanden ist). Buddy2 wird an der rechten oder unteren Seite angezeigt. Nach dem Wort Buddy1 oder Buddy2 kann der <a href="Gui.htm#var">Variablenname</a> eines vorhandenen Steuerelements angegeben werden. Mit Buddy1EigenerObertext wird beispielsweise das Steuerelement mit dem Namen EigenerObertext zugewiesen. Windows 95 und NT4 ben&ouml;tigen Internet Explorer 3.0 oder h&ouml;her, um diese Option zu unterst&uuml;tzen.</p>
<p><span class="green">Center</span>: Der Einstellknopf (welcher durch den Benutzer verschoben wird) ist an beiden Enden stumpf, anstatt an einem Ende spitz.</p>
<p><span class="green">Invert</span>: Dreht das Steuerelement um, damit der niedrigere Wert rechts/unten ist, anstatt links/oben. Das wird normalerweise benutzt, um einen vertikalen Schieberegler als eine traditionelle Lautst&auml;rkeregelung zu verwenden. Hinweis: Die unten beschriebene ToolTip-Option ber&uuml;cksichtigt nicht die die Umkehrung und sollte in diesem Fall nicht verwendet werden.</p>
<p><span class="green">Left</span>: Der Einstellknopf (welcher durch den Benutzer verschoben wird) ist am oberen Ende spitz. Aber wenn die Vertical-Option aktiviert ist, dann ist der Einstellknopf an der rechten Seite spitz.</p>
<p><span class="green">Line</span>: Bestimmt die Anzahl der zu bewegenden Positionen, wenn der Benutzer eine Pfeiltaste bet&auml;tigt. Nach dem Wort Line kann die Anzahl der zu bewegenden Positionen angegeben werden. Zum Beispiel: Line2</p>
<p><span class="green">NoTicks</span>: Die Skalenstriche entlang der Strecke werden weggelassen.</p>
<p><span class="green">Page</span>: Bestimmt die Anzahl der zu bewegenden Positionen, wenn der Benutzer die Bild-Auf- oder Bild-Ab-Taste bet&auml;tigt. Nach dem Wort Page kann die Anzahl der zu bewegenden Positionen angegeben werden. Zum Beispiel: Page10</p>
<p><span class="green">Range</span>: Bestimmt einen benutzerdefinierten Bereich (standardm&auml;&szlig;ig von 0 bis 100). Nach dem Wort Range erfolgt der Minimalwert, ein Bindestrich und der Maximalwert. Zum Beispiel: Range1-1000 erm&ouml;glicht eine Zahl zwischen 1 und 1000, Range-50-50 eine Zahl zwischen -50 und 50 und Range-10--5 eine Zahl zwischen -10 und -5.</p>
<p><span class="green">Thick</span>: Bestimmt die L&auml;nge des Einstellknopfs (welcher durch den Benutzer verschoben wird). Nach dem Wort Thick kann die Dicke in Pixel angegeben werden (z. B. Thick30). Um die Dicke in Windows XP oder h&ouml;her zu &auml;ndern, ist es wahrscheinlich notwendig, die Center-Option zu verwenden oder das Design des Steuerelements zu entfernen (dazu muss <em>-Theme</em> in den Optionen des Steuerelements angegeben werden).</p>
<p><span class="green">TickInterval</span>: Erm&ouml;glicht Skalenstriche entlang der Strecke in einem bestimmten Intervall. Nach dem Wort TickInterval kann das Intervall angegeben werden, um zus&auml;tzliche Skalenstriche anzuzeigen (ist das Intervall nicht vorhanden, wird standardm&auml;&szlig;ig 1 verwendet). TickInterval10 beispielsweise zeigt alle 10 Positionen einen Skalenstrich.</p>
<p><span class="green">ToolTip</span>: Erstellt ein Tooltip, der die numerische Position des Schiebereglers anzeigt, wenn er vom Benutzer gezogen wird. Um den Tooltip an einer anderen Position anzuzeigen, verwendet Folgendes: ToolTipLeft oder ToolTipRight (f&uuml;r horizontale Schieberegler); ToolTipTop oder ToolTipBottom (f&uuml;r vertikale Schieberegler). Windows 95 und NT4 ben&ouml;tigen Internet Explorer 3.0 oder h&ouml;her, um diese Option zu unterst&uuml;tzen.</p>
<p><span class="green">Vertical</span>: Damit kann der Schieberegler nach oben oder nach unten verschoben werden, anstatt von links nach rechts.</p>
<p>Die oben genannten Optionen k&ouml;nnen mittels <a href="GuiControl.htm">GuiControl</a> ge&auml;ndert werden, nachdem das Steuerelement erstellt wurde.</p>

<h2 id="Progress">Progress</h2>
<p>Beschreibung: Ein zweifarbiger Balken, der anzeigt, wie viel Fortschritt einer Operation gemacht wurde.</p>
<pre>Beispiel: Gui, Add, Progress, w300 h20 cBlue vEigenesProgress</pre>
<p>Die Anfangsposition des Balkens kann im letzten Parameter angegeben werden (wenn nicht vorhanden, dann bei 0 oder bei der Zahl im zul&auml;ssigen Bereich, die am n&auml;chsten an der Null ist). Um die Position des Balkens sp&auml;ter zu &auml;ndern, befolgt diese Beispiele, die sich auf einen Fortschrittsbalken mit dem <a href="Gui.htm#var">zugewiesenem Variablennamen</a> EigenesProgress beziehen:</p>
<pre><a href="GuiControl.htm">GuiControl</a>,, EigenesProgress, +20  <em>; Die Position wird um 20 erh&ouml;ht.</em>
<a href="GuiControl.htm">GuiControl</a>,, EigenesProgress, 50  <em>; Die Position wird auf 50 gesetzt.</em></pre>
<p>Bei horizontalen Fortschrittsbalken wird die Dicke des Balkens durch die H&ouml;he des Steuerelements bestimmt. Bei vertikalen Fortschrittsbalken durch die Breite des Steuerelements.</p>
<p><strong>Progress-Optionen:</strong></p>
<p><span class="green">Cn</span>: &Auml;ndert die Farbe des Balkens. Ersetzt <strong>n</strong> mit einer HTML-Prim&auml;rfarbe oder einem 6-stelligen RGB-<a href="Progress.htm#colors">Farbwert</a>. Beispiele: cRed, cFFFF33, cDefault. Wenn die C-Option nicht verwendet wird (oder cDefault angegeben ist), dann wird die Standardfarbe des Betriebssystems verwendet.</p>
<p><span class="green">BackgroundN</span>: &Auml;ndert die Hintergrundfarbe des Balkens. Ersetzt <strong>n</strong> mit einer HTML-Prim&auml;rfarbe oder einem 6-stelligen RGB-<a href="Progress.htm#colors">Farbwert</a>. Beispiele: BackgroundGreen, BackgroundFFFF33, BackgroundDefault Wenn die Background-Option nicht verwendet wird (oder BackgroundDefault angegeben ist), dann ist die Hintergrundfarbe die des Fensters oder <a href="#Tab">Tab-Steuerelements</a>.</p>
<p><span class="green">Range</span>: Bestimmt einen benutzerdefinierten Bereich (standardm&auml;&szlig;ig von 0 bis 100). Nach dem Wort Range erfolgt der Minimalwert, ein Bindestrich und der Maximalwert. Zum Beispiel: Range0-1000 erm&ouml;glicht eine Zahl zwischen 0 und 1000, Range-50-50 eine Zahl zwischen -50 und 50 und Range-10--5 eine Zahl zwischen -10 und -5. In Windows 95 und NT4 verhalten sich negative Bereiche und Bereiche &uuml;ber 65535 erst korrekt, wenn Internet Explorer 3.0 oder h&ouml;her installiert ist.</p>
<p><span class="green">-Smooth</span>: Zeigt eine L&auml;nge von Segmenten anstelle eines glatten durchgehenden Balkens an. -Smooth ist auch eine Voraussetzung, um einen thematisch gestalteten Fortschrittsbalken in Windows XP oder h&ouml;her anzuzeigen. Die andere Voraussetzung ist, dass der Balken keine benutzerdefinierten Farben hat, d. h. es wird auf C-und Background-Optionen verzichtet. Windows 95 und NT4 ben&ouml;tigen Internet Explorer 3.0 oder h&ouml;her, um diese Option zu unterst&uuml;tzen.</p>
<p><span class="green">Vertical</span>: Der Balken steigt oder f&auml;llt, anstatt horizontal bewegend. Windows 95 und NT4 ben&ouml;tigen Internet Explorer 3.0 oder h&ouml;her, um diese Option zu unterst&uuml;tzen.</p>
<p>Die oben genannten Optionen k&ouml;nnen mittels <a href="GuiControl.htm">GuiControl</a> ge&auml;ndert werden, nachdem das Steuerelement erstellt wurde.</p>

<h2 id="GroupBox">GroupBox</h2>
<p>Beschreibung: Ein rechteckiger Rahmen, welcher h&auml;ufig benutzt wird, um die Gemeinsamkeit von Steuerelementen darzustellen. In diesem Fall enth&auml;lt der letzte Parameter den Titel des Rahmens, der in der oberen linken Ecke angezeigt wird.</p>
<pre>Beispiel: Gui, Add, GroupBox, w400 h300, Geographische Kriterien</pre>
<p>Standardm&auml;&szlig;ig ist der Titel der GroupBox einzeilig. Das kann mit <em>Wrap</em> in den Optionen des Steuerelements &uuml;berschrieben werden.</p>
<p>Um die Anzahl der Zeilen innerhalb des Steuerelements zu bestimmen (oder die H&ouml;he und Breite), siehe <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
<h2 id="Tab"><a name="Tab2"></a>Tab2</h2>
<p>Beschreibung: Ein gro&szlig;es Steuerelement mit mehreren Seiten, die jeweils weitere Steuerelemente enthalten. Von diesem Punkt an werden diese Seiten "Tabs" genannt.</p>
<p><strong>Tab2 vs. Tab</strong>: In v1.0.47.05 wurde das Steuerelement "Tab2" hinzugef&uuml;gt. Dadurch werden seltene Probleme mit dem Neuzeichnen behoben (ein GUI-Fenster beispielsweise, dass durch Klicken auf bestimmte Teile des Steuerelements wie z. B. Bildlaufleiste aktiviert wird, wird nicht korrekt neu gezeichnet). Das urspr&uuml;ngliche Tab-Steuerelement wird f&uuml;r die Abw&auml;rtskompatibilit&auml;t beibehalten, weil Tab2 nach seine Steuerelemente in die Navigationsreihenfolge der Tab-Taste hinzugef&uuml;gt wird. Neue Scripts sollten Tab2 wenn m&ouml;glich immer verwenden.</p>
<pre>Beispiel: Gui, Add, Tab2,, Allgemein|Ansicht|Aussehen|Einstellungen</pre>
<p><a name="ChooseTab"></a>Der letzte Parameter enth&auml;lt eine Liste mit Tabnamen, die durch senkrechte Striche dazwischen getrennt werden. Mit zwei senkrechten Strichen danach wird ein Tab vorausgew&auml;hlt (z. B. Rot|Gr&uuml;n||Blau). Alternativ kann mit dem Wort <span class="green">Choose</span> in den <em>Optionen</em>, unmittelbar gefolgt von der Nummer, ein Eintrag sofort vorausgew&auml;hlt werden. Mit Choose5 beispielsweise wird der f&uuml;nfte Tab vorausgew&auml;hlt (wie bei anderen Optionen, kann es auch eine Variable wie zum Beispiel Choose%Var% sein). Nachdem das Steuerelement erstellt wurde, kann mit <a href="GuiControl.htm">GuiControl</a> das ausgew&auml;hlte Tab ge&auml;ndert oder Tabs hinzugef&uuml;gt/entfernt werden.</p>
<p><a name="TabCmd"></a>Nachdem das Tab-Steuerelement erstellt wurde, beziehen sich danach hinzugef&uuml;gte Steuerelemente auf das erste Tab. Das kann jederzeit mit den folgenden Beispielen ge&auml;ndert werden:</p>
<pre>Gui, Tab  <em>; Nachfolgende Steuerelemente geh&ouml;ren nicht dem einem Tab-Steuerelement.</em>
Gui, Tab, 3  <em>; Nachfolgende Steuerelemente werden dem dritten Tab im Tab-Steuerelement untergeordnet.</em>
Gui, Tab, 3, 2  <em>; Nachfolgende Steuerelemente werden dem dritten Tab im zweiten Tab-Steuerelement untergeordnet.</em>
Gui, Tab, Name  <em>; Nachfolgende Steuerelemente werden dem Tab mit der Bezeichnung <i>Name</i> untergeordnet (nicht abh&auml;ngig von Gro&szlig;-/Kleinschreibung).</em>
Gui, Tab, Name,, Exact  <em>; Das Gleiche wie oben, aber mit exakter &Uuml;bereinstimmung (und abh&auml;ngig von Gro&szlig;-/Kleinschreibung).</em></pre>
<p>Es ist auch m&ouml;glich, Steuerelemente einem Tab oder Tab-Steuerelement zuzuweisen, die noch nicht existieren (au&szlig;er im Fall der <em>Name</em>-Methode). In diesem Fall aber werden die unten beschriebenen Positionierungsoptionen nicht unterst&uuml;tzt.</p>
<p>Positionierung: Wenn jedes Tab eines Tab-Steuerelements sein erstes Untersteuerelement erh&auml;lt, dann hat dieses Untersteuerelement eine besondere Standardposition mit folgenden Bedingungen: 1) Sowohl die X-als auch Y-Koordinaten sind nicht vorhanden, in diesem Fall wird das erste Untersteuerelement in der oberen linken Ecke des Tab-Steuerelements positioniert (mit Standard-<a href="Gui.htm#Margin">Abstand</a>) und jeder Untersteuerelement &uuml;ber dem Ersten wird unter dem vorherigen Steuerelement positioniert; 2) Die Positionierungsoptionen <a href="Gui.htm#PosPlus">X+n und/oder Y+n </a>  wurden angegeben, in diesem Fall beziehen sich die Untersteuerelemente beim Positionieren auf die linke obere Ecke des Tab-Steuerelements. Mit "x+10 y+10" wird das Steuerelement von der linken oberen Ecke 10 Pixel nach rechts und 10 Pixel nach unten positioniert.</p>
<p>Untersteuerelemente m&uuml;ssen nicht unbedingt in der Abgrenzung des Tab-Steuerelements vorhanden sein: sie werden weiterhin unsichtbar und sichtbar gemacht, sobald ihr Tab ausgew&auml;hlt oder abgew&auml;hlt wird. Dieses Verhalten ist besonders f&uuml;r den unten beschriebenen Schaltfl&auml;chen-Style geeignet.</p>
<p>Wenn der Befehl <a href="Gui.htm#Submit">Gui Submit</a> verwendet wird, dann wird mit der <a href="Gui.htm#var">zugewiesenen Ausgabevariable</a> des Steuerelements (falls vorhanden) der Name des zurzeit ausgew&auml;hlten Tabs abgerufen. Wenn jedoch das Steuerelement die <a href="Gui.htm#AltSubmit">AltSubmit</a>-Eigenschaft hat, dann wird mit der Ausgabevariable stattdessen die Positionsnummer des Tabs abgerufen (das erste Tab ist 1, das Zweite 2 usw.).</p>
<p>Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Damit wird <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer zu einem neuen Tab wechselt. Wenn das Tab-Steuerelement sowohl ein <a href="Gui.htm#label">g-Label</a> als auch eine <a href="Gui.htm#var">Ausgabevariable</a> hat, dann enth&auml;lt die Ausgabevariable den vorher ausgew&auml;hlten Tabnamen (oder Nummer im Falle von <a href="Gui.htm#AltSubmit">AltSubmit</a>), sobald der Benutzer auf ein neues Tab wechselt.</p>
<p>Navigation mit der Tastatur: Der Benutzer kann mithilfe von Steuerung+Bild-Ab/Bild-Auf von Tab zu Tab navigieren; sobald ein Steuerelement den Tastaturfokus hat, das nicht zum Tab-Steuerelement geh&ouml;rt, dann wird das erste Tab-Steuerelement des Fensters angesteuert. Steuerung+Tab und Steuerung+Umschalt+Tab k&ouml;nnen auch verwendet werden, mit der Ausnahme, dass es nicht funktioniert, wenn das fokussierte Steuerelement ein mehrzeiliges Edit-Steuerelement ist.</p>
<p>Jedes Fenster kann nicht mehr als 255 Tab-Steuerelemente haben. Jedes Tab-Steuerelement kann nicht mehr als 256 Tabs (Seiten) haben. Dar&uuml;ber hinaus kann ein Tab-Steuerelement keine anderen Tab-Steuerelemente enthalten.</p>
<p><strong>Tab-Optionen:</strong></p>
<p><span class="green">Choose</span>: Siehe <a href="#ChooseTab">oben</a>.</p>
<p><span class="green">-Background</span>: &Uuml;berschreibt die <a href="Gui.htm#Color">benutzerdefinierte Hintergrundfarbe des Fensters</a> und verwendet die Standardfarbe des Betriebssystems. Mit <em>+Theme -Background</em> wird das Tab-Steuerelement an das aktuelle Desktop-Design angepasst. Allerdings werden die meisten Steuerelementarten seltsam damit im Tab-Steuerlement aussehen, weil ihre Hintergr&uuml;nde nicht mit dem Hintergrund des Tab-Steuerelements &uuml;bereinstimmen. Bei einigen Steuerelementarten (z. B. <a href="#Text">Text</a>) kann das Problem mit BackgroundTrans in deren Optionen umgegangen werden.</p>
<p><span class="green">Buttons</span>: Erstellt mehrere Schaltfl&auml;chen anstelle von Tabs am oberen Rand des Steuerelements (in diesem Fall ist standardm&auml;&szlig;ig kein Rahmen vorhanden, weil die Anzeigefl&auml;che der Regel keine Steuerelemente enth&auml;lt).</p>
<p><span class="green">Left/Right/Bottom</span>: Mit diesen W&ouml;rtern werden die Tabs an der linken, rechten oder unteren anstelle der oberen Seite angezeigt. Siehe <a href="../misc/Styles.htm#tcs_vertical">TCS_VERTICAL</a> f&uuml;r Beschr&auml;nkungen bei links und rechts.</p>
<p><span class="green">-Wrap</span>: Verhindert, dass die Tabs mehr als eine Zeile verbrauchen (in diesem Fall werden Pfeil-Schaltfl&auml;chen angezeigt, wenn es zu viele Tabs sind und erlaubt dem Benutzer, alle Tabs einzusehen).</p>
<p>Um die Anzahl der Zeilen innerhalb des Steuerelements zu bestimmen (oder die H&ouml;he und Breite), siehe <a href="Gui.htm#PosSize">Position und Gr&ouml;&szlig;e von Steuerelementen anpassen</a>.</p>
<p><strong>Icons in Tabs</strong>: Mittels <a href="PostMessage.htm">SendMessage</a> kann ein Icon neben dem Namen des Tabs angezeigt werden. Das wird im Forumsbeitrag <a href="http://www.autohotkey.com/forum/topic6060.html">Icons in tabs</a> demonstriert.</p>
<h2 id="StatusBar">StatusBar<span class="ver">[v1.0.44+]</span></h2>
<p>Beschreibung: Eine Reihe mit Text und/oder Icons am unteren Rand des Fensters, die typischerweise verwendet wird, um ge&auml;nderte Zust&auml;nde zu melden.</p>
<pre><em>; Beispiel:</em>
Gui, Add, StatusBar,, Starttext der Leiste (kann leer gelassen werden).
SB_SetText("Es sind " . RowCount . " Zeilen markiert.")</pre>
<p>Eine Statusleiste kann am einfachsten verwendet werden, indem <a href="#SB_SetText">SB_SetText()</a> aufgerufen wird, sobald sich etwas &auml;ndert, das dem Benutzer gemeldet werden soll. Um mehrere Informationen zu melden, teilt die Leiste mittels <a href="#SB_SetParts">SB_SetParts()</a> in mehrere Abschnitte. Mit <a href="#SB_SetIcon">SB_SetIcon()</a> k&ouml;nnen Icons in der Leiste angezeigt werden.</p>
<p>Alle folgenden StatusBar-Funktionen laufen im <a href="Gui.htm#DefaultWin">Standard-GUI-Fenster</a> des aktuellen Threads (kann mittels <a href="Gui.htm#Default"><em>Gui, 2:Default</em></a> ge&auml;ndert werden). Wenn das Standard-Fenster weder vorhanden ist noch eine Statusleiste hat, dann geben alle SB-Funktionen eine 0 zur&uuml;ck, um auf ein Problem hinzuweisen.</p>
<p><strong><a name="SB_SetText"></a>SB_SetText(NewText [, PartNumber, Style])</strong>: Zeigt <em>NewText</em> im angegebenen Teil der Statusleiste an. Wenn <em>PartNumber</em> nicht vorhanden ist, dann ist 1 der Standardwert. Andernfalls kann ein Integer-Wert zwischen 1 und 256 angegeben werden. Wenn <em>Style</em> nicht vorhanden ist, dann ist 0 der Standardwert, damit wird der traditionelle Rahmen verwendet, d. h. der Abschnitt sieht aus wie eingefallen. Andernfalls kann eine 1 angegeben werden, um den Rahmen zu entfernen oder eine 2, um einen Rahmen zu haben, damit der Abschnitt der Leiste angehoben wirkt. Schlie&szlig;lich k&ouml;nnen bis zu zwei Tab-Zeichen (`t) in <em>NewText</em> angegeben werden: alles auf der rechten Seite des ersten Tabs ist zentriert und alles auf der rechten Seite des zweiten Tabs ist rechtsb&uuml;ndig. SB_SetText() gibt bei Erfolg eine 1 und bei Misserfolg eine 0 zur&uuml;ck.</p>
<p><strong><a name="SB_SetParts"></a>SB_SetParts([Width1, Width2, ... Width255])</strong>: Teilt die Leiste in mehrere Abschnitte, abh&auml;ngig von der angegebenen Breite (in Pixel). Wenn alle Parameter weggelassen werden, dann hat die Leiste nur einen langen Abschnitt. Andernfalls kann die Breite f&uuml;r jeden Abschnitt angegeben werden (der letzte Abschnitt hat die verbleibende Breite der Leiste). Mit <em>SB_SetParts(50, 50)</em> werden drei Abschnitte erstellt: die ersten zwei Abschnitte haben eine Breite von 50 und der Letzte die verbleibende Breite. Hinweis: Jeder Abschnitt, der mit SB_SetParts() "gel&ouml;scht" wurde, startet beim n&auml;chsten Mal ohne Text, wenn er angezeigt wird (au&szlig;erdem werden die Icons automatisch zerst&ouml;rt). Bei Erfolg gibt SB_SetParts() einen Wert gr&ouml;&szlig;er 0 zur&uuml;ck (<a href="ControlGet.htm#Hwnd">HWND</a> der Statusleiste). Bei Misserfolg eine 0.</p>
<p><strong><a name="SB_SetIcon"></a>SB_SetIcon(Dateiname [, IconNumber, PartNumber])</strong>: Zeigt ein kleines Icon auf der linken Seite des Textes im angegebenen Abschnitt an (wenn <em>PartNumber</em> weggelassen wird, dann ist 1 der Standardwert). Der <em>Dateiname</em> enth&auml;lt den Namen einer Icon-Datei (.ICO), einer Cursor-Datei (.CUR) oder einer animierten Cursor-Datei (.ANI) (animierte Cursor werden zurzeit nicht in der Leiste animiert). Andere Quellen von Icons k&ouml;nnen sein: EXE, DLL, CPL, SCR und andere Typen, die Icon-Ressourcen enthalten. Um eine beliebige Icon-Gruppe in einer Datei zu verwenden, verwendet die Gruppennummer in der <em>Iconnummer</em>. Mit <em>SB_SetIcon("Shell32.dll", 2)</em> beispielsweise wird das Standard-Icon aus der zweiten Icon-Gruppe verwendet. SB_SetIcon() gibt bei Erfolg HICON des Icons und bei Misserfolg eine 0 zur&uuml;ck. HICON ist eine System-Ressource, die von den meisten Scripts getrost ignoriert werden kann, weil es automatisch zerst&ouml;rt wird, wenn das Fenster der Statusleiste zerst&ouml;rt wird. Ebenso wird jedes alte Icon zerst&ouml;rt, wenn es mit einem neuen Icon via SB_SetIcon() ersetzt wird. Das kann wie folgt verhindert werden:</p>
<pre>Gui +LastFound
<a href="PostMessage.htm">SendMessage</a>, 0x40F, part_number - 1, eigenes_hicon, msctls_statusbar321  <em>; 0x40F ist SB_SETICON.</em></pre>
<p><strong><a name="SB_SetProgress"></a>SB_SetProgress()</strong>: Erstellt und steuert einen Fortschrittsbalken innerhalb einer Statusleiste. Diese Funktion ist auf <a href="http://www.autohotkey.com/forum/topic37754.html">www.autohotkey.com/forum/topic37754.html</a> verf&uuml;gbar.</p>
<p><strong>g-Label-Meldungen:</strong> Ein <a href="Gui.htm#label">g-Label</a> wie <em><strong>g</strong>EigeneSubroutine</em> kann in den Optionen des Steuerelements angegeben werden. Damit wird <em>EigeneSubroutine</em> automatisch ausgef&uuml;hrt, sobald der Benutzer auf die Leiste klickt. Diese Subroutine kann auf die internen Variablen <a href="../Variables.htm#Gui">A_Gui</a> und <a href="../Variables.htm#GuiControl">A_GuiControl</a> zur&uuml;ckgreifen. Noch wichtiger ist, dass sie auf die interne Variable <strong>A_GuiEvent</strong> zur&uuml;ckgreifen kann, die einen folgenden String enthalten kann (aus Kompatibilit&auml;tsgr&uuml;nden mit zuk&uuml;nftigen Versionen sollte ein Script nicht davon ausgehen, dass das die einzigen m&ouml;glichen Werte sind):</p>
<ul>
  <li><strong>Normal</strong>: Der Benutzer hat mit der linken Maustaste auf die Leiste geklickt. Die interne Variable A_EventInfo enth&auml;lt die Abschnittsnummer (kann aber auch ein sehr gro&szlig;er Integer-Wert sein, wenn der Benutzer auf den Gr&ouml;&szlig;enziehpunkt in der rechten Seite der Leiste klickt).</li>
  <li><strong>RightClick</strong>: Der Benutzer hat mit der rechten Maustaste auf die Leiste geklickt. Die interne Variable A_EventInfo enth&auml;lt die Abschnittsnummer. HINWEIS: <a href="Gui.htm#GuiContextMenu">GuiContextMenu</a> wird nicht f&uuml;r die Statusleiste aufgerufen, wenn ein g-Label vorhanden. Auch das RightClick-Ereignis des g-Labels sollte anstelle von <a href="Gui.htm#GuiContextMenu">GuiContextMenu</a> verwendet werden, wenn das Script wissen muss, auf welcher Abschnittsnummer der Benutzer geklickt hat (A_EventInfo).</li>
  <li><strong>DoubleClick</strong>: Der Benutzer hat mit der linken Maustaste doppelt auf die Leiste geklickt. Die interne Variable A_EventInfo enth&auml;lt die Abschnittsnummer.</li>
  <li><strong>R</strong>: Der Benutzer hat mit der rechten Maustaste <em>doppelt</em> auf die Leiste geklickt.  Die interne Variable A_EventInfo enth&auml;lt die Abschnittsnummer.</li>
</ul>
<p><strong>Schrift und Farbe</strong>: Obwohl die Gr&ouml;&szlig;e, Art und Stil der Schrift mittels <a href="Gui.htm#Font">Gui Font</a> eingestellt wird (wie bei einem normalen Steuerelement), kann die Textfarbe nicht ge&auml;ndert werden. Auch "<a href="Gui.htm#Color">Gui Color</a>" wird nicht ber&uuml;cksichtigt; Stattdessen kann die Hintergrundfarbe der Statusleiste mit dem Wort <span class="green">Background</span> in den <em>Optionen</em> ge&auml;ndert werden, gefolgt vom Farbnamen (siehe <a href="Progress.htm#colors">Farbtabelle</a>) oder RGB-Wert (0x-Pr&auml;fix ist optional). Beispiele: BackgroundSilver, BackgroundFFDD99, BackgroundDefault</p>
<p><strong>Ausblenden der Statusleiste</strong>: Die Leiste kann bei der Erstellung mittels <em>Gui, Add, StatusBar, Hidden vEigeneStatusBar</em> versteckt werden. Nach der Erstellung kann sie mit <em>GuiControl, Hide, EigeneStatusBar</em> versteckt werden. Um sie anzuzeigen, verwendet <em>GuiControl, Show, EigeneStatusBar</em>. Hinweis: Das Ausblenden der Leiste reduziert nicht die H&ouml;he des Fensters. Wenn das gew&uuml;nscht ist, einfach <em><a href="Gui.htm#AutoSize">Gui, Show, AutoSize</a></em> verwenden.</p>
<p><strong>Styles</strong> (selten verwendet): Siehe <a href="../misc/Styles.htm#StatusBar">Style-Tabelle der StatusBar</a>.</p>
<p><strong>Bekannte Einschr&auml;nkungen</strong>: 1) Jedes Steuerelement, dass die Statusleiste &uuml;berdeckt, wird manchmal dr&uuml;ber gezeichnet.  Zur Vermeidung dieses Problems k&ouml;nnen solche Steuerelemente mittels <a href="Gui.htm#GuiSize">GuiSize label</a> dynamisch geschrumpft werden. 2) Jedes Fenster kann nur eine Statusleiste besitzen.</p>
<p><strong>Beispiel</strong>: Im unteren Bereich der <a href="TreeView.htm#Examples">TreeView-Seite</a> wird eine Statusleiste mit mehreren Abschnitten demonstriert.</p>
<h2 id="ActiveX"><a name="IE_Control"></a>ActiveX <span class="ver">[v1.1.03+]</span></h2>
<p>ActiveX-Komponenten wie das MSIE-Browser-Steuerelement k&ouml;nnen wie folgt eingebettet werden:</p>
<pre>Gui Add, ActiveX, w980 h640 vWB, <a href="http://msdn.microsoft.com/en-us/library/aa752085">Shell.Explorer</a>  <em>; Der letzte Parameter ist der Name der ActiveX-Komponente.</em>
WB.<a href="http://msdn.microsoft.com/en-us/library/aa752093">Navigate</a>("http://www.autohotkey.com/forum/")  <em>; Speziell fr das Web-Browser-Steuerelement.</em>
Gui Show</pre>
<p>Sobald das Steuerelement erstellt ist, wird ein ActiveX-Objekt in die zugewiesenen Variable des Steuerelements gespeichert, falls vorhanden. Mit <a href="GuiControlGet.htm">GuiControlGet</a> kann auch das Objekt abgerufen werden.</p>
<p>Damit die Ereignisse des Objekts bearbeitet werden k&ouml;nnen, verwendet <a href="ComObjConnect.htm">ComObjConnect</a> wie unten gezeigt:</p>
<pre>Gui Add, Edit, w930 r1 vURL, http://www.autohotkey.com/forum/
Gui Add, Button, x+6 yp w44 Default, Laden
Gui Add, ActiveX, xm w980 h640 vWB, Shell.Explorer
<strong>ComObjConnect</strong>(WB, WB_events)  <em>; Verbindet die WB-Ereignisse mit dem Klassenobjekt WB_events.</em>
Gui Show
<em>; Fortfahren, um die Startseite zu laden:</em>
ButtonLaden:
Gui Submit, NoHide
WB.Navigate(URL)
return

class WB_events
{
    <a href="http://msdn.microsoft.com/en-us/library/aa768334">NavigateComplete2</a>(wb, NewURL)
    {
        GuiControl,, URL, %NewURL%  <em>; URL-Edit-Steuerelement aktualisieren.</em>
    }
}

GuiClose:
ExitApp</pre>
<p><a href="ComObjType.htm">ComObjType</a> kann verwendet werden, um den Typ des gespeicherten Objekts in der Steuerelementvariable zu bestimmen.</p>
<h2>Verwandte Seiten</h2>
<p><a href="ListView.htm">ListView</a>, <a href="TreeView.htm">TreeView</a>, <a href="Gui.htm">Gui</a>, <a href="GuiControl.htm">GuiControl</a>, <a href="GuiControlGet.htm">GuiControlGet</a>, <a href="Menu.htm">Menu</a></p>

</body>
</html>