<!DOCTYPE HTML>
<html>
<head>
<title>Hotkey</title>
<meta name="keywords" content="Befehl, Hotkey">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
  <div id="content"> 
    <script src="../navbar/NavScript.js" type="text/javascript"></script> 
    <script type="text/javascript">WriteNavLink(1);</script>
    <h1>Hotkey</h1>
    <p>Erstellt, bearbeitet, aktiviert oder deaktiviert ein Hotkey, w&auml;hrend das Script l&auml;uft.</p>
    <pre class="Syntax">Hotkey, Tastenname [, Label, Optionen]
Hotkey, IfWinActive/Exist [, Fenstertitel, Fenstertext]
Hotkey, If, Ausdruck</pre>
    <h3>Parameter</h3>
    <table class="info">
      <tr>
        <td style="width: 15%;">Tastenname</td>
        <td style="width: 85%;"><p>Name des Hotkeys, einschlie&szlig;lich <a href="../Hotkeys.htm#Symbols">Modifikatorzeichen</a>. Zum Beispiel kann mit #c der Hotkey <kbd>Win</kbd>+<kbd>C</kbd> angegeben werden.</p>
          <p>Falls der <em>Tastenname</em> als Hotkey bereits existiert oder ein vorhandenes Hotkey-Label ist (also ein Label mit zwei Doppelpunkten), wird dieser mit den restlichen Parameterwerten des Befehls aktualisiert.</p>
          <p>Bei Angabe eines <em>vorhandenen</em> Hotkeys ist der <em>Tastenname</em> nicht von der Gro&szlig;- oder Kleinschreibung abh&auml;ngig. Allerdings m&uuml;ssen die Namen der Tasten mit den Tastennamen im vorhandenen Hotkey &uuml;bereinstimmen (zum Beispiel ist hierbei das Esc nicht das gleiche wie Escape). Zudem ist es egal, wie die <a href="../Hotkeys.htm#Symbols">Modifikatorzeichen</a> (z. B. ^!+#) angeordnet werden.</p>
          <p>Die <a href="#IfWin">aktuelle Einstellung von IfWin</a> bestimmt die <a href="#variant">Variante</a> eines Hotkeys, auf die sich der Hotkey-Befehl beziehen wird. Sollte die Variante nicht vorhanden sein, wird sie erst erstellt.</p>
          <p>Sobald der Hotkey erstmalig mit diesem Befehl erstellt wird oder im Script als <a href="../Hotkeys.htm">Label mit zwei Doppelpunkten</a> angegeben ist, bildet sich aus dem Tastennamen und der Reihenfolge der Modifikatorzeichen sein permanenter Name, der in der internen Variable <a href="../Variables.htm#ThisHotkey">A_ThisHotkey</a> angezeigt wird. Das hei&szlig;t, dass sich dieser Name auch dann nicht &auml;ndern wird, wenn der Hotkey-Befehl sp&auml;ter auf diesen Hotkey mit einer unterschiedlichen Zeichenreihenfolge zugreift.</p></td>
      </tr>
      <tr>
        <td>Label</td>
        <td><p>Name des <a href="../misc/Labels.htm">Labels</a>, dessen Inhalt beim Dr&uuml;cken des Hotkeys ausgef&uuml;hrt wird (als neuer <a href="../misc/Threads.htm">Thread</a>). Es k&ouml;nnen sowohl normale als auch <a href="../Hotkeys.htm">Hotkey</a>/<a href="../Hotstrings.htm">Hotstring</a>-Label verwendet werden, jedoch ohne den nachfolgenden Doppelpunkt(en). Falls das <em>Label</em> dynamisch ist (z. B. %VarMitLabelnamen%), sollte <a href="../Functions.htm#IsLabel">IsLabel(VarMitLabelnamen)</a> vorher aufgerufen werden, um dessen Verf&uuml;gbarkeit zu &uuml;berpr&uuml;fen.</p>
          <p>Dieser Parameter kann leer gelassen werden, wenn der <em>Tastenname</em> bereits als Hotkey existiert. In diesem Fall bleibt sein Label unver&auml;ndert. Das ist n&uuml;tzlich, um nur die <em>Optionen</em> des Hotkeys zu &auml;ndern.</p>
          <p><strong>Wird der Label eines Hotkeys verwendet, der zuvor mit diesem Befehl deaktiviert wurde, bleibt dieser Hotkey deaktiviert. Verwendet ON in den <em>Optionen</em>, um das zu verhindern.</strong></p>
          <p>Dieser Parameter kann au&szlig;erdem einen der folgenden Sonderwerte enthalten:</p>
          <p><strong>On</strong>: Der Hotkey wird aktiviert. Wirkungslos, wenn der Hotkey bereits aktiv ist.</p>
          <p><strong>Off</strong>: Der Hotkey wird deaktiviert. Wirkungslos, wenn der Hotkey bereits inaktiv ist.</p>
          <p><strong>Toggle</strong>: Der Status des Hotkeys wird umgekehrt (aktiviert oder deaktiviert).</p>
          <p><strong>AltTab</strong> (und andere): Spezielle Alt-Tab-Aktionen, die <a href="../Hotkeys.htm#alttab">hier</a> beschrieben werden.</p>
          <p>Hinweis: Diese Werte haben nur eine besondere Bedeutung, <u>wenn kein entsprechendes Label vorhanden ist</u>. Wenn zum Beispiel ein Label <code>On:</code> existiert und dieser Parameter das Wort ON enth&auml;lt, dann wird dieses Wort als Labelname behandelt. Damit Hotkeys in solchen F&auml;llen aktiviert oder deaktiviert werden k&ouml;nnen, verwendet den <i>Optionen</i>-Parameter. <i>Label</i> kann weggelassen werden, z. B. <code>Hotkey Esc,, Off</code>.</p>
          <p>Hinweis: Die <a href="Hotkey.htm#IfWin">aktuelle Einstellung von IfWin</a> bestimmt die <a href="Hotkey.htm#variant">Variante</a> eines Hotkeys, auf die sich On/Off/Toggle beziehen wird.</p></td>
      </tr>
      <tr>
        <td>Optionen</td>
        <td><p>Ein String, der entweder leer ist oder mehrere folgende Optionen enthalten kann, optional durch Leerzeichen getrennt. Zum Beispiel: UseErrorLevel B0</p>
          <p id="UseErrorLevel"><strong>UseErrorLevel</strong>: Sobald der Befehl auf ein Problem st&ouml;&szlig;t, wird jede Warnung &uuml;bersprungen, <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf einen Code aus der <a href="#ErrorLevel">unteren</a> Tabelle gesetzt und der <a href="../misc/Threads.htm">aktuelle Thread</a> fortgesetzt.</p>
          <p><strong>On</strong>: Aktiviert den Hotkey, falls er zuvor deaktiviert wurde.</p>
          <p><strong>Off</strong>: Deaktiviert den Hotkey, falls er zuvor aktiviert wurde. Diese Option wird normalerweise dazu verwendet, einen Hotkey zun&auml;chst im deaktivierten Zustand zu erstellen.</p>
          <p><strong>B</strong> oder <strong>B0</strong>: Mit dem Buchstaben B wird ein Hotkey zwischengespeichert, wie in <a href="_MaxThreadsBuffer.htm">#MaxThreadBuffer</a> beschrieben. Mit B0 (B mit einer 0) wird diese Art der Zwischenspeicherung wieder deaktiviert.</p>
          <p><strong>Pn</strong>: Nach dem Buchstaben P kann die <a href="../misc/Threads.htm">Thread-Priorit&auml;t</a> des Hotkeys angegeben werden. Ist die P-Option beim Erstellen eines Hotkeys nicht vorhanden, wird stattdessen eine 0 verwendet.</p>
          <p><strong>Tn</strong>: Nach dem Buchstaben T kann die maximale Anzahl an Threads angegeben werden, wie in <a href="_MaxThreadsPerHotkey.htm">#MaxThreadsPerHotkey</a> beschrieben. Zum Beispiel: T5.</p>
          <p>Wenn die Optionen <strong>B</strong> und/oder <strong>T</strong> weggelassen werden und der Hotkey bereits vorhanden ist, bleiben diese Optionen unver&auml;ndert. Sollte der Hotkey aber noch nicht vorhanden sein (das hei&szlig;t, wenn er kurz davor ist, von diesem Befehl erstellt zu werden), werden standardm&auml;&szlig;ig die Optionen verwendet, welche zurzeit aktiv sind. Zum Beispiel wird die Instanz von <a href="_MaxThreadsBuffer.htm">#MaxThreadBuffer</a> verwendet, die im Script ganz unten vorkommt. Wird die Direktive <a href="_MaxThreadsBuffer.htm">#MaxThreadBuffer</a> nie im Script verwendet, gilt deren Standardeinstellung (in diesem Fall OFF). Dieses Verhalten trifft auch auf <a href="_IfWinActive.htm">#IfWin</a> zu: Nur das unterste Vorkommen gilt f&uuml;r neu erstellte Hotkeys, es sei denn, "<a href="#IfWin">Hotkey IfWin</a>" wurde seit dem Start des Scripts ausgef&uuml;hrt.</p>
          <p>Hinweis: Die <a href="Hotkey.htm#IfWin">aktuelle Einstellung von IfWin</a> bestimmt die <a href="Hotkey.htm#variant">Variante</a> eines Hotkeys, auf die sich der Hotkey-Befehl beziehen wird. Sollte die Variante nicht vorhanden sein, wird sie erst erstellt.</p></td>
      </tr>
      <tr>
        <td>IfWinActive<br>
          IfWinExist</td>
        <td>(IfWin<strong>Not</strong>Active und IfWin<strong>Not</strong>Exist werden auch unterst&uuml;tzt). Diese Unterbefehle machen alle danach erstellten Hotkeys kontextabh&auml;ngig. Siehe <a href="#IfWin">unten</a> f&uuml;r weitere Details.</td>
      </tr>
      <tr>
        <td>Fenstertitel<br>
          Fenstertext</td>
        <td><p>Innerhalb dieser Parameter wird jeder Variablenverweis wie %var% best&auml;ndig, sobald der Befehl zum Abschluss kommt. Das hei&szlig;t, dass nachfolgende &Auml;nderungen am Variableninhalt nicht von vorhandenen IfWin-Hotkeys erkannt werden.</p>
          <p>Beim <em>Fenstertitel</em> und <em>Fenstertext</em> gelten, wie bei <a href="_IfWinActive.htm">#IfWinActive/Exist</a> auch, die Standardeinstellungen von <a href="SetTitleMatchMode.htm">SetTitleMatchMode</a> und <a href="DetectHiddenWindows.htm">DetectHiddenWindows</a>, die im <a href="../Scripts.htm#auto">automatischen Ausf&uuml;hrungsbereich</a> bestimmt wurden. Siehe <a href="_IfWinActive.htm">#IfWinActive/Exist</a> f&uuml;r weitere Details.</p></td>
      </tr>
      <tr id="If">
        <td>If, Ausdruck</td>
        <td><span class="ver">[AHK_L]:</span> Gegenst&uuml;ck von <a href="_If.htm">#If <i>Ausdruck</i></a>. Der <i>Ausdruck</i> muss exakt mit dem Text eines <b>bestehenden</b> <code>#If <i>Ausdruck</i></code> &uuml;bereinstimmen, au&szlig;er bei <code>#If</code> oder <code>#If,</code>. Wird das mit dem Hotkey-Befehl verwendet, muss das Komma nach "If" angegeben werden. Obwohl dieser Befehl nicht in der Lage ist, neue Ausdr&uuml;cke zu erstellen, k&ouml;nnen dennoch neue Hotkeys erstellt werden, die einen bereits vorhandenen Ausdruck verwenden. Siehe <a href="_If.htm#ex4">4. Beispiel von #If</a>.</td>
      </tr>
    </table>
    <h3 id="ErrorLevel">ErrorLevel</h3>
    <p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
    <p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> &auml;ndert sich nur, wenn:</p>
    <ol>
      <li>der erste Parameter IfWin[Not]Active/Exist ist. In diesem Fall wird ErrorLevel bei Misserfolg auf 1 und bei Erfolg auf 0 gesetzt. </li>
      <li>das Wort UseErrorLevel in den <em>Optionen</em> vorhanden ist.</li>
    </ol>
    <table class="info">
      <tr>
        <th>Fehler</th>
        <th>Beschreibung</th>
      </tr>
      <tr>
        <td>1</td>
        <td>Der <em>Label</em>-Parameter verweist auf einen nicht vorhandenen Labelnamen. </td>
      </tr>
      <tr>
        <td>2</td>
        <td>Der <em>Tastenname</em>-Parameter enth&auml;lt eine oder mehrere Tasten, die weder erkannt noch von der aktuellen Tastaturbelegung/Sprache unterst&uuml;tzt werden.</td>
      </tr>
      <tr>
        <td>3</td>
        <td>Nicht unterst&uuml;tzte Pr&auml;fixtaste. Zum Beispiel ist es nicht m&ouml;glich, das Mausrad als Pr&auml;fix in einem Hotkey wie <em>WheelDown &amp; Enter</em> zu verwenden.</td>
      </tr>
      <tr>
        <td>4</td>
        <td>Der <em>Tastenname</em> ist nicht f&uuml;r Aktionen mit <a href="../Hotkeys.htm#alttab">AltTab oder ShiftAltTab</a> geeignet. Es m&uuml;ssen immer zwei Tasten kombiniert werden. Zum Beispiel: <em>RControl &amp; RShift::AltTab</em></td>
      </tr>
      <tr>
        <td>5</td>
        <td>Der Befehl versucht, einen nicht vorhandenen Hotkey zu &auml;ndern.</td>
      </tr>
      <tr>
        <td>6</td>
        <td>Der Befehl versucht, eine nicht vorhandene <a href="#variant">Variante</a> eines vorhandenen Hotkeys zu &auml;ndern. Um dieses Problem zu beheben, verwendet "<a href="#IfWin">Hotkey IfWin</a>", um &Uuml;bereinstimmungskriterien f&uuml;r Hotkeys zu bestimmen, die ge&auml;ndert werden sollen.</td>
      </tr>
      <tr>
        <td>50</td>
        <td>Windows 95/98/Me: Der Befehl wurde erfolgreich ausgef&uuml;hrt, aber das Betriebssystem weigert sich, den Hotkey zu aktivieren. Dieser Fehler wird eigentlich nur verursacht, wenn der Hotkey gerade von einem anderen Script oder einer anderen Anwendung verwendet wird (oder vom Betriebssystem selbst). Das passiert nur in Windows 95/98/Me. Bei anderen Betriebssystemen greift das Programm auf den <a href="_InstallKeybdHook.htm">Tastatur-Hook</a> zur&uuml;ck, um dieses Problem zu <a href="../misc/Override.htm">&uuml;berschreiben</a>.</td>
      </tr>
      <tr>
        <td>51</td>
        <td>Windows 95/98/Me: Der Befehl wurde erfolgreich ausgef&uuml;hrt, aber der Hotkey wird vom Betriebssystem nicht unterst&uuml;tzt. Solche Betriebssysteme unterst&uuml;tzen zum Beispiel keine Maus- und Pr&auml;fix-Hotkeys wie "a &amp; b".</td>
      </tr>
      <tr>
        <td>98</td>
        <td>Dieser Hotkey w&uuml;rde die Begrenzung von 1000 Hotkeys pro Script &uuml;berschreiten (allerdings darf jeder Hotkey unendlich viele <a href="#variant">Varianten</a> haben; <a href="../Hotstrings.htm">Hotstrings</a> hingegen sind nicht begrenzt).</td>
      </tr>
      <tr>
        <td>99</td>
        <td>Nicht genug Arbeitsspeicher. Das ist sehr selten und passiert f&uuml;r gew&ouml;hnlich nur, wenn das Betriebssystem instabil ist.</td>
      </tr>
    </table>
    <br>
    <p>Tipp: Mit UseErrorLevel kann &uuml;berpr&uuml;ft werden, ob eine Hotkey-Variante vorhanden ist. Zum Beispiel:</p>
    <pre>Hotkey, ^!p,, UseErrorLevel
If ErrorLevel in 5,6
   MsgBox Der Hotkey ist weder vorhanden noch hat er eine Variante mit den aktuellen IfWin-Kriterien.</pre>
    <h3>Bemerkungen</h3>
    <p>Wenn das Ziel darin besteht, basierend auf den Typ des aktiven Fensters bestimmte Hotkeys oder Hotstrings automatisch zu deaktivieren, dann ist <code>Hotkey, ^!c, Off</code> in der Regel weniger gut geeignet als <a href="_IfWinActive.htm">#IfWinActive/Exist</a> (oder das dynamische Gegenst&uuml;ck <a href="#IfWin">Hotkey, IfWinActive/Exist</a>).</p>
    <p>Aus Performance-Gr&uuml;nden sind Hotkeys, die mit <a href="../Hotkeys.htm">zwei Doppelpunkten</a> erstellt wurden, besser als Hotkeys, die mit dem Hotkey-Befehl erstellt wurden. Der Grund ist, dass diese Hotkeys beim Starten des Scripts gleichzeitig aktiviert werden (statt einzeln). Daher sollte dieser Befehl nur bei Hotkeys verwendet werden, deren Tastennamen erst nach dem Scriptstart bekannt sind. Zum Beispiel, um die Hotkeys im Script f&uuml;r verschiedene Aktion mittels einer <a href="IniRead.htm">INI-Datei</a> konfigurierbar zu machen.</p>
    <p>Ein Label kann das Ziel von mehreren Hotkeys sein. Mit der internen Variable <a href="../Variables.htm#ThisHotkey">A_ThisHotkey</a> kann ermittelt werden, mit welchem Hotkey ein Label aufgerufen wurde. </p>
    <p>Sobald das Script mit <a href="Suspend.htm">Suspend</a> unterbrochen wird, werden neu hinzugef&uuml;gte/aktivierte Hotkeys auch unterbrochen. Sie werden wieder aktiviert, wenn diese Art der Unterbrechung aufgehoben wird (sofern sie nicht davon ausgenommen werden, wie im <a href="Suspend.htm">Suspend</a>-Abschnitt beschrieben).</p>
    <p>Die <a href="_InstallKeybdHook.htm">Tastatur</a>- und/oder <a href="_InstallMouseHook.htm">Maus</a>-Hooks werden bei diesem Befehl je nach Bedarf automatisch installiert oder entfernt.</p>
    <p>Obwohl der Hotkey-Befehl nicht in der Lage ist, Hotkeys in anderen Scripts direkt zu aktivieren oder zu deaktivieren, kann er sie dennoch meistens durch Erstellen oder Aktivieren derselben Hotkeys <a href="../misc/Override.htm">&uuml;berschreiben</a>. Das h&auml;ngt von mehreren Faktoren ab:</p>
    <ol>
      <li>Ob der Hotkey, der &uuml;berschrieben werden soll, ein <a href="ListHotkeys.htm">Hook-Hotkey</a> im anderen Script ist (Hotkeys ohne Hook k&ouml;nnen immer &uuml;berschrieben werden, au&szlig;er in Win9x).</li>
      <li>Die Tatsache, dass die zuletzt gestarteten Hotkeys im Script generell Vorrang vor den Hotkeys aus den anderen Scripts haben. </li>
      <li>Ob der <a href="_InstallKeybdHook.htm">Tastatur</a>- oder <a href="_InstallMouseHook.htm">Maus</a>-Hook beim Aktivieren oder Erstellen des Hotkeys erneut aktiviert wird (in diesem Fall ist das &Uuml;berschreiben immer erfolgreich).</li>
    </ol>
    <p>Sobald ein Script mindestens einen Hotkey enth&auml;lt, wird es persistent. Das hei&szlig;t, dass <a href="ExitApp.htm">ExitApp</a> anstelle von Exit verwendet werden muss, um dieses Script zu beenden. Zudem d&uuml;rfen Hotkey-Scripts standardm&auml;&szlig;ig nur einmal vorkommen, es sei denn, <em><a href="_SingleInstance.htm">#SingleInstance</a>, Off</em> wird verwendet.</p>
    <h3 id="IfWin">Bemerkungen zu <em>Hotkey, IfWinXX [, Fenstertitel, Fenstertext]</em></h3>
    <p>Mit "Hotkey IfWin" k&ouml;nnen kontextabh&auml;ngige <a href="../Hotkeys.htm">Hotkeys</a> erstellt und ge&auml;ndert werden, w&auml;hrend das Script l&auml;uft (Direktiven wie <a href="_IfWinActive.htm">#IfWinActive/Exist</a> sind hingegen von der Position abh&auml;ngig und werden bereits vor dem Scriptstart wirksam). Zum Beispiel:</p>
    <pre>Hotkey, IfWinActive, ahk_class Notepad
Hotkey, ^!e, EigenesLabel  <em>; Erstellt einen Hotkey, der nur im Editor funktioniert.</em></pre>
    <p>Alle <a href="../Hotkeys.htm">Hotkeys</a> sind kontextabh&auml;ngig, die nach "Hotkey IfWin" erstellt oder ge&auml;ndert werden. Dar&uuml;ber hinaus schlie&szlig;en sich die IfWin-Unterbefehle gegenseitig aus. Das hei&szlig;t, dass nur der aktuellste Unterbefehl wirksam ist.</p>
    <p>Um die Kontextabh&auml;ngigkeit zu deaktivieren (das hei&szlig;t, um danach erstellte Hotkeys f&uuml;r alle Fenster wirksam zu machen), verwendet einen beliebigen IfWin-Unterbefehl ohne den Parametern <em>Fenstertitel</em> und <em>Fenstertext</em>. Zum Beispiel: <code>Hotkey, IfWinActive</code>.</p>
    <p>Sollte "Hotkey IfWin" nie im Script verwendet werden, wird die zuletzt verwendete <a href="_IfWinActive.htm">#IfWin</a>-Direktive (falls vorhanden) f&uuml;r den Hotkey-Befehl wirksam.</p>
    <p>Falls ein Maus- oder Tastatur-Hotkey mit IfWin deaktiviert ist, f&uuml;hrt es seine urspr&uuml;ngliche Funktion durch. Das hei&szlig;t, dass er an das aktive Fenster &uuml;bergeben wird, als g&auml;be es nicht diesen Hotkey. Folgende Ausnahmen gelten dabei:</p>
    <ol>
      <li>In Windows 95/98/Me hat das Dr&uuml;cken eines Hotkeys, der mit IfWin deaktiviert wurde, keinen Effekt (selbst seine urspr&uuml;ngliche Funktion nicht).</li>
      <li>Auch wenn IfWin bei Joystick-Hotkeys funktioniert, werden andere Programme nicht daran gehindert, das Dr&uuml;cken einer Joysticktaste zu erkennen.</li>
    </ol>
    <h3 id="variant">Hotkey-Varianten (-Duplikate)</h3>
    <p>Ein bestimmter Hotkey kann mehrmals erstellt werden, wenn f&uuml;r jede Definition ein anderes IfWin-Kriterium angegeben wird. Auch bekannt als <em>Hotkey-Varianten</em>. Zum Beispiel:</p>
    <pre>Hotkey, IfWinActive, ahk_class Notepad
Hotkey, ^!c, EigenesLabelF&uuml;rEditor
Hotkey, IfWinActive, ahk_class WordPadClass
Hotkey, ^!c, EigenesLabelF&uuml;rWordPad
Hotkey, IfWinActive
Hotkey, ^!c, EigenesLabelF&uuml;rRestlicheFenster</pre>
    <p>Falls mehrere Hotkey-Varianten zur Ausf&uuml;hrung berechtigt sind, hat die zuletzt erstellte Variante oberste Priorit&auml;t. Die Ausnahme davon ist die globale Variante (ohne IfWin-Kriterium): Sie hat immer die niedrigste Priorit&auml;t und wird daher nur ausgef&uuml;hrt, wenn keine andere Variante berechtigt ist.</p>
    <p>Beim Erstellen von Hotkey-Duplikaten k&ouml;nnen die <a href="../Hotkeys.htm#Symbols">Modifikatorzeichen</a> (z. B. ^!+#) nach Belieben angeordnet werden. Zum Beispiel ist ^!c das gleiche wie !^c. Allerdings m&uuml;ssen die Tasten &uuml;bereinstimmend aufgeschrieben werden. Zum Beispiel ist hierbei das <em>Esc</em> nicht das gleiche wie <em>Escape</em>. Hotkeys mit <a href="../Hotkeys.htm#wildcard">Platzhalter-Pr&auml;fix (*)</a> und Hotkeys ohne Platzhalter sind voneinander getrennt. Zum Beispiel w&uuml;rden F1 und *F1 jeweils ihre eigenen Varianten haben.</p>
    <p>Siehe <a href="_IfWinActive.htm#gen">Bemerkungen zu #IfWin</a>, um mehr dar&uuml;ber zu erfahren.</p>
    <h3>Verwandte Befehle</h3>
    <p><a href="../Hotkeys.htm#Symbols">Hotkey-Symbole</a>, <a href="_IfWinActive.htm">#IfWinActive/Exist</a>, <a href="_MaxThreadsBuffer.htm">#MaxThreadsBuffer</a>, <a href="_MaxThreadsPerHotkey.htm">#MaxThreadsPerHotkey</a>, <a href="Suspend.htm">Suspend</a>, <a href="../Functions.htm#IsLabel">IsLabel()</a>, <a href="../misc/Threads.htm">Threads</a>, <a href="Thread.htm">Thread</a>, <a href="Critical.htm">Critical</a>, <a href="Gosub.htm">Gosub</a>, <a href="Return.htm">Return</a>, <a href="Menu.htm">Menu</a>, <a href="SetTimer.htm">SetTimer</a></p>
    <h3>Beispiele</h3>
    <pre class="NoIndent">Hotkey, ^!z, EigenesLabel
Return

EigenesLabel:
MsgBox %A_ThisHotkey% wurde gedr&uuml;ckt.
Return

<em>; Andere Beispiele:</em>
Hotkey, RCtrl &amp; RShift, AltTab <em>; Erm&ouml;glicht, dass RCtrl &amp; RShift wie Alt-Tab funktioniert.</em>
Hotkey, #c, On  <em>; Reaktiviert den Hotkey Win+C.</em>
Hotkey, $+#c, Off  <em>; Deaktiviert den Hotkey Umschalt+Win+C.</em>
Hotkey, ^!a, , T5  <em>; Erlaubt 5 Threads f&uuml;r diesen Hotkey.</em>

Hotkey, IfWinActive, ahk_class Notepad
Hotkey, ^!c, EigenesLabelF&uuml;rNotepad  <em>; Erstellt Strg+Alt+C als Hotkey, der nur im Editor funktioniert.</em></pre>
  </div>
</div>
</body>
</html>