<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>If Variable [not] in/contains Wert1,Wert2,...</title>
<meta name="keywords" content="Befehl, Ablaufsteuerung, Bedingte Anweisung, String">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
<div id="content">
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>If Variable [not] in Wert1,Wert2,...<br> If Variable [not] contains Wert1,Wert2,...</h1>

<p>&Uuml;berpr&uuml;ft, ob der Inhalt der <a href="../Variables.htm">Variable</a> mit einem Element aus der Liste &uuml;bereinstimmt.</p>

<pre class="Syntax">If <i>Variable</i> in <i>&Uuml;bereinstimmungsliste</i>
If <i>Variable</i> not in <i>&Uuml;bereinstimmungsliste<br></i>
If <i>Variable</i> contains <i>&Uuml;bereinstimmungsliste</i>
If <i>Variable</i> not contains <i>&Uuml;bereinstimmungsliste</i></pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">Variable</td>
    <td width="85%">Name der <a href="../Variables.htm">Variable</a>, dessen Inhalt &uuml;berpr&uuml;ft wird. Bei dem Operator "in" ist eine exakte &Uuml;bereinstimmung mit einem Element aus der Liste notwendig. Bei dem Operator "contains" verh&auml;lt sich die &Uuml;bereinstimmung toleranter: sobald die <em>Variable</em> ein Element aus der Liste als Teilstring enth&auml;lt.</td>
  </tr>
  <tr>
    <td>&Uuml;bereinstimmungsliste</td>
    <td><p>Eine kommagetrennte Liste aus Strings, die mit dem Inhalt der <em>Variable</em> verglichen werden. <strong>Alle Leer- und Tabulatorzeichen um Trennkommas sind bedeutend</strong>, d. h. sie sind ein Teil des &uuml;bereinstimmenden Strings. Zum Beispiel: Wenn die <em>&Uuml;bereinstimmungsliste</em> <em>ABC , XYZ</em> enth&auml;lt, dann muss die <em>Variable</em> f&uuml;r eine &Uuml;bereinstimmung entweder ABC mit nachfolgendem Leerzeichen oder XYZ mit f&uuml;hrendem Leerzeichen enthalten.</p>
      <p>Zwei aufeinanderfolgende Kommas bilden ein direkt vorhandenes Komma. Das folgende Beispiel erstellt ein direkt vorhandenes Komma nach dem Wort string1: <em>If Variable In string1,,,string2</em>. Ebenso enth&auml;lt die folgende Liste nur ein einzelnes Element mit einem direkt vorhandenen Komma dazwischen: <em>If Variable In single,,item</em>. F&uuml;r das Hinzuf&uuml;gen eines leeren Elements muss das erste Zeichen ein Komma sein: <em>If Variable In ,string1,string2</em> (wenn der Operator "contains" verwendet wird, dann ist die &Uuml;bereinstimmung mit einem leeren Element immer erfolgreich, da ein leerer String immer in einem String gefunden wird).</p>
      <p>Da die Elemente in der <em>&Uuml;bereinstimmungsliste</em> nicht als einzelne Parameter behandelt werden, kann sich die komplette Liste in einer Variable befinden. In der Tat muss sich alles oder ein Teil davon in der Variable befinden, wenn eine L&auml;nge von 16383 &uuml;berschritten wird (die maximale L&auml;nge einer Script-Zeile). Zum Beispiel k&ouml;nnte die <em>&Uuml;bereinstimmungsliste</em> aus %List1%,%List2%,%List3% bestehen, jede Liste enth&auml;lt eine lange Liste mit Elementen.</p>
      <p>Jedes einzelne Element in einer Liste, das l&auml;nger als 16384 Zeichen ist, behandelt die zus&auml;tzlichen Zeichen als ein neues Element. Daher ist es das Beste, solche Elemente zu vermeiden.</p></td>
  </tr>
</table>

<h3>Bemerkungen</h3>
<p>Der Vergleich erfolgt immer alphabetisch, nicht numerisch. Zum Beispiel stimmt der String "11" nicht mit dem Listenelement "11.0" &uuml;bereinstimmen.</p>
<p>Der Operator "contains" ist das gleiche wie <a href="IfInString.htm">IfInString/IfNotInString</a>, aber mit der Ausnahme, dass die Mehrfachsuche von Strings unterst&uuml;tzt wird (einer stimmt &uuml;berein).</p>
<p>In diesem Fall kann <em><a href="StringCaseSense.htm">StringCaseSense On</a></em> verwendet werden, um den Vergleich abh&auml;ngig von der Gro&szlig;- bzw. Kleinschreibung zu machen.</p>
<p>Wenn <em>&Uuml;bereinstimmungsliste</em> lang ist, dann kann die Liste in mehreren kurzen Zeilen aufgeteilt werden (<a href="../Scripts.htm#continuation">Fortsetzungsbereich</a>), die die Lesbarkeit und Wartbarkeit verbessern k&ouml;nnten.</p>
<p><strong>Die Operatoren "between", "is", "in" und "contains" werden in <a href="../Variables.htm#Expressions">Ausdr&uuml;cken</a> nicht unterst&uuml;tzt.</strong></p>
<h3>Verwandte Befehle</h3>
<p><a href="IfBetween.htm">If Variable between</a>, <a href="IfEqual.htm">IfEqual/Greater/Less</a>, <a href="IfInString.htm">IfInString</a>, <a href="StringCaseSense.htm">StringCaseSense</a>, <a href="Block.htm"> Blocks</a>, <a href="Else.htm">Else</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent">If Variable in exe,bat,com
    MsgBox Die Datei ist ausf&uuml;hrbar.

If Variable in 1,2,3,5,7,11 <em>; Leerzeichen vermeiden.</em>
    MsgBox %Variable% ist eine kleine Primzahl.

If Variable contains 1,3  <em>; Die Werte werden als Strings verglichen, nicht als Zahlen.</em>
    MsgBox Variable enth&auml;lt die Zahl 1 oder 3 (Variable kann eine 1, 3, 10, 21, 23, etc. sein)

If Variable in %&Uuml;bereinstimmungsliste%
    MsgBox %Variable% ist in der Liste.

InputBox, UserInput, JA oder NEIN eingeben
If UserInput not in ja,nein
    MsgBox Ihre Eingabe ist ung&uuml;ltig.

WinGetTitle, aktiv_titel, A
If aktiv_titel contains Address List.txt,Customer List.txt
    MsgBox Ein gew&uuml;nschtes Fenster ist aktiv.
If aktiv_titel not contains metapad,Notepad
    MsgBox Aber die Datei wurde nicht mit Metapad oder Notepad ge&ouml;ffnet.</pre>
</div>
</div>
</body>
</html>