<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>If Variable is [not] Typ</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>

<h1>If Variable is [not] Typ</h1>

<p>&Uuml;berpr&uuml;ft, ob der Inhalt der <a href="../Variables.htm">Variable</a> numerisch, gro&szlig; geschrieben, etc.</p>

<pre class="Syntax">If Variable is <i>Typ</i>
If Variable is not <i>Typ</i> </pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">Variable</td>
    <td width="85%">Der Name der <a href="../Variables.htm">Variable</a>.</td>
  </tr>
  <tr>
    <td>Typ</td>
    <td>Siehe Bemerkungen. </td>
  </tr>
</table>

<h3>Bemerkungen</h3>
<p>Unterst&uuml;tzte <em>Typen</em>:</p>
<table class="info">
  <tr>
    <td width="15%">integer</td>
    <td width="85%">Wahr, wenn die <em>Variable</em> nicht leer ist und einen reinen numerischen String (dezimal oder hexadezimal) ohne Dezimalpunkt enth&auml;lt. F&uuml;hrende oder nachfolgende Leerzeichen und Tabulatoren sind erlaubt. Der String kann mit einem Plus- oder Minuszeichen beginnen.</td>
  </tr>
  <tr>
    <td>float</td>
    <td>Wahr, wenn die <em>Variable</em> nicht leer ist und eine Flie&szlig;kommazahl enth&auml;lt; d. h. ein reiner numerischer String mit Dezimalpunkt. F&uuml;hrende oder nachfolgende Leerzeichen und Tabulatoren sind erlaubt.  Der String kann mit einem Pluszeichen, Minuszeichen oder Dezimalpunkt beginnen.</td>
  </tr>
  <tr>
    <td>number</td>
    <td>Wahr, wenn die <em>Variable</em> eine Integer- oder Flie&szlig;kommazahl enth&auml;lt (beide werden weiter oben beschrieben).</td>
  </tr>
  <tr>
    <td>digit</td>
    <td>Wahr, wenn die <em>Variable</em> leer ist oder nur Zahlen enth&auml;lt, die nur aus den Zeichen 0 bis 9 bestehen. Folgende Zeichen sind nicht erlaubt: Leerzeichen, Tabulatoren, Plus- und Minuszeichen, Dezimalpunkte, Hexadezimalzahlen und 0x-Pr&auml;fix. </td>
  </tr>
  <tr>
    <td>xdigit</td>
    <td>Hexadezimale Zahlen: Das gleiche wie <em>digit</em> mit der Ausnahme, dass die Zeichen A bis F (gro&szlig; oder klein geschrieben) auch erlaubt sind. Seit v1.0.44.09 wird der 0x-Pr&auml;fix toleriert.</td>
  </tr>
  <tr>
    <td>alpha</td>
    <td>Wahr, wenn die <em>Variable</em> leer ist oder nur aus alphabetischen Zeichen besteht. Falsch, wenn Zahlen, Leerzeichen, Tabulatoren, Punkte oder andere nicht-alphabetische Zeichen im String sind. Wenn zum Beispiel die <em>Variable</em> ein Leerzeichen, gefolgt von einem Buchstaben, enth&auml;lt, dann wird die Variable <em>nicht</em> als <em>alpha</em> betrachtet. </td>
  </tr>
  <tr>
    <td>upper</td>
    <td>Wahr, wenn die <em>Variable</em> leer ist oder nur Gro&szlig;buchstaben enth&auml;lt. Falsch, wenn Zahlen, Leerzeichen, Tabulatoren, Punkte oder andere nicht-gro&szlig;geschriebene Zeichen im String sind.</td>
  </tr>
  <tr>
    <td>lower</td>
    <td>Wahr, wenn die <em>Variable</em> leer ist oder nur Kleinbuchstaben enth&auml;lt. Falsch, wenn Zahlen, Leerzeichen, Tabulatoren, Punkte oder andere nicht-kleingeschriebene Zeichen im String sind.</td>
  </tr>
  <tr>
    <td>alnum</td>
    <td>Das gleiche wie <em>alpha</em>, nur mit der Ausnahme, dass die Zeichen 0 bis 9 auch erlaubt sind.</td>
  </tr>
  <tr>
    <td>space</td>
    <td>Wahr, wenn die <em>Variable</em> leer ist oder nur unsichtbare Zeichen enth&auml;lt, welche folgende sein k&ouml;nnen: Leerzeichen (<a href="../Variables.htm">%A_Space%</a>), Tabulator (<a href="../Variables.htm">%A_Tab%</a> oder `t), LF-Zeichen (`n), CR-Zeichen (`r), vertikaler Tabulator (`v) und Seitenvorschub (`f).</td>
  </tr>
  <tr>
    <td>time</td>
    <td><p><a name="time"></a>Wahr, wenn die <em>Variable</em> einen g&uuml;ltigen Zeitstempel im <a href="FileSetTime.htm#YYYYMMDD">YYYYMMDDHH24MISS</a>-Format enth&auml;lt. Zum Beispiel wird ein 4-stelliger String wie 2004 als g&uuml;ltig angesehen. Mit <a href="StringLen.htm">StringLen</a> kann bestimmt werden, ob zus&auml;tzliche Zeitkomponenten vorhanden sind.</p>
      <p>Jahre unter 1601 sind ung&uuml;ltig, weil diese vom Betriebssystem in der Regel nicht unterst&uuml;tzt werden. Das h&ouml;chste Jahr ist 9999.</p>
      <p>Das Wort DATE kann als Ersatz f&uuml;r das Wort TIME verwendet werden, mit dem gleichen Ergebnis.</p>
    </td>
  </tr>
</table>
<p><b>Hinweis:</b> Die Operatoren "between", "is", "in" und "contains" werden in <a href="../Variables.htm#Expressions">Ausdr&uuml;cken</a> nicht unterst&uuml;tzt.</p>
<p><span class="ver">[AHK_L 42+]:</span> Das Gebietsschema des Betriebssystems wird ignoriert, es sei denn, <a href="StringCaseSense.htm">StringCaseSense Locale</a> wurde verwendet.</p>

<h3>Verwandte Befehle</h3>
<p><a href="../Variables.htm#YYYY">%A_YYYY%</a>, <a href="SetFormat.htm">SetFormat</a>, <a href="FileGetTime.htm">FileGetTime</a>, <a href="IfEqual.htm">IfEqual</a>, <a href="IfIn.htm">If Variable in/contains &Uuml;bereinstimmungsliste</a>, <a href="IfBetween.htm">If Variable between</a>, <a href="StringLen.htm">StringLen</a>, <a href="IfInString.htm">IfInString</a>, <a href="StringLower.htm">StringUpper</a>, <a href="EnvAdd.htm">EnvAdd</a><a href="Block.htm">, Blocks</a>, <a href="Else.htm">Else</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">If Variable is float
    MsgBox, %Variable% ist eine Flie&szlig;kommazahl.
Else If Variable is integer
    MsgBox, %Variable% ist eine Integerzahl.
If Variable is time
    MsgBox, %Variable% ist auch ein g&uuml;ltiger Zeitstempel.</pre>

</body>
</html>
