<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>ImageSearch</title>
<meta name="description" content="Use ImageSearch in this free macro program to search the screen for an ICO, BMP, or PNG image. Send keystrokes or mouse clicks in response.">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>

<h1>ImageSearch</h1>

<p>Sucht in einem bestimmten Bildschirmbereich nach einem Bild.</p>

<pre class="Syntax">ImageSearch, AusgabevariableX, AusgabevariableY, X1, Y1, X2, Y2, Bilddatei</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">AusgabevariableX/Y</td>
    <td width="85%"><p>Die Namen der Variablen, in denen die X- und Y-Koordinate des oberen linken Pixels gespeichert werden, wo das Bild gefunden wurde (wenn keine &Uuml;bereinstimmung vorhanden ist, dann werden diese Variablen leer gemacht). Koordinaten beziehen sich auf das aktive Fenster, es sei denn, <a href="CoordMode.htm">CoordMode</a> wurde dazu verwendet, dass zu &auml;ndern.</p>
    <p>Eine oder beide Parameter k&ouml;nnen leer gelassen werden. In diesem Fall kann mit ErrorLevel (siehe unten) festgestellt werden, ob eine &Uuml;bereinstimmung gefunden wurde.</p></td>
  </tr>
  <tr>
    <td>X1,Y1</td>
    <td>Die neuen X- und Y-Koordinaten der oberen linken Ecke des gesuchten Rechtecks, die <a href="../Variables.htm#Expressions">Ausdr&uuml;cke</a> sein k&ouml;nnen. <strong>Koordinaten beziehen sich auf das aktive Fenster, es sei denn, <a href="CoordMode.htm">CoordMode</a> wurde dazu verwendet, dass zu &auml;ndern.</strong></td>
  </tr>
  <tr>
    <td>X2,Y2</td>
    <td>Die neuen X- und Y-Koordinaten der unteren rechten Ecke des gesuchten Rechtecks, die <a href="../Variables.htm#Expressions">Ausdr&uuml;cke</a> sein k&ouml;nnen. Koordinaten beziehen sich auf das aktive Fenster, es sei denn, <a href="CoordMode.htm">CoordMode</a> wurde dazu verwendet, dass zu &auml;ndern.</td>
  </tr>
  <tr>
    <td>Bilddatei</td>
    <td><p>Der Name des Bildes, das sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis befindet, solange kein absoluter Pfad angegeben ist. Alle Betriebssysteme unterst&uuml;tzen GIF, JPG, BMP, ICO, CUR und ANI (BMP-Bilder m&uuml;ssen 16-Bit oder h&ouml;her sein). Andere Quellen von Icons k&ouml;nnen sein: EXE, DLL, CPL, SCR und andere Typen, die Icon-Ressourcen enthalten. In Windows XP (oder h&ouml;her) werden zus&auml;tzliche Bildformate wie PNG, TIF, Exif, WMF und EMF unterst&uuml;tzt. Betriebssysteme &auml;lter als XP k&ouml;nnen unterst&uuml;tzt werden, wenn die freie GDIPlus.dll von Microsoft in den Ordner der AutoHotkey.exe kopiert wird (im Falle eines <a href="../Scripts.htm#ahk2exe">kompilierten Scripts</a> muss die DLL-Datei in den Ordner des Scripts). Um die DLL herunterzuladen, sucht in <a href="http://www.microsoft.com">www.microsoft.com</a> mit folgenden Begriffen: gdi redistributable</p>
      <p><strong>Optionen</strong>: Beliebig viele folgende Strings k&ouml;nnen vor dem Dateinamen stehen. Die Optionen werden mit einem Leerzeichen oder Tabulator getrennt. Zum Beispiel: *2 *w100 *h-1 C:\Hauptlogo.bmp</p>
      <p><strong>*IconN</strong>: Um eine beliebige Icon-Gruppe in einer Datei zu verwenden, f&uuml;gt in den <I>Optionen</I> das Wort *Icon ein, gefolgt von der Gruppennummer. Mit *Icon2 beispielsweise wird das Standard-Icon aus der zweiten Icon-Gruppe geladen.</p>
    <p><strong>*n</strong> (Variation): F&uuml;r <strong>n</strong> kann eine Nummer zwischen 0 und 255 angegeben werden, um den Farbtontoleranzbereich von Rot-, Gr&uuml;n- und Blaukomponenten jeder Pixelfarbe zu bestimmen. Zum Beispiel erlaubt *2 zwei Farbtonvarianten. Dieser Parameter ist hilfreich, wenn die Bildfarbe leicht variiert oder die <em>Bilddatei</em> ein Format wie GIF oder JPG benutzt, dass auf dem Bildschirm nicht richtig dargestellt wird. Bei 255 Farbtonvarianten stimmen alle Farben &uuml;berein. Standard sind 0 Farbtonvarianten.</p>
    <p><strong>*TransN</strong>: Diese Option macht es einfacher, eine &Uuml;bereinstimmung zu finden, wenn eine Farbe des Bildes angegeben wird, die mit jeder beliebigen Farbe auf dem Bildschirm &uuml;bereinstimmt. Wird h&auml;ufig bei PNG-, GIF- und TIF-Dateien verwendet, die transparente Bereiche enthalten (Icons ben&ouml;tigen diese Option nicht, weil die Transparenz automatisch unterst&uuml;tzt wird). Bei GIF-Dateien funktioniert meistens *TransWhite. Bei PNG- oder TIF-Dateien eher *TransBlack. Ansonsten kann f&uuml;r <strong>N</strong> ein anderer Farbname oder RGB-Wert angegeben werden (siehe <a href="Progress.htm#colors">Farbtabelle</a> oder verwendet <a href="PixelGetColor.htm">PixelGetColor</a> im RGB-Modus). Beispiele: *TransBlack, *TransFFFFAA, *Trans0xFFFFAA</p>
    <p><strong>*wn</strong> und <strong>*hn</strong>: Bild auf die angegebene Breite und/oder H&ouml;he skaliert (diese Breite und H&ouml;he bestimmt auch, welches Icon von einer .ICO-Datei mit mehreren Icons geladen wird). Wenn beide Optionen weggelassen werden, dann werden die geladenen Icons von einer ICO-, DLL- oder EXE-Datei auf die Standardgr&ouml;&szlig;e f&uuml;r kleine Icons skaliert, in der Regel 16x16 (die aktuelle/interne Gr&ouml;&szlig;e kann mit *w0 *h0 erzwungen werden). Bilder, die keine Icons sind, werden in ihrer aktuellen Gr&ouml;&szlig;e geladen. Um das Bild unter Beibehaltung des Seitenverh&auml;ltnisses zu verkleinern oder zu vergr&ouml;&szlig;ern, verwendet -1 f&uuml;r eine Abmessung und eine positive Zahl f&uuml;r die andere Abmessung. Mit <em>*w200 *h-1</em> beispielsweise wird die Breite des Bildes auf 200 Pixel gesetzt und die H&ouml;he automatisch eingestellt.</p>    </td>
  </tr>
</table>

<h3>ErrorLevel</h3>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 0 gesetzt, wenn das Bild im angegeben Bereich gefunden wird. Ansonsten 1, wenn nicht oder 2, wenn der Befehl daran gehindert wird, die Suche durchzuf&uuml;hren (z. B. die Bilddatei kann nicht ge&ouml;ffnet werden oder eine falsch formatierte Option).</p>
<h3>Bemerkungen</h3>
<p>ImageSearch kann dazu verwendet werden, grafische Objekte auf einem Bildschirm zu erkennen, der kein Text beinhaltet oder der Text nicht einfach ermittelt werden kann. ImageSearch kann zum Beispiel die Position von Bild-Schaltfl&auml;chen, Icons, Links von Webseiten oder Objekte in Spiele erkennen. In diesem Fall k&ouml;nnen solche Objekte mithilfe von <a href="Click.htm">Click</a> angeklickt werden.</p>
<p>Es ist manchmal besser, nur einen kleinen Teil des Bildes zu suchen. Damit kann die Zuverl&auml;ssigkeit bei st&auml;ndig variierenden Bildern verbessert werden, bei denen bestimmte Bereiche gleich bleiben. Ein Ausschnitt kann z. B. wie folgt gemacht werden:</p>
<ol>
  <li> Alt+Druck dr&uuml;cken, w&auml;hrend das Bild im aktiven Fenster sichtbar ist. Der Screenshot landet in der Zwischenablage. </li>
  <li> Ein Bildbearbeitungsprogramm wie Paint &ouml;ffnen.</li>
  <li> Den Inhalt der Zwischenablage einf&uuml;gen (in diesem Fall der Screenshot).</li>
  <li> Bereich markieren, der nicht variiert und nur einmal im Bild vorkommt.</li>
  <li> Den Bereich kopieren und in einer neuen Bilddatei einf&uuml;gen.</li>
  <li> Die Datei speichern, damit sie mit ImageSearch verwenden werden kann.</li>
</ol>
<p>F&uuml;r eine &Uuml;bereinstimmung muss ein Bild auf dem Bildschirm so gro&szlig; wie das Bild sein, welches mit dem <em>Bilddatei</em>-Parameter und dessen Optionen geladen wurde.</p>
<p>Der Suchbereich muss sichtbar sein. Es ist nicht m&ouml;glich, den Bereich in einem Fenster zu suchen, das hinter einem anderen Fenster liegt. Im Gegensatz dazu werden Bilder, die sich unter dem Mauszeiger befinden, trotzdem erkannt. Die Ausnahme machen Zeiger in Spiele, die in den meisten F&auml;llen bestimmte Bilder darunter behindern.</p>
<p>Die Suche beginnt auf der obersten Zeile des Bereichs und arbeitet sich nach unten. Bei mehreren &Uuml;bereinstimmungen wird der oberste Fund bevorzugt.</p>
<p>Icons mit transparenter Farbe erlauben dieser Farbe, automatisch mit jeder Farbe auf dem Bildschirm &uuml;bereinzustimmen. Daher spielt die Farbe hinter dem Icon keine Rolle.</p>
<p>ImageSearch unterst&uuml;tzt Farbbildschirme mit 8-Bit (256 Farben) oder h&ouml;her.</p>
<p>Das Suchverhalten ist von der Farbtiefe der Grafikkarte abh&auml;ngig (besonders f&uuml;r GIF- und JPG-Dateien). Wenn ein Script mit mehreren Farbtiefen l&auml;uft, dann ist es das Beste, das Script mit jeder Tiefeneinstellung zu testen. Mit der Option f&uuml;r Farbtontoleranz (*n) kann das Verhalten mit mehreren Farbtiefen nachgeahmt werden.</p>
<p>Wenn das Bild auf dem Bildschirm durchsichtig ist, dann k&ouml;nnte die Suche mit ImageSearch fehlschlagen. Als &Uuml;bergangsl&ouml;sung kann die Option f&uuml;r Farbtontoleranz (*n) ausprobiert werden oder das Fenster kurzzeitig mit <a href="WinSet.htm#trans">WinSet, Transparent, Off</a> undurchsichtig machen.</p>
<h3>Verwandte Befehle</h3>
<p><a href="PixelSearch.htm">PixelSearch</a>, <a href="PixelGetColor.htm">PixelGetColor</a>, <a href="CoordMode.htm">CoordMode</a>, <a href="MouseGetPos.htm">MouseGetPos</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent">ImageSearch, FoundX, FoundY, 40,40, 300, 300, C:\Eigene Bilder\test.bmp

CoordMode Pixel  <em>;  Koordinaten beziehen sich auf dem Bildschirm, anstatt auf das aktive Fenster.</em>
ImageSearch, XPos, YPos, 0, 0, A_ScreenWidth, A_ScreenHeight, *Icon3 %A_ProgramFiles%\BeliebigerOrdner\BeliebigeApp.exe
If ErrorLevel = 2
    MsgBox Die Suche konnte nicht durchgef&uuml;hrt werden.
Else If ErrorLevel = 1
    MsgBox Icon konnte nicht auf dem Bildschirm gefunden werden.
Else
    MsgBox Das Icon wurde bei %XPos%x%YPos% gefunden.</pre>

</body>
</html>
