<!DOCTYPE HTML>
<html>
<head>
<title>InputBox</title>
<meta name="keywords" content="Befehl, Dialogfenster, Grafische Benutzeroberfl&auml;che">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
      <h1>InputBox</h1>
      <p>Zeigt ein Fenster zur Eingabe eines Strings an.</p>
      <pre class="Syntax">InputBox, AusgabeVar [, Titel, Anzeigetext, HIDE, Breite, H&ouml;he, X, Y, Schriftart, Zeit&uuml;berschreitung, Standardwert]</pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td>AusgabeVar</td>
          <td>Name der Variable, in der die Benutzereingabe gespeichert werden soll.</td>
        </tr>
        <tr>
          <td>Titel</td>
          <td>Der Titel der InputBox. Ist dieser Parameter leer oder nicht vorhanden, wird standardm&auml;&szlig;ig der aktuelle Name des Scripts verwendet. </td>
        </tr>
        <tr>
          <td>Anzeigetext</td>
          <td>Text des Eingabefensters, der darauf hinweist, was eingegeben werden soll. Falls der <em>Anzeigetext</em> zu lang ist, kann dieser in mehreren kurzen Zeilen aufgeteilt werden (<a href="../Scripts.htm#continuation">Fortsetzungsbereich</a>), um die Lesbarkeit und Wartbarkeit zu verbessern.</td>
        </tr>
        <tr>
          <td>HIDE</td>
          <td>Sobald dieser Parameter das Wort HIDE enth&auml;lt, wird die Benutzereingabe wie bei einer Passworteingabe mit Maskierungszeichen ersetzt.</td>
        </tr>
        <tr>
          <td>Breite</td>
          <td>Ist dieser Parameter leer oder nicht vorhanden, wird standardm&auml;&szlig;ig eine Breite von 375 Pixel verwendet. Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein.</td>
        </tr>
        <tr>
          <td>H&ouml;he</td>
          <td>Ist dieser Parameter leer oder nicht vorhanden, wird standardm&auml;&szlig;ig eine H&ouml;he von 189 Pixel verwendet. Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein.</td>
        </tr>
        <tr>
          <td>X, Y </td>
          <td>Die Koordinaten X und Y des Fensters (mit 0,0 wird das Fenster in die linke obere Ecke des Bildschirms geschoben), die <a href="../Variables.htm#Expressions">Ausdr&uuml;cke</a> sein k&ouml;nnen. Sobald eine der Koordinaten leer oder nicht vorhanden ist, wird das Fenster in dieser Abmessung zentriert. Jede Koordinate kann negativ sein, um das Fenster teilweise oder vollst&auml;ndig &uuml;ber den Bildschirmrand hinaus zu positionieren.</td>
        </tr>
        <tr>
          <td>Schriftart</td>
          <td>Noch nicht implementiert (leer lassen). In Zukunft k&ouml;nnte dieser Parameter so etwas &auml;hnliches wie verdana:8 akzeptieren.</td>
        </tr>
        <tr>
          <td>Zeit&uuml;berschreitung</td>
          <td>Zeit&uuml;berschreitung in Sekunden (kann einen Dezimalpunkt oder <a href="../Variables.htm#Expressions">Ausdruck</a> enthalten). Der Parameter wird automatisch auf 2147483 (24.8 Tage) zur&uuml;ckgesetzt, falls dieser Wert &uuml;berschritten wird. Sobald die Zeit abgelaufen ist, wird das Eingabefenster automatisch geschlossen und <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 2 gesetzt. <em>AusgabeVar</em> enth&auml;lt weiterhin die Benutzereingabe.</td>
        </tr>
        <tr>
          <td>Standardwert</td>
          <td>Ein String, der anf&auml;nglich im Eingabefeld des Dialogfensters angezeigt wird. Der Benutzer kann den String z. B. durch Dr&uuml;cken der R&uuml;cktaste &auml;ndern.</td>
        </tr>
      </table>
      <h3>ErrorLevel</h3>
      <p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
      <p>Siehe unten.</p>
      <h3>Bemerkungen</h3>
      <p>Mit diesem Dialogfenster kann der Benutzer einen Text eingeben und danach OK oder CANCEL (Abbrechen) dr&uuml;cken. Durch Ziehen der Rahmen kann dessen Gr&ouml;&szlig;e ge&auml;ndert werden.</p>
      <p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 1 gesetzt, wenn der Benutzer die Schaltfl&auml;che CANCEL dr&uuml;ckt, auf 0, wenn der Benutzer OK dr&uuml;ckt, oder auf 2, wenn das Dialogfenster die Zeit &uuml;berschritten hat. In allen drei F&auml;llen wird <em>AusgabeVar</em> auf den eingegebenen Wert gesetzt. Dadurch kann die Schaltfl&auml;che CANCEL au&szlig;er Abbrechen noch andere Funktionen ausf&uuml;hren, falls der Entwickler das w&uuml;nscht.</p>
      <p>Ein GUI-Fenster kann eine modale InputBox mittels <a href="Gui.htm#OwnDialogs">Gui, +OwnDialogs</a> anzeigen. Eine modale InputBox hindert den Benutzer daran, mit dem GUI-Fenster zu interagieren, bis die InputBox wieder geschlossen wird.</p>
      <h3>Verwandte Befehle</h3>
      <p><a href="Gui.htm">GUI</a>, <a href="Input.htm">Input</a>, <a href="MsgBox.htm">MsgBox</a>, <a href="FileSelectFile.htm">FileSelectFile</a>, <a href="FileSelectFolder.htm">FileSelectFolder</a>, <a href="SplashTextOn.htm">SplashTextOn</a>, <a href="ToolTip.htm">ToolTip</a></p>
      <h3>Beispiel</h3>
      <pre class="NoIndent">InputBox, Passwort, Passwort eingeben, (die Eingabe wird versteckt), hide
InputBox, Benutzereingabe, Telefonnummer, Bitte geben sie eine Telefonnummer ein., , 640, 480
If ErrorLevel
    MsgBox, Sie haben CANCEL gedr&uuml;ckt.
Else
    MsgBox, Sie haben "%Benutzereingabe%" eingegeben.</pre>
    </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>