<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>InputBox</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>

<h1>InputBox</h1>

<p>Zeigt ein Fenster zur Eingabe eines Strings an.</p>

<pre class="Syntax">InputBox, Ausgabevariable [, Titel, Anzeigetext, HIDE, Breite, H&ouml;he, X, Y, Schriftart, Zeit&uuml;berschreitung, Standardwert]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td>Ausgabevariable</td>
    <td>Der Name der Variable, in der der eingegebene Text des Benutzers gespeichert wird.</td>
  </tr>
  <tr>
    <td>Titel</td>
    <td>Der Titel der InputBox. Wenn leer oder nicht vorhanden, dann wird standardm&auml;&szlig;ig der aktuelle Name des Scripts verwendet. </td>
  </tr>
  <tr>
    <td>Anzeigetext</td>
    <td>Text des Eingabefensters, der darauf hinweist, was eingegeben werden soll. Wenn der <em>Anzeigetext</em> lang ist, dann kann die Liste in mehreren kurzen Zeilen aufgeteilt werden (<a href="../Scripts.htm#continuation">Fortsetzungsbereich</a>), die die Lesbarkeit und Wartbarkeit verbessern k&ouml;nnten.</td>
  </tr>
  <tr>
    <td>HIDE</td>
    <td>Wenn dieser Parameter das Wort HIDE ist, dann wird die Benutzereingabe verborgen, welches n&uuml;tzlich f&uuml;r Passw&ouml;rter ist.</td>
  </tr>
  <tr>
    <td>Breite</td>
    <td>Wenn dieser Parameter nicht vorhanden oder leer ist, dann ist die Standardbreite des Fensters 375. Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein.</td>
  </tr>
  <tr>
    <td>H&ouml;he</td>
    <td>Wenn dieser Parameter nicht vorhanden oder leer ist, dann ist die Standardh&ouml;he des Fensters 189. Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein.</td>
  </tr>
  <tr>
    <td>X, Y </td>
    <td>Die X- und Y-Koordinaten des Fensters (mit 0,0 wird das Fenster in die linken oberen Ecke des Bildschirms verschoben), die <a href="../Variables.htm#Expressions">Ausdr&uuml;cke</a> sein k&ouml;nnen. Wenn einer der Koordinaten leer- oder weggelassen wird, dann wird das Fenster in dieser Abmessung zentriert. Jede Koordinate kann negativ sein, d. h. das Fenster liegt somit teilweise au&szlig;erhalb des Bildschirms.</td>
  </tr>
  <tr>
    <td>Schriftart</td>
    <td>Noch nicht implementiert (leer lassen). Dieser Parameter k&ouml;nnte zuk&uuml;nftig so etwas &auml;hnliches wie verdana:8 akzeptieren.</td>
  </tr>
  <tr>
    <td>Zeit&uuml;berschreitung</td>
    <td>Zeit&uuml;berschreitung in Sekunden (kann einen Dezimalpunkt oder einen <a href="../Variables.htm#Expressions">Ausdruck</a> enthalten).&nbsp; Wenn dieser Wert 2147483 (24.8 Tage) &uuml;bersteigt, dann wird dieser auf 2147483 gesetzt. Wenn die Zeit abgelaufen ist, wird das Eingabefenster automatisch geschlossen und <a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 2 gesetzt. Die <em>Ausgabevariable</em> enth&auml;lt weiterhin die Eingabe des Benutzers.</td>
  </tr>
  <tr>
    <td>Standardwert</td>
    <td>Ein String, der anf&auml;nglich im Edit-Feld des Eingabefensters erscheint. Der Benutzer kann den String z. B. mit der R&uuml;cktaste &auml;ndern. </td>
  </tr>
</table>
<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p>Siehe unten.</p>
<h3>Bemerkungen</h3>
<p>Das Fenster erlaubt dem Benutzer, einen Text einzugeben und auf die Schaltfl&auml;chen OK oder ABBRECHEN zu dr&uuml;cken. Der Benutzer kann das Fenster durch das Ziehen der Rahmen skalieren.</p>
<p>Wenn der Benutzer die ABBRECHEN-Schaltfl&auml;che bet&auml;tigt: Bei AutoItv2-Scripts (.aut) ist die <em>Ausgabevariable</em> leer und <a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird nicht ge&auml;ndert. Bei allen anderen Script-Typen (z. B. .ahk, .ini) wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt (oder 0 f&uuml;r OK) und die <em>Ausgabevariable</em> enth&auml;lt den eingegeben Wert. Dadurch kann die ABBRECHEN-Schaltfl&auml;che nebenbei eine andere Funktion ausf&uuml;hren, wenn es gew&uuml;nscht ist.</p>
<p>Wenn die Wartezeit des Fensters abl&auml;uft, wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> bei allen Script-Typen auf 2 gesetzt. Daher sollten AutoItv2-Scripts den ErrorLevel direkt auf 0 setzen, bevor dieser Befehl mit einer Zeit&uuml;berschreitung verwendet wird.</p>
<p>Ein GUI-Fenster kann eine modale InputBox mittels <a href="Gui.htm#OwnDialogs">Gui, +OwnDialogs</a> anzeigen. Eine modale InputBox hindert den Benutzer solange daran, mit dem GUI-Fenster zu interagieren, bis die InputBox wieder geschlossen wird.</p>
<h3>Verwandte Befehle</h3>
<p><a href="Gui.htm">GUI</a>, <a href="Input.htm">Input</a>, <a href="MsgBox.htm">MsgBox</a>, <a href="FileSelectFile.htm">FileSelectFile</a>, <a href="FileSelectFolder.htm">FileSelectFolder</a>, <a href="SplashTextOn.htm">SplashTextOn</a>, <a href="ToolTip.htm">ToolTip</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">InputBox, Passwort, Passwort eingeben, (die Eingabe wird versteckt), hide
InputBox, Benutzereingabe, Telefonnummer, Bitte geben sie eine Telefonnummer ein., , 640, 480
If ErrorLevel
    MsgBox, ABBRECHEN wurde gedr&uuml;ckt.
Else
    MsgBox, Sie haben "%Benutzereingabe%" eingegeben.</pre>

</body>
</html>