<!DOCTYPE HTML>
<html>
<head>
<title>Loop</title>
<meta name="keywords" content="Befehl, Ablaufsteuerung, Schleife">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <article>
    <h1>Loop</h1>
    <p>Kontinuierliche Wiederholung von mehreren Befehlen: entweder mittels einer definierten Anzahl an Durchl&auml;ufen oder bis ein <a href="Break.htm">Break</a>-Befehl zum Abbruch auffordert.</p>
    <pre class="Syntax">Loop [, Z&auml;hlung]</pre>
    <h3>Parameter</h3>
    <table class="info">
      <tr>
        <td style="width: 15%;">Anzahl</td>
        <td style="width: 85%;"><p>Wie oft die Schleife wiederholt werden soll (Iteration). Wenn weggelassen, dann wiederholt sich die Schleife unendlich, bis ein <a href="Break.htm">Break</a> oder <a href="Return.htm">Return</a> auftritt.</p>
          <p>Wenn die <em>Z&auml;hlung</em> ein Variablenverweis wie %Elementz&auml;hlung% ist, dann wird die Schleife komplett &uuml;bersprungen, sobald die Variable leer ist oder eine Zahl kleiner 1 enth&auml;lt.</p>
          <p>Da <a href="LoopFile.htm">dateilesende Schleifen</a> unterst&uuml;tzt werden m&uuml;ssen, kann die <em>Z&auml;hlung</em> kein Ausdruck sein. Allerdings kann, wie bei allen Parametern ohne Ausdruck, ein Ausdruck erzwungen werden, wenn ein Prozentzeichen mit einem Leerzeichen davor steht. Zum Beispiel: <em>Loop % Z&auml;hlung + 1</em>. In solchen F&auml;llen wird der Ausdruck nur einmal ausgewertet, bevor die Schleife beginnt.</p></td>
      </tr>
    </table>
    <h3>Bemerkungen</h3>
    <p>Nach einer Schleife erfolgt f&uuml;r gew&ouml;hnlich ein <a href="Block.htm">Block</a>, der eine Sammlung an Anweisungen enth&auml;lt, um den <em>Schleifenk&ouml;rper</em> zu formen. Allerdings ben&ouml;tigt eine Schleife mit nur einer Anweisung keinen Block (in diesem Fall z&auml;hlt ein "If" und das dazugeh&ouml;rige "Else" als eine Anweisung).</p>
    <p>Eine h&auml;ufige Verwendung des Befehls ist eine Endlosschleife, die den <a href="Break.htm">Break</a>-Befehl irgendwo im <em>Schleifenk&ouml;rper</em> verwendet, um sie zu stoppen.</p>
    <p>Die Benutzung von <a href="Break.htm">Break</a> und <a href="Continue.htm">Continue</a> innerhalb einer Schleife dienen als Alternative f&uuml;r <a href="Goto.htm">Goto</a>, weil das Script dadurch besser verst&auml;ndlich und pflegbar ist. Um eine "Do...While"-Schleife zu erstellen, macht die letzte Anweisung des <em>Schleifenk&ouml;rpers</em> zur IF-Anweisung, die als Ersatz f&uuml;r dem <a href="Break.htm">Break</a>-Befehl dient. Mit der gleichen Technik kann eine "While"-Schleife erstellt werden, stattdessen sollte aber der <a href="While.htm">While</a>-Befehl verwendet werden.</p>
    <p>Die interne Variable <strong>A_Index</strong> enth&auml;lt die Nummer des aktuellen Schleifendurchlaufs. Zum ersten Mal enth&auml;lt die Variable eine 1, wenn der <em>Schleifenk&ouml;rper</em> ausgef&uuml;hrt wird. Zum zweiten Mal enth&auml;lt sie eine 2, und so weiter. Wenn eine innere Schleife durch eine &auml;u&szlig;ere Schleife eingeschlossen ist, dann hat die innere Schleife Vorrang. A_Index funktioniert mit jeder Schleifenvariante, einschlie&szlig;lich auch in <a href="LoopFile.htm">dateilesende Schleifen</a> und <a href="LoopReg.htm">Registrierung-Schleifen</a>. Au&szlig;erhalb einer Schleife enth&auml;lt A_Index eine 0.</p>
    <p>Der "<a href="Block.htm#otb">One True Brace Style</a>" kann gegebenenfalls mit einer normalen Schleife verwendet werden (aber nicht mit besonderen Schleifen wie <a href="LoopFile.htm">dateilesende Schleife</a> und <a href="LoopParse.htm">Parsing-Schleife</a>. Zum Beispiel:</p>
    <pre>Loop <strong>{</strong>
    ...
<strong>}</strong>
Loop %Z&auml;hlung% <strong>{</strong>
    ...
<strong>}</strong></pre>
    <p>Besondere Schleifen: Schleifen k&ouml;nnen verwendet werden, um Dateien, Ordner oder Registrierungseintr&auml;ge zu ermitteln (jeweils eins). Siehe <a href="LoopFile.htm">dateilesende Schleife</a> und <a href="LoopReg.htm">Registrierung-Schleife</a> f&uuml;r Details. Dar&uuml;ber hinaus agieren <a href="LoopReadFile.htm">dateilesende Schleifen</a> mit dem kompletten Inhalt einer Datei, Zeile f&uuml;r Zeile. Schlie&szlig;lich agieren <a href="LoopParse.htm">Parsing-Schleifen</a> mit bestimmten Feldern innerhalb eines abgegrenzten Strings.</p>
    <h3>Verwandte Befehle</h3>
    <p><a href="Until.htm">Until</a>, <a href="While.htm">While-Loop</a>, <a href="For.htm">For-Loop</a>, <a href="LoopFile.htm">Loop (Dateien & Ordner)</a>, <a href="LoopReg.htm">Registrierung-Loop</a>, <a href="LoopReadFile.htm">dateilesende Schleife</a>, <a href="LoopParse.htm">Parsing-Loop</a>, <a href="Break.htm">Break</a>, <a href="Continue.htm">Continue</a>, <a href="Block.htm">Blocks</a></p>
    <h3>Beispiele</h3>
    <pre class="NoIndent">Loop, 3
{
    MsgBox, Iterationsnummer ist %A_Index%.  <em>; A_Index wird 1, 2 und 3 sein.</em>
    Sleep, 100
}

Loop
{
    If a_index &gt; 25
        break  <em>; Schleife unterbrechen.</em>
    If a_index &lt; 20
        continue <em>; Folgendes &uuml;berspringen und neue Iteration starten.</em>
    MsgBox, a_index = %a_index% <em>; Hier werden nur die Nummern von 20 bis 25 angezeigt.</em>
}</pre>
  </article>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>
