<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>MouseClick</title>
<meta name="keywords" content="Befehl, Maus">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
<div id="content">
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>MouseClick</h1>

<p>Klickt, h&auml;lt eine Maustaste gedr&uuml;ckt oder dreht das Mausrad. HINWEIS: Der <a href="Click.htm">Click-Befehl</a> ist in der Regel flexibler und einfacher zu bedienen.</p>

<pre class="Syntax">MouseClick [, Taste, X, Y, Klickanzahl, Geschwindigkeit, D|U, R]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td>Taste</td>
    <td><p>Die zu klickende Taste: Left (Standard), Right, Middle (oder einfach nur die ersten Buchstaben); oder die 4. oder 5. Maustaste (X1 oder X2), die ab Windows 2000/XP unterst&uuml;tzt werden. Zum Beispiel: <em>MouseClick, X1</em>. Dieser Parameter kann weggelassen werden, damit standardm&auml;&szlig;ig Left verwendet wird.</p>
      <p><u>Mausrad drehen</u>: Windows NT/2000/XP oder h&ouml;her: Um das Mausrad nach oben zu drehen (vom Benutzer weg), verwendet man WheelUp oder WU; Um das Mausrad nach unten zu drehen (auf dem Benutzer zu), verwendet man WheelDown oder WD. Seit v1.0.48 k&ouml;nnen auch WheelLeft (WL) oder WheelRight (WR) verwendet werden (funktioniert nicht bei Betriebssystemen, die &auml;lter als Windows Vista sind). Mit der <em>Klickanzahl</em> kann die Anzahl der Rasterungen zum Drehen des Rades bestimmt werden.</p>
      <p>Wenn der Benutzer die linken und rechten Maustasten mittels der Systemsteuerung vertauscht hat, dann kann das automatisch mit dem <a href="Click.htm">Click-Befehl</a> ausgeglichen werden.</p></td>
  </tr>
  <tr>
    <td>X, Y </td>
    <td>Die X/Y-Koordinaten der neuen Mausposition, bevor ein Klicken erfolgt (k&ouml;nnen <a href="../Variables.htm#Expressions">Ausdr&uuml;cke</a> sein). Koordinaten beziehen sich auf das aktive Fenster, es sei denn, <a href="CoordMode.htm">CoordMode</a> wurde dazu verwendet, dass zu &auml;ndern. Wenn nicht vorhanden, dann wird die aktuelle Position des Zeigers verwendet.</td>
  </tr>
  <tr>
    <td>Klickanzahl</td>
    <td>Die Anzahl der Mausklicks, das auch ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein kann.&nbsp; Wenn nicht vorhanden, dann erfolgt nur ein Mausklick. </td>
  </tr>
  <tr>
    <td width="15%">Geschwindigkeit</td>
    <td width="85%"><p>Die Bewegungsgeschwindigkeit der Maus von 0 (am schnellsten) bis 100 (am langsamsten), das auch ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein kann.&nbsp; Hinweis: mit der Geschwindigkeit von 0 wird die Maus sofort bewegt.&nbsp; Wenn weggelassen, dann wird die Standard-Geschwindigkeit von <a href="SetDefaultMouseSpeed.htm">SetDefaultMouseSpeed</a> (wenn nicht vorhanden, dann die 2) verwendet.</p>
      <p><em>Geschwindigkeit</em> wird bei der <a href="SendMode.htm">SendInput- oder SendPlay-Methode</a> ignoriert: damit wird die Maus sofort bewegt (obwohl <a href="SetMouseDelay.htm">SetMouseDelay</a> einen Modus hat, der f&uuml;r SendPlay gilt). Um die Maus sichtbar langsamer zu bewegen (z. B. f&uuml;r ein Script, dass eine Demonstration f&uuml;r das Publikum vorf&uuml;hrt), verwendet <em><a href="Send.htm#Click">SendEvent {Click 100, 200}</a></em> oder <em><a href="SendMode.htm">SendMode Event</a></em> (optional in Verbindung mit <a href="BlockInput.htm">BlockInput</a>).</p></td>
  </tr>
  <tr>
    <td>D|U</td>
    <td><p>Wenn dieser Parameter weggelassen wird, dann besteht jeder Klick aus einem "down"-Ereignis, gefolgt von einem "up"-Ereignis. Alternativ:<br> D = Maustaste wird gedr&uuml;ckt, aber nicht losgelassen (das hei&szlig;t, es wird ein Down-Ereignis erzeugt). <br> U = Maustaste wird losgelassen (das hei&szlig;t, es wird ein Up-Ereignis erzeugt).</p>      </td>
  </tr>
  <tr>
    <td>R</td>
    <td>Wenn dieser Parameter den Buchstabe R enth&auml;lt, dann werden Koordinaten X und Y als Offsets von der aktuellen Mausposition behandelt. In anderen Worten wird der Zeiger von seiner aktuellen Position um X Pixel nach rechts (nach links ist negativ) und um Y Pixel nach unten (nach oben ist negativ) verschoben.</td>
  </tr>
</table>

<h3>Bemerkungen</h3>
<p>Dieser Befehl verwendet die vordefinierte Methode von <a href="SendMode.htm">SendMode</a>.</p>
<p>Der <a href="Click.htm">Click-Befehl</a> wird gegen&uuml;ber MouseClick bevorzugt, weil:</p>
<ol>
  <li>Es automatisch ausgleicht, wenn die linken und rechten Maustasten in der Systemsteuerung vertauscht wurden.</li>
  <li>Es in der Regel einfacher zu bedienen ist.</li>
</ol>
<p>Um Umschalt+Klick oder Steuerung+Klick auszuf&uuml;hren, verwendet den Befehl <a href="Send.htm">Send</a> vor und nach der Operation, wie in den folgenden Beispielen:</p>
<pre><em>; Beispiel #1: </em>
Send, {Control down}
MouseClick, left, 55, 233
Send, {Control up}</pre>
<pre>
<em>; Beispiel #2:</em>
Send, {Shift down}
MouseClick, left, 55, 233
Send, {Shift up}</pre>
<p>Mit dem <a href="SendMode.htm">SendPlay-Modus</a> ist man in der Lage, Mausaktionen erfolgreich in einer breiteren Auswahl an Spielen durchzuf&uuml;hren. Dar&uuml;ber hinaus k&ouml;nnen einige Anwendungen und Spiele Probleme haben, die Maus richtig zu erkennen, wenn sie zu schnell bewegt wird. Der <em>Geschwindigkeit</em>-Parameter oder <a href="SetDefaultMouseSpeed.htm">SetDefaultMouseSpeed</a> kann verwendet werden, um die Geschwindigkeit zu reduzieren (nur im <a href="SendMode.htm">Standard-SendEvent-Modus</a>).</p>
<p>Allerdings wird eine <em>Klickanzahl</em> h&ouml;her als 1 bei einigen Anwendungen nicht unterst&uuml;tzt. Daf&uuml;r kann eine <a href="Loop.htm">Schleife</a> wie folgt verwendet werden:</p>
<pre>Loop, 5
    MouseClick, WheelUp</pre>
<p>Mit dem <a href="BlockInput.htm">BlockInput</a>-Befehl ist es m&ouml;glich, Unterbrechungen von simulierten Mausaktionen durch physische Mausaktionen des Benutzers zu verhindern. Allerdings ist dieser Befehl im <a href="SendMode.htm">SendInput</a>- oder SendPlay-Modus nicht notwendig, weil die physischen Mausaktionen des Benutzers automatisch bis zum Schluss zwischengespeichert werden.</p>
<p>Nach dem Dr&uuml;cken und Loslassen der Maus wird automatisch eine Verz&ouml;gerung erzeugt (au&szlig;er im <a href="SendMode.htm">SendInput-Modus</a> und w&auml;hrend einer Drehung des Mausrads). Die Dauer der Verz&ouml;gerung kann mit <a href="SetMouseDelay.htm">SetMouseDelay</a> ge&auml;ndert werden.</p>
<h3>Verwandte Befehle</h3>
<p><a href="CoordMode.htm">CoordMode</a>, <a href="SendMode.htm">SendMode</a>, <a href="SetDefaultMouseSpeed.htm">SetDefaultMouseSpeed</a>,<a href="SetMouseDelay.htm"> SetMouseDelay</a>, <a href="Click.htm">Click</a>, <a href="MouseClickDrag.htm">MouseClickDrag</a>, <a href="MouseGetPos.htm">MouseGetPos</a>, <a href="MouseMove.htm">MouseMove</a>, <a href="ControlClick.htm">ControlClick</a>, <a href="BlockInput.htm">BlockInput</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent"><em>; F&uuml;hrt ein Doppelklick an der aktuellen Mausposition aus:</em>
MouseClick, left
MouseClick, left

<em>; Das Gleiche wie oben:</em>
MouseClick, left, , , 2

<em>; Auf die angegebenen Koordinaten bewegen und einmal rechtsklicken:</em>
MouseClick, right, 200, 300

<em>; Hier sind zwei Hotkeys, die das Drehen des Mausrads simulieren:</em>
#up::MouseClick, WheelUp, , , 2  <em>; 2 Rasterungen drehen.</em>
#down::MouseClick, WheelDown, , , 2</pre>
</div>
</div>
</body>
</html>