<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>MsgBox</title>
<meta name="description" content="Zeigt in dieser freien Scriptsprache m&uuml;helos ein Meldungsfenster an. Mit dieser Sprache k&ouml;nnen auch Eingabeformulare, Benutzerschnittstellen und Men&uuml;leisten erstellt werden.">
<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../../NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(2);</script>


<h1>MsgBox</h1>

<p>Zeigt den angegebenen Text in einem kleinen Fenster mit beliebig vielen Schaltfl&auml;chen (z. B. Ja und Nein).</p>

<pre class="Syntax">MsgBox, Text
MsgBox [, Optionen, Titel, Text, Zeit&uuml;berschreitung]</pre>
<h3>Parameter</h3>
<table class="info">
  <tbody>
<tr>
    <td>Text</td>
    <td>
<p>Wenn alle Parameter weggelassen werden, dann wird in der MsgBox "Press OK to continue." angezeigt. Andernfalls wird in diesem Parameter der Text des Hinweisfensters angegeben, um den Benutzer zu unterweisen oder Informationen zu pr&auml;sentieren.</p>
    <p><a href="_EscapeChar.htm">Schutzsequenzen</a> k&ouml;nnen verwendet werden, um besondere Zeichen zu kennzeichnen. Mit `n beispielsweise wird ein LF-Zeichen gekennzeichnet, welches die aktuelle Zeile beendet und eine neue beginnt. Daher wird zum Beispiel mit text1`n`ntext2 eine leere Zeile zwischen Text1 und Text2 erstellt.</p>
    <p>Wenn <em>Text</em> lang ist, dann kann er in mehreren kurzen Zeilen aufgeteilt werden (<a href="../Scripts.htm#continuation">Fortsetzungsbereich</a>), die die Lesbarkeit und Wartbarkeit verbessern k&ouml;nnten.</p></td>
  </tr>
  <tr>
    <td>Optionen</td>
    <td>
<p>Bestimmt den Typ des Hinweisfensters und die m&ouml;glichen Schaltfl&auml;chenkombinationen.&nbsp; Ist dieser Parameter leer oder nicht vorhanden, standardm&auml;&szlig;ig eine 0. Siehe nachstehende Tabelle f&uuml;r die zul&auml;ssigen Werte.</p>
    <p>Dieser Parameter wird nicht anerkannt, wenn ein Ausdruck oder ein Variablenverweis wie %option% enthalten ist. Verwendet stattdessen einen direkt vorhandenen numerischen Wert.</p></td>
  </tr>
  <tr>
    <td>Titel</td>
    <td>Der Titel des Hinweisfensters. Ist dieser Parameter leer oder nicht vorhanden, wird standardm&auml;&szlig;ig der aktuelle Name des Scripts verwendet (ohne Pfad). </td>
  </tr>
  <tr>
    <td width="15%">Zeit&uuml;berschreitung</td>
    <td width="85%">
<p><a name="Timeout"></a>(Optional) Zeit&uuml;berschreitung in Sekunden (kann einen Dezimalpunkt, aber keinen Ausdruck enthalten).&nbsp; Wenn dieser Wert 2147483 (24.8 Tage) &uuml;bersteigt, dann wird dieser auf 2147483 gesetzt.&nbsp; Nachdem die Zeit verstrichen ist, wird das Hinweisfenster automatisch geschlossen und der <a href="IfMsgBox.htm">IfMsgBox</a>-Befehl sieht den Wert TIMEOUT.</p>
      <p>Bekannte Einschr&auml;nkung: Wenn die MsgBox nur eine OK-Schaltfl&auml;che enth&auml;lt, dann denkt <a href="IfMsgBox.htm">IfMsgBox</a>, dass die OK-Schaltfl&auml;che gedr&uuml;ckt wurde, nachdem die Zeit verstrichen ist, w&auml;hrend der eigene <a href="../misc/Threads.htm">Thread</a> von einem anderen unterbrochen wurden ist.</p></td>
  </tr>
</tbody></table>

<p>Der <em>Optionen</em>-Parameter kann eine Kombination (Summe) von einem oder mehreren folgenden Werten sein.</p>
<table class="info" style="width: 55%;">
  <tbody>
<tr>
    <th width="287">Funktion</th>
    <th>Dezimal-Wert</th>
    <th>Hex-Wert</th>
  </tr>
  <tr>
    <td>OK (das hei&szlig;t, es wird nur eine OK-Schaltfl&auml;che angezeigt)</td>
    <td align="center">0</td>
    <td align="center">0x0</td>
  </tr>
  <tr>
    <td>OK/Abbrechen</td>
    <td align="center">1</td>
    <td align="center">0x1</td>
  </tr>
  <tr>
    <td>Abbrechen /Wiederholen/Ignorieren</td>
    <td align="center">2</td>
    <td align="center">0x2</td>
  </tr>
  <tr>
    <td>Ja/Nein/Abbrechen</td>
    <td align="center">3</td>
    <td align="center">0x3</td>
  </tr>
  <tr>
    <td>Ja/Nein</td>
    <td align="center">4</td>
    <td align="center">0x4</td>
  </tr>
  <tr>
    <td>Wiederholen/Abbrechen</td>
    <td align="center">5</td>
    <td align="center">0x5</td>
  </tr>
  <tr>
    <td>Abbrechen/Wiederholen/Weiter (2000/XP+)</td>
    <td align="center">6</td>
    <td align="center">0x6</td>
  </tr>
  <tr>
    <td>F&uuml;gt eine Hilfe-Schaltfl&auml;che hinzu (siehe Bemerkungen unten)</td>
    <td align="center">16384</td>
    <td align="center">0x4000</td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td align="center">&nbsp;</td>
    <td align="center">&nbsp;</td>
  </tr>
  <tr>
    <td>Icon Hand (Stopp/Fehler)</td>
    <td align="center">16</td>
    <td align="center">0x10</td>
  </tr>
  <tr>
    <td>Icon Frage </td>
    <td align="center">32</td>
    <td align="center">0x20</td>
  </tr>
  <tr>
    <td>Icon Ausrufezeichen</td>
    <td align="center">48</td>
    <td align="center">0x30</td>
  </tr>
  <tr>
    <td>Icon Sternchen (Info)</td>
    <td align="center">64</td>
    <td align="center">0x40</td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td align="center">&nbsp;</td>
    <td align="center">&nbsp;</td>
  </tr>
  <tr>
    <td>Die 2. Schaltfl&auml;che wird zur Standard-Schaltfl&auml;che </td>
    <td align="center">256</td>
    <td align="center">0x100</td>
  </tr>
  <tr>
    <td>Die 3. Schaltfl&auml;che wird zur Standard-Schaltfl&auml;che </td>
    <td align="center">512</td>
    <td align="center">0x200</td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td align="center">&nbsp;</td>
    <td align="center">&nbsp;</td>
  </tr>
  <tr>
    <td>System Modal (immer im Vordergrund)</td>
    <td align="center">4096</td>
    <td align="center">0x1000</td>
  </tr>
  <tr>
    <td>Task Modal</td>
    <td align="center">8192</td>
    <td align="center">0x2000</td>
  </tr>
  <tr>
    <td>Immer im Vordergrund (WS_EX_TOPMOST-Style) <br> (Wie System Modal, aber ohne Icon in der Titelleiste)</td>
    <td align="center">262144</td>
    <td align="center">0x40000</td>
  </tr>
  <tr>
    <td>&nbsp;</td>
    <td align="center">&nbsp;</td>
    <td align="center">&nbsp;</td>
  </tr>
  <tr>
    <td>Macht den Text rechtsb&uuml;ndig</td>
    <td align="center">524288</td>
    <td align="center">0x80000</td>
  </tr>
  <tr>
    <td>Leserichtung von links nach rechts (f&uuml;r Hebr&auml;isch/Arabisch)</td>
    <td align="center">1048576</td>
    <td align="center">0x100000</td>
  </tr>
</tbody></table>
<h3>Bemerkungen</h3>
<p>Die obige Tabelle wird verwendet, um die Werte f&uuml;r die gew&uuml;nschte Ansicht der MsgBox zu addieren. Um zum Beispiel ein Ja/Nein-Hinweisfenster mit Nein anstelle von Ja als Standard-Schaltfl&auml;che anzugeben, verwendet 256+4 (260) in den <em>Optionen</em>. In Hexadezimal w&auml;re es 0x100 +0x4 (0x104).</p>
<p>MsgBox hat eine intelligente Komma-Handhabung, daher m&uuml;ssen Kommas im <em>Text</em>-Parameter nicht <a href="_EscapeChar.htm">gesch&uuml;tzt</a> werden.</p>
<p>Um festzustellen, welche Schaltfl&auml;che der Benutzer in der aktuellsten MsgBox gedr&uuml;ckt hat, verwendet den Befehl <a href="IfMsgBox.htm">IfMsgBox</a>. Zum Beispiel:</p>
<pre>MsgBox, 4,, M&ouml;chten Sie fortfahren? (Ja oder Nein dr&uuml;cken)
IfMsgBox Yes
    MsgBox Sie haben Ja gedr&uuml;ckt.
Else
    MsgBox Sie haben Nein gedr&uuml;ckt.</pre>
<p>Die Namen der Schaltfl&auml;chen k&ouml;nnen mit diesem <a href="../scripts/MsgBoxButtonNames.htm">Beispiel</a> benutzerdefiniert werden.</p>
<p><strong>Tipp</strong>: Wenn Steuerung+C gedr&uuml;ckt wird, w&auml;hrend das Hinweisfenster aktiv ist, dann wird der Text in die Zwischenablage kopiert. Das gilt f&uuml;r alle Hinweisfenster, nicht nur die von AutoHotkey.</p>
<p><strong>MsgBox mit einem GUI-Fenster verwenden</strong>: Ein GUI-Fenster kann eine <em>modale</em> MsgBox mittels <a href="Gui.htm#OwnDialogs">Gui, +OwnDialogs</a> anzeigen. Ein <em>modales</em> Dialog-Fenster hindert den Benutzer solange daran, mit dem GUI-Fenster zu interagieren, bis das modale Dialog-Fenster wieder geschlossen wird. In einem solchen Fall ist es nicht notwendig, System Modal oder Task Modal in den Optionen anzugeben.</p>
<p>Wenn <a href="Gui.htm#OwnDialogs">Gui +OwnDialogs</a> <em>nicht</em> aktiv ist, dann kann die Option Task Modal (8192) verwendet werden, um alle Fenster im Script zu deaktivieren, bis der Benutzer die MsgBox schlie&szlig;t.</p>
<p><strong>Die Schaltfl&auml;che Hilfe</strong>: Wenn die Option f&uuml;r die Hilfe-Schaltfl&auml;che (83) in den <em>Optionen</em> vorhanden ist, dann funktioniert das Dr&uuml;cken dieser Schaltfl&auml;che nur, wenn die beiden folgenden Bedingungen erf&uuml;llt sind:</p>
<ol>
  <li>Die MsgBox wird einem GUI-Fenster mittels <a href="Gui.htm#OwnDialogs">Gui +OwnDialogs</a> untergeordnet.</li>
  <li>Das Script &uuml;berwacht die WM_HELP-Nachricht (0x53). Zum Beispiel: <a href="OnMessage.htm">OnMessage(0x53, "WM_HELP")</a>. Wenn die Funktion WM_HELP() aufgerufen wird, dann wird der Benutzer z. B. durch das Anzeigen eines anderen Fensters oder einer MsgBox geleitet.</li>
</ol>
<p><strong>Die Schaltfl&auml;che Schlie&szlig;en (in der Titelleiste der MsgBox)</strong>: Da die MsgBox eine integrierte Funktion des Betriebssystems ist, wird die <strong>X-Schaltfl&auml;che</strong> nur aktiviert, wenn bestimmte Schaltfl&auml;chen vorhanden sind. Falls nur eine OK-Schaltfl&auml;che vorhanden ist, dann ist das Klicken der <strong>X-Schaltfl&auml;che</strong> das gleiche wie das Dr&uuml;cken von OK. Ansonsten wird die X-Schaltfl&auml;che nur aktiviert, wenn eine Abbrechen-Schaltfl&auml;che vorhanden ist, in diesem Fall entspricht das Klicken der <strong>X-Schaltfl&auml;che</strong> das Dr&uuml;cken von Abbrechen.</p>
<h3>Verwandte Befehle</h3>
<p><a href="IfMsgBox.htm">IfMsgBox</a>, <a href="InputBox.htm">InputBox</a>, <a href="FileSelectFile.htm">FileSelectFile</a>, <a href="FileSelectFolder.htm">FileSelectFolder</a>, <a href="ToolTip.htm">ToolTip</a>, <a href="Gui.htm">GUI</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">MsgBox Das ist die 1-Parameter-Methode. Kommas (,) m&uuml;ssen nicht gesch&uuml;tzt werden.
MsgBox, 4, , Das ist die 3-Parameter-Methode. Kommas (,) m&uuml;ssen nicht gesch&uuml;tzt werden.
MsgBox, 4,, M&ouml;chten Sie fortfahren? (Ja oder Nein dr&uuml;cken)
IfMsgBox No
    Return
MsgBox, 4, , 4-Parameter-Methode: Diese MsgBox schlie&szlig;t sich automatisch in 5 Sekunden. Weiter?, 5
IfMsgBox Timeout
    MsgBox Sie haben nicht innerhalb von 5 Sekunden auf Ja oder Nein gedr&uuml;ckt.
Else IfMsgBox No
    Return

<em>; Durch Voranstellen von "% " wird jeder Parameter zu einem Ausdruck. Im folgenden Beispiel wird eine Berechnung durchgef&uuml;hrt, auf ein Array-Element zugegriffen und eine Funktion aufgerufen. Alle Elemente
; sind durch den Punkt-Operator verkettet, um einen String in der MsgBox darzustellen:</em>
MsgBox % "Die neue Breite des Objekts #" . A_Index . " ist: " . RestrictWidth(ObjectWidth%A_Index% * ScalingFactor)

<em>; Das folgende Beispiel warnt den Benutzer, dass eine MsgBox den Fokus gleich wegnimmt (falls der Benutzer schreibt).</em>
SplashTextOn,,, Eine MsgBox erscheint gleich.
Sleep 3000
SplashTextOff
MsgBox Der Sicherungsprozess wurde abgeschlossen.</pre>
</body></html>