<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Pause</title>
<meta name="keywords" content="Befehl, Ablaufsteuerung, Debugging">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>Pause</h1>

<p>Pausiert einen <a href="../misc/Threads.htm">aktuellen Thread</a> des Scripts.</p>

<pre class="Syntax">#p::Pause <em>; Win+P einmal dr&uuml;cken, um Script zu pausieren. Nochmal dr&uuml;cken, um die Pause aufzuheben.</em>
Pause [, On|Off|Toggle, DarunterLiegendenThreadEinbeziehen?]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">On|Off|Toggle</td>
    <td width="85%"><p>Ist dieser Parameter leer oder nicht vorhanden, wird standardm&auml;&szlig;ig Toggle verwendet. Ansonsten ein folgendes Wort angeben:</p>
      <p>Toggle: Pausiert den <a href="../misc/Threads.htm">aktuellen Thread</a>, es sei denn, der Thread darunter ist pausiert, in diesem Fall wird die Pause vom darunter liegenden Thread aufgehoben.</p>
      <p>On: Pausiert den aktuellen Thread.</p>
      <p>Off: Wenn der Thread unter dem aktuellen Thread pausiert ist, dann wird dessen Pause aufgehoben, wenn er wieder aufgenommen wird. Ansonsten hat der Befehl keine Wirkung.<br>
</p></td>
  </tr>
  <tr>
    <td>DarunterLiegendenThreadEinbeziehen?</td>
    <td><p>Dieser Parameter wird bei "Pause Off" ignoriert, weil dabei immer der darunter liegende Thread bearbeitet wird. Bei den anderen wird er ignoriert, es sei denn, Pause ist aktiviert (auch &uuml;ber Toggle).</p>
      <p>Verwendet eine folgende Zahl:</p>
      <p><strong>0</strong> (oder weggelassen): Der Befehl pausiert den aktuellen Thread; das hei&szlig;t, dass dieser Thread jetzt den Pause-Befehl ausf&uuml;hrt.</p>
    <p><strong>1</strong>: Der Befehl setzt den Thread unter dem aktuellen Thread auf pausiert, damit der ausgef&uuml;hrte Befehl beendet wird (falls vorhanden), wenn er wieder aufgenommen wird. Gebt danach einen pausierten Zustand an. Wenn kein Thread unter dem aktuellen Thread ist, dann wird das Script selbst pausiert, wodurch <a href="SetTimer.htm">Timer</a> gestoppt werden (entspricht das Ausw&auml;hlen vom Men&uuml;punkt "Pause Script", w&auml;hrend das Script keine Threads hat).</p>
    <p>Hinweis: <a href="../Variables.htm#IsPaused">A_IsPaused</a> enth&auml;lt den Zustand von Pause des darunter liegenden Threads.</p></td>
  </tr>
</table>

<h3>Bemerkungen</h3>
<p>Im Gegensatz zum Befehl <a href="Suspend.htm">Suspend</a> (der <a href="../Hotkeys.htm">Hotkeys</a> und <a href="../Hotstrings.htm">Hotstrings</a> deaktiviert) wird der <a href="../misc/Threads.htm">aktuelle Thread</a> blockiert, wenn Pause aktiviert ist. Als Nebeneffekt ist jeder darunter liegende unterbrochene Thread unt&auml;tig.</p>
<p>Sobald ein Thread pausiert wird, werden <a href="SetTimer.htm">Timer</a> nicht ausgef&uuml;hrt. Direkt gestartete Threads wie <a href="../Hotkeys.htm">Hotkeys</a> und <a href="Menu.htm">Men&uuml;punkte</a> k&ouml;nnen weiterhin ausgef&uuml;hrt werden; sobald jedoch deren <a href="../misc/Threads.htm">Threads</a> enden, bleibt der darunter liegende Thread weiterhin pausiert. Das hei&szlig;t, dass jeder Thread unabh&auml;ngig von den anderen pausiert werden kann.</p>
<p>Die Farbe des Tray-Icons wechselt von Gr&uuml;n auf Rot, sobald der <a href="../misc/Threads.htm">aktuelle Thread</a> des Scripts pausiert wird. Diese Farbver&auml;nderung kann durch Blockieren des Icons verhindert werden, wenn eine 1 im letzten Parameter des Menu-Befehls verwendet wird. Zum Beispiel:<br> <a href="Menu.htm">Menu</a>, Tray, Icon, C:\Eigenes Icon.ico, , 1</p>
<p>Um <a href="SetTimer.htm">Timer</a> ohne Pause zu deaktivieren, verwendet "<a href="Thread.htm">Thread, NoTimers</a>".</p>
<p>Der Pause-Befehl ist mit dem Men&uuml;punkt "Pause Script" vergleichbar.</p>
<p>Ein Script wird immer angehalten (wenn auch nicht offiziell pausiert), wenn ein <a href="Menu.htm">Men&uuml;</a> angezeigt wird (Tray-Men&uuml;, Men&uuml;leiste, GUI-Kontextmen&uuml;, usw.)</p>
<h3>Verwandte Befehle</h3>
<p><a href="Suspend.htm">Suspend</a>, <a href="Menu.htm">Menu</a>, <a href="ExitApp.htm">ExitApp</a>, <a href="../misc/Threads.htm">Threads</a>, <a href="SetTimer.htm">SetTimer</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent">Pause::Pause  <em>; Die Pause-Funktion wird der Pause-Taste zugewiesen ...</em>
#p::Pause  <em>; ... oder der Tastenkombination Win+p zugewiesen.</em></pre>

</body>
</html>