<!DOCTYPE HTML>
<html>
<head>
<title>PixelGetColor</title>
<meta name="keywords" content="Befehl, Bildschirm">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
      <h1>PixelGetColor</h1>
      <p>Ermittelt die Farbe des Pixels bei den angegebenen Koordinaten.</p>
      <pre class="Syntax">PixelGetColor, AusgabeVar, X, Y [, Alt|Slow|RGB] </pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td style="width: 15%;">AusgabeVar</td>
          <td style="width: 85%;">Name der Variable, in der die Farbkennung im hexadezimalen BGR-Format (Blau-Gr&uuml;n-Rot) gespeichert werden soll. Zum Beispiel ist die Farbe Lila als 0x800080 definiert, weil sie eine Blau- und Rot-Intensit&auml;t von 80 und eine Gr&uuml;n-Intensit&auml;t von 00 hat. </td>
        </tr>
        <tr>
          <td>X, Y</td>
          <td>Die Koordinaten X und Y des Pixels, die <a href="../Variables.htm#Expressions">Ausdr&uuml;cke</a> sein k&ouml;nnen. Die Koordinaten beziehen sich auf das aktive Fenster, sofern <a href="CoordMode.htm">CoordMode</a> nicht dazu verwendet wurde, das zu &auml;ndern.</td>
        </tr>
        <tr>
          <td>Alt|Slow|RGB</td>
          <td><p>Dieser Parameter kann beliebig viele der folgenden W&ouml;rter enthalten. Mehrere W&ouml;rter m&uuml;ssen mit Leerzeichen voneinander getrennt werden (z. B. <code>Alt RGB</code>).</p>
            <p><strong>Alt</strong> <span class="ver">[v1.0.43.10+]:</span> Eine alternative Methode zum Abrufen der Farbe, die benutzt werden sollte, wenn die normale Methode ung&uuml;ltige oder falsche Farben bei bestimmten Fenstern erzeugt. Diese Methode ist etwa 10% langsamer als die normale Methode.</p>
            <p><strong>Slow</strong> <span class="ver">[v1.0.43.10+]:</span> Eine aufwendigere Methode zum Abrufen der Farbe, die bei bestimmten Vollbild-Anwendungen funktionieren kann, wenn die anderen Methoden fehlschlagen. Diese Methode ist etwa dreimal langsamer als die normale Methode. Hinweis: <em>Slow</em> hat Vorrang vor <em>Alt</em>, daher muss <em>Alt</em> in diesem Fall nicht angegeben werden.</p>
            <p><strong>RGB</strong>: Ermittelt die Farbe im RGB-Format, anstatt im BGR-Format. Das hei&szlig;t, dass die roten und blauen Komponenten vertauscht sind. Das hilft dabei, Farben zu ermitteln, die mit <a href="WinSet.htm">WinSet</a>, <a href="Gui.htm">Gui</a>, <a href="Progress.htm">Progress</a> und <a href="Progress.htm">SplashImage</a> kompatibel sind.</p></td>
        </tr>
      </table>
      <h3>ErrorLevel</h3>
      <p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
      <p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird bei Misserfolg auf 1 und bei Erfolg auf 0 gesetzt.</p>
      <h3>Bemerkungen</h3>
      <p>Der Pixel muss sichtbar sein; das hei&szlig;t, dass es nicht m&ouml;glich ist, die Pixelfarbe eines Fensters zu ermitteln, das sich hinter einem anderen Fenster befindet. Pixel, die sich unter dem Mauszeiger befinden, werden in der Regel erkannt. Die Ausnahme machen Mauszeiger bei Spielen, weil diese die Sicht auf darunterliegende Pixel behindern.</p>
      <p>Mit "Window Spy" (im Tray-Icon-Men&uuml; verf&uuml;gbar) oder dem Beispiel weiter unten k&ouml;nnen die aktuellen Farben auf dem Bildschirm ermittelt werden.</p>
      <p>Bekannte Einschr&auml;nkungen:</p>
      <ul>
        <li>Ein Fenster, das <a href="WinSet.htm#trans">teilweise transparent</a> ist oder unsichtbare Farben enth&auml;lt (<a href="WinSet.htm#TransColor">TransColor</a>), ermittelt typischerweise Farben vom Fenster, die sich dahinter befinden.</li>
        <li>PixelGetColor erzeugt ungenaue Ergebnisse bei bestimmten Anwendungen. Sollte das der Fall sein, kann das Wort <em>Alt</em> oder <em>Slow</em> im letzten Parameter ausprobiert werden.</li>
      </ul>
      <h3>Verwandte Befehle</h3>
      <p><a href="PixelSearch.htm">PixelSearch</a>, <a href="ImageSearch.htm">ImageSearch</a>, <a href="CoordMode.htm">CoordMode</a>, <a href="MouseGetPos.htm">MouseGetPos</a></p>
      <h3>Beispiel</h3>
      <pre class="NoIndent">^!z::  <em>; Hotkey STRG+ALT+Z.</em>
MouseGetPos, MausX, MausY
PixelGetColor, Farbe, %MausX%, %MausY%
MsgBox Auf der aktuellen Mausposition befindet sich die Farbe %Farbe%.
Return</pre>
    </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>