<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>PixelGetColor</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>

<h1>PixelGetColor</h1>

<p>Ermittelt die Farbe des Pixels an den angegebenen Koordinaten.</p>

<pre class="Syntax">PixelGetColor, Ausgabevariable, X, Y [, Alt|Slow|RGB] </pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">Ausgabevariable</td>
    <td width="85%">Der Name der Variable, in der die Farbkennung im hexadezimalen BGR-Format (Blau-Gr&uuml;n-Rot) gespeichert wird. Die Farbe Lila ist zum Beispiel 0x800080, weil sie eine Blau- und Rot-Intensit&auml;t von 80 und eine Gr&uuml;n-Intensit&auml;t von 00 hat. </td>
  </tr>
  <tr>
    <td>X, Y</td>
    <td>Die X- und Y-Koordinaten des Pixels, die <a href="../Variables.htm#Expressions">Ausdr&uuml;cke</a> sein k&ouml;nnen. Koordinaten beziehen sich auf das aktive Fenster, es sei denn, <a href="CoordMode.htm">CoordMode</a> wurde dazu verwendet, dass zu &auml;ndern.</td>
  </tr>
  <tr>
    <td>Alt|Slow|RGB</td>
    <td><p>Dieser Parameter kann beliebig viele folgende W&ouml;rter enthalten. Wenn mehrere W&ouml;rter vorhanden sind, dann trennt sie mit Leerzeichen (z. B. <em>Alt RGB</em>).</p>
      <p><strong>Alt</strong> <span class="ver">[v1.0.43.10+]:</span> Verwendet wird eine alternative Methode zum Abrufen der Farbe, die verwendet wird, wenn die normale Methode ung&uuml;ltige oder falsche Farben von einer bestimmten Fensterart erzeugt. Diese Methode ist etwa 10% langsamer als die normale Methode.</p>
      <p><strong>Slow</strong> <span class="ver">[v1.0.43.10+]:</span> Verwendet eine aufwendigere Methode zum Abrufen der Farbe, die in bestimmten Vollbild-Anwendungen funktionieren kann, wenn die anderen Methoden versagen. Diese Methode ist etwa dreimal langsamer als die normale Methode. Hinweis: <em>Slow</em> hat Vorrang vor <em>Alt</em>, daher muss <em>Alt</em> in diesem Fall nicht angegeben werden.</p>
      <p><strong>RGB</strong>: Ermittelt die Farbe im RGB- anstelle vom BGR-Format. Mit anderen Worten sind die roten und blauen Komponenten vertauscht. Das ist f&uuml;r das Abrufen von Farben n&uuml;tzlich, die mit <a href="WinSet.htm">WinSet</a>, <a href="Gui.htm">Gui</a>, <a href="Progress.htm">Progress</a> und <a href="Progress.htm">SplashImage</a> kompatibel sind.</p></td>
  </tr>
</table>

<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p>Bei Problemen wird <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt, ansonsten enth&auml;lt ErrorLevel eine 0.</p>
<h3>Bemerkungen</h3>
<p>Der Pixel muss sichtbar sein; das hei&szlig;t, dass es nicht m&ouml;glich ist, die Pixelfarbe eines versteckten Fensters hinter einem anderen Fenster zu ermitteln. Im Gegensatz dazu werden Pixel, die sich unter dem Mauszeiger befinden, normalerweise erkannt. Die Ausnahme machen Zeiger in Spiele, die in den meisten F&auml;llen bestimmte Pixel darunter bedecken.</p>
<p>Verwendet "Window Spy" (erh&auml;ltlich im Tray-Icon-Men&uuml;) oder das Beispiel am Ende dieser Seite, um die aktuellen Farben auf dem Bildschirm ermitteln.</p>
<p>Bekannte Einschr&auml;nkungen:</p>
<ul>
  <li>Ein Fenster, das <a href="WinSet.htm#trans">teilweise transparent</a> ist oder unsichtbare Farben enth&auml;lt (<a href="WinSet.htm#TransColor">TransColor</a>), ermittelt typischerweise Farben vom Fenster, die sich dahinter befinden.</li>
  <li>PixelGetColor erzeugt ungenaue Ergebnisse bei bestimmten Anwendungen. Wenn dies geschieht, versucht es mit dem Wort <em>Alt</em> oder <em>Slow</em> im letzten Parameter.</li>
</ul>
<h3>Verwandte Befehle</h3>
<p><a href="PixelSearch.htm">PixelSearch</a>, <a href="ImageSearch.htm">ImageSearch</a>, <a href="CoordMode.htm">CoordMode</a>, <a href="MouseGetPos.htm">MouseGetPos</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">^!z::  <em>; Hotkey Steuerung+Alt+Z.</em>
MouseGetPos, MouseX, MouseY
PixelGetColor, Farbe, %MouseX%, %MouseY%
MsgBox Die Farbe auf der aktuellen Position ist %Farbe%.
Return</pre>

</body>
</html>