<!DOCTYPE HTML>
<html>
<head>
<title>Progress/SplashImage</title>
<meta name="keywords" content="Befehl, Grafische Benutzeroberfl&auml;che">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<style type="text/css">
.square {
  width: 24px;
  height: 22px;
  border: 1px solid #000000;
}
</style>
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
      <h1>Progress / SplashImage</h1>
      <p>Erstellt oder aktualisiert ein Fenster, das ein Fortschrittsbalken oder Bild enth&auml;lt.</p>
      <pre class="Syntax">SplashImage, Off
SplashImage [, Bilddatei, Optionen, Nebentext, Haupttext, Fenstertitel, Schriftart]

Progress, Off
Progress, ProgressParam1 [, Nebentext, Haupttext, Fenstertitel, Schriftart]</pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td>Bilddatei</td>
          <td><p>Ist das Wort OFF enthalten, wird das Fenster zerst&ouml;rt. Wenn das Wort SHOW enthalten ist, wird das Fenster wieder sichtbar gemacht.</p>
            <p>Ansonsten kann der Dateiname eines BMP-, GIF- oder JPG-Bildes zum Anzeigen angegeben werden (um andere Dateiformate wie PNG, TIF und ICO anzuzeigen, ist es besser, den <a href="Gui.htm">Gui</a>-Befehl zu verwenden, um ein Fenster mit einem Picture-Steuerelement zu erstellen).</p>
            <p><span class="ver">[AHK_L 59+]:</span> Jedes Bildformat, das von Gui unterst&uuml;tzt wird, kann mit SplashImage verwendet werden.</p>
            <p><em>Bilddatei</em> befindet sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis, solange kein absoluter Pfad angegeben ist. Falls die Parameter <em>Bilddatei</em> und <em>Optionen</em> leer sind und das Fenster bereits vorhanden ist, bleibt das Bild unver&auml;ndert. Der Text jedoch wird aktualisiert, um neue Strings vom <em>Nebentext</em>, <em>Haupttext</em> und <em>Fenstertitel</em> anzuzeigen.</p>
            <p>Ein neu erstelltes Fenster wird ohne Bild angezeigt, wenn <em>Bilddatei</em> leer ist oder das Laden des Bildes fehlschl&auml;gt.</p></td>
        </tr>
        <tr>
          <td style="width: 15%;">ProgressParam1<br></td>
          <td style="width: 85%;"><p><u>Bei einem bereits vorhandenen Progress-Fenster</u>: Falls das Wort OFF in <em>Param1</em> enthalten ist, wird das Fenster zerst&ouml;rt. Ist das Wort SHOW in <em>Param1</em> enthalten, wird das Fenster wieder sichtbar gemacht.</p>
            <p>Wenn <em>Param1</em> ansonsten eine reine Zahl ist, wird die Balkenposition auf diesen Wert gesetzt. Falls <em>Param1</em> leer ist, bleibt die Balkenposition unver&auml;ndert. Der Text jedoch wird aktualisiert, um neue Strings vom <em>Nebentext</em>, <em>Haupttext</em> und <em>Fenstertitel</em> anzuzeigen. Wenn das Fenster bei beiden Methoden noch nicht vorhanden ist, wird es mit den Standardwerten von allen Optionen erstellt.</p>
            <p><u>Bei einem noch nicht vorhandenen Progress-Fenster</u>: Ein neues Progress-Fenster wird erstellt (ersetzt das alte Fenster). Bezugnehmend darauf kann in <em>Param1</em> ein String mit beliebig vielen Optionen von der unteren Liste angegeben werden.</p></td>
        </tr>
        <tr>
          <td>Optionen</td>
          <td>Ein String mit beliebig vielen Optionen aus der unteren Liste.</td>
        </tr>
        <tr>
          <td>Nebentext</td>
          <td>Ein Text, der sich unter dem Bild oder Fortschrittsbalken befindet. Standardm&auml;&szlig;ig werden zu lange Zeilen umbrochen. Mit einem Zeilenumbruchszeichen (`n) kann der Zeilenumbruch erzwungen werden. Um den Text eines vorhandenen Fensters leer zumachen, sollte <a href="../Variables.htm#Space">%A_Space%</a> verwendet werden. F&uuml;r die automatischen Berechnung der Fensterh&ouml;he k&ouml;nnen leere Zeilen wie in <em>Haupttext</em> f&uuml;r sp&auml;ter bereitgestellt werden.</td>
        </tr>
        <tr>
          <td>Haupttext</td>
          <td><p>Ein Text, der sich &uuml;ber dem Bild oder Fortschrittsbalken befindet (die Schrift wird halbfett dargestellt). Standardm&auml;&szlig;ig werden zu lange Zeilen umbrochen. Mit einem Zeilenumbruchszeichen (`n) kann der Zeilenumbruch erzwungen werden.</p>
            <p>Ist dieser Parameter leer oder nicht vorhanden, wird f&uuml;r <em>Haupttext</em> kein Platz im Fenster bereitgestellt. Um Platz f&uuml;r eine einzelne Zeile bereitzustellen, die sp&auml;ter hinzugef&uuml;gt wird, oder einen vorhandenen Text im Fenster leer zumachen, sollte <a href="../Variables.htm#Space">%A_Space%</a> verwendet werden. Mit einem Zeilenumbruchszeichen (`n) k&ouml;nnen noch mehr Zeilen bereitgestellt werden.</p>
            <p>Sobald die H&ouml;he von <em>Haupttext</em> gesetzt wird, kann sie nicht mehr nachtr&auml;glich ge&auml;ndert werden.</p></td>
        </tr>
        <tr>
          <td>Fenstertitel</td>
          <td>Der Titel des Fensters. Wenn dieser Parameter weggelassen und das Fenster neu erstellt wird, ist der Titel standardm&auml;&szlig;ig der Name des Scripts (ohne Pfad). Falls die <strong>B</strong>-Option (randlos) angegeben wurde, wird die Titelleiste nicht angezeigt. Allerdings ist dieser Titel f&uuml;r Befehle wie <a href="WinMove.htm">WinMove</a> weiterhin zug&auml;nglich.</td>
        </tr>
        <tr>
          <td>Schriftart</td>
          <td><p>Die Schriftart f&uuml;r <em>Haupttext</em> und <em>Nebentext</em>. Die <a href="../misc/FontsStandard.htm">Schriftart-Tabelle</a> listet alle Schriftarten auf, die standardm&auml;&szlig;ig im Betriebssystem vorhanden sind. Wenn dieser Parameter leergelassen oder die Schriftart nicht gefunden wird, gilt standardm&auml;&szlig;ig die Standard-Schriftart des Betriebssystems.</p>
            <p>In den nachfolgenden Abschnitten wird erkl&auml;rt, wie die Gr&ouml;&szlig;e, Breite und Farbe der Schrift ge&auml;ndert werden kann.</p></td>
        </tr>
      </table>
      <h2>Fenstergr&ouml;&szlig;e, -position und -verhalten</h2>
      <p><strong>A</strong>: Das Fenster wird <u>nicht</u> immer im Vordergrund sein.</p>
      <p><strong>B</strong>: Randlos: Das Fenster wird weder Rahmen noch Titelleiste haben. Das Fenster wird einen Rahmen und keine Titelleiste haben, wenn <strong>B1</strong> f&uuml;r einen d&uuml;nnen Rahmen oder <strong>B2</strong> f&uuml;r einen Dialogfensterrahmen verwendet wird.</p>
      <p><strong>M</strong>: Das Fenster kann vom Benutzer verschoben werden (sofern es nicht randlos ist). Mit <strong>M1</strong> kann das Fenster zus&auml;tzlich skalierbar gemacht werden (durch Ziehen der Rahmen). Mit <strong>M2</strong> kann zus&auml;tzlich das Systemmen&uuml; und die Schaltfl&auml;chen Minimieren/Maximieren/Schlie&szlig;en in die Titelleiste eingef&uuml;gt werden.</p>
      <p><strong>Pn</strong>: Ersetzt <strong>n</strong> mit der neuen Startposition des Fortschrittbalkens (standardm&auml;&szlig;ig 0 oder der niedrigste Wert vom zul&auml;ssigen Bereich). Die Position des Balkens kann sp&auml;ter wie folgt ge&auml;ndert werden: <code>Progress, 50</code>.</p>
      <p><strong>Rx-y</strong>: Ersetzt <strong>x-y</strong> mit dem neuen numerischen Bereich des Fortschrittbalkens (ist die <strong>R</strong>-Option nicht vorhanden, gilt standardm&auml;&szlig;ig 0-100). Zum Beispiel w&uuml;rde R0-1000 Zahlen zwischen 0 und 1000 erlauben, R-50-50 w&uuml;rde Zahlen zwischen -50 und 50 erlauben und R-10--5 w&uuml;rde Zahlen zwischen -10 und -5 erlauben. In Windows 95 und NT4 werden sich negative Bereiche und Bereiche &uuml;ber 65535 erst richtig verhalten, wenn Internet Explorer 3.0 oder h&ouml;her installiert ist.</p>
      <p><strong>T</strong>: Das Fenster wird eine Schaltfl&auml;che in der Taskleiste haben und ist nicht l&auml;nger untergeordnet. Normalerweise ist die Schaltfl&auml;che nicht vorhanden, weil das Fenster dem Script-Hauptfenster geh&ouml;rt. Diese Option verhindert auch, dass ein Splash- oder Progress-Fenster mit der Einstellung <a href="Gui.htm#OwnDialogs">Gui +OwnDialogs</a> von einem GUI-Fenster &uuml;bernommen wird.</p>
      <p><strong>Hn</strong>: Ersetzt <strong>n</strong> mit der neuen H&ouml;he des Clientbereichs (das ist im Fenster der Bereich ohne Titelleiste und Rahmen). Ist diese Option nicht vorhanden, wird die H&ouml;he <u>automatisch</u> berechnet, basierend auf die H&ouml;he des Bildes/Balkens und Text im Fenster.</p>
      <p><strong>Wn</strong>: Ersetzt <strong>n</strong> mit der neuen Breite des Clientbereichs. Ist diese Option nicht vorhanden, wird die Breite von SplashImage <u>automatisch</u> berechnet (wenn ein Bild vorhanden ist). Ansonsten gilt standardm&auml;&szlig;ig 300.</p>
      <p><strong>Xn</strong>: Ersetzt <strong>n</strong> mit der neuen X-Koordinate von der oberen linken Fensterecke. Ist diese Option nicht vorhanden, wird das Fenster auf dem Bildschirm horizontal zentriert.</p>
      <p><strong>Yn</strong>: Ersetzt <strong>n</strong> mit der neuen Y-Koordinate von der oberen linken Fensterecke. Ist diese Option nicht vorhanden, wird das Fenster auf dem Bildschirm vertikal zentriert.</p>
      <p><strong>Hide</strong>: Das Fenster wird zu Beginn versteckt sein. Mit <em>Progress Show</em> oder <em>SplashImage Show</em> kann das Fenster sp&auml;ter wieder sichtbar gemacht werden.</p>
      <h2>Layout von Fensterobjekten</h2>
      <p><strong>Cxy</strong>: Zentriert: Sobald diese Option fehlt, wird sowohl <em>Nebentext</em> als auch <em>Haupttext</em> im Fenster zentriert. Ersetzt <strong>x</strong> mit einer 0, um <em>Nebentext</em> linksb&uuml;ndig auszurichten. Mit einer 1 bleibt dieser zentriert. Das gleiche gilt f&uuml;r <strong>y</strong>, aber bezugnehmend auf <em>Haupttext</em> (<strong>y</strong> kann weggelassen werden). Zum Beispiel: c10</p>
      <p><strong>ZHn</strong>: H&ouml;he des Objekts: Bei Progress-Fenster ist <strong>n</strong> die neuen Dicke des Fortschrittbalkens (standardm&auml;&szlig;ig 20). Bei SplashImage-Fenster ist <strong>n</strong> die neue H&ouml;he, auf die das Bild skaliert wird. Mit -1 wird die H&ouml;he proportional zur angegebenen Breite in ZWn gemacht (d. h. "Seitenverh&auml;ltnis beibehalten"). Ist diese Option nicht vorhanden, wird die tats&auml;chliche H&ouml;he des Bildes verwendet. In jedem Fall kann eine 0 angegeben werden, um das Objekt vollst&auml;ndig zu entfernen. Dadurch wird erm&ouml;glicht, dass das Fenster nur Text angezeigt - in benutzerdefinierter Schriftart, Gr&ouml;&szlig;e und Farbe.</p>
      <p><strong>ZWn</strong>: Breite des Objekts (gilt nur f&uuml;r SplashImage-Fenster): Ersetzt <strong>n</strong> mit der neuen Breite, auf die das Bild skaliert wird. Mit -1 wird die Breite proportional zur angegebenen H&ouml;he in ZHn gemacht (d. h. "Seitenverh&auml;ltnis beibehalten"). Ist diese Option nicht vorhanden, wird die tats&auml;chliche Breite des Bildes verwendet.</p>
      <p><strong>ZXn</strong>: Ersetzt <strong>n</strong> mit der Abstandsmenge, die auf der linken und rechten Fensterseite freigehalten wird. Standardm&auml;&szlig;ig 10, au&szlig;er bei SplashImage-Fenster ohne Text, da gilt standardm&auml;&szlig;ig 0.</p>
      <p><strong>ZYn</strong>: Ersetzt <strong>n</strong> mit der Abstandsmenge, die bei der oberen und unteren Fensterseite sowie zwischen jedem Steuerelement freigelassen wird. Standardm&auml;&szlig;ig 5, au&szlig;er bei SplashImage-Fenster ohne Text, da gilt standardm&auml;&szlig;ig 0.</p>
      <p>Hinweis: Der <a href="Gui.htm">Gui</a>-Befehl bietet mehr M&ouml;glichkeiten beim Erstellen eines Fensters, darunter auch ein vertikaler Fortschrittsbalken:</p>
      <pre>Gui, Add, Progress, Vertical vEigenesProgress
Gui, Show
Return
<em>; ... sp&auml;ter ...</em>
GuiControl,, EigenesProgress, +10  <em>; Schiebt den Balken 10 Prozent nach oben. Durch Weglassen des Pluszeichens kann eine absolute Position gesetzt werden.</em></pre>
      <h2>Schriftgr&ouml;&szlig;e und -breite</h2>
      <p><strong>FMn</strong>: Ersetzt <strong>n</strong> mit der neuen Schriftgr&ouml;&szlig;e f&uuml;r <em>Haupttext</em>. Standardm&auml;&szlig;ig eine 0, die bewirkt, dass 10 bei den meisten Betriebssystemen verwendet wird. Dieser Standardwert wird nicht von der ausgew&auml;hlten System-Schriftgr&ouml;&szlig;e in "Systemsteuerung &gt; Anzeige" beeinflusst.</p>
      <p><strong>FSn</strong>: Ersetzt <strong>n</strong> mit der neuen Schriftgr&ouml;&szlig;e f&uuml;r <em>Nebentext</em>. Standardm&auml;&szlig;ig eine 0, die bewirkt, dass 8 bei den meisten Betriebssystemen verwendet wird.</p>
      <p><strong>WMn</strong>: Ersetzt <strong>n</strong> mit der neuen Schriftbreite f&uuml;r <em>Haupttext</em>. Die Breite sollte zwischen 1 und 1000 liegen. Ist diese Option nicht vorhanden, wird 600 (halbfett) verwendet.</p>
      <p><strong>WSn</strong>: Ersetzt <strong>n</strong> mit der neuen Schriftbreite f&uuml;r <em>Nebentext</em>. Die Breite sollte zwischen 1 und 1000 liegen (traditionell wird 700 als "fett" angesehen). Ist diese Option nicht vorhanden, wird 400 (normal) verwendet.</p>
      <h2>Objektfarben</h2>
      <p>Die Farbe kann ein Name aus der unteren Liste <u>oder</u> ein 6-stelliger hexadezimaler RGB-Wert sein. Zum Beispiel w&uuml;rde die Angabe von cw1A00FF bewirken, dass eine Fensterhintergrundfarbe mit Rot-Komponente 1A, Gr&uuml;n-Komponente 00 und Blau-Komponente FF gesetzt wird.</p>
      <p>Bei mehreren Optionen sollte nach jeder Farboption ein Leerzeichen erfolgen. Zum Beispiel: cbRed ct900000 cwBlue</p>
      <p><strong>CBn</strong>: Farbe des Fortschrittsbalkens: Ersetzt <strong>n</strong> mit einer HTML-Prim&auml;rfarbe oder einem 6-stelligen RGB-Farbwert. Ist diese Option nicht vorhanden, wird die Standard-Balkenfarbe des Systems verwendet. Mit dem Wort Default kann die Standard-Balkenfarbe des Systems erzwungen werden.</p>
      <p><strong>CTn</strong>: Farbe des Textes: Ersetzt <strong>n</strong> mit einer HTML-Prim&auml;rfarbe oder einem 6-stelligen RGB-Farbwert. Ist diese Option nicht vorhanden, wird die Standard-Textfarbe des Systems verwendet (normalerweise schwarz). Mit dem Wort Default kann die Standard-Balkenfarbe des Systems erzwungen werden.</p>
      <p><strong>CWn</strong>: Farbe des Fensters (Hintergrund): Ersetzt <strong>n</strong> mit einer HTML-Prim&auml;rfarbe oder einem 6-stelligen RGB-Farbwert. Ist diese Option nicht vorhanden, wird die Systemfarbe der Schaltfl&auml;chen verwendet (mit dem Wort Default kann diese Farbe erzwungen werden). Mit <a href="WinSet.htm#TransColor">WinSet TransColor</a> kann der Hintergrund in Windows 2000/XP oder h&ouml;her transparent gemacht werden.</p>
      <table style="margin: auto; width: 80%; border: 0; border-spacing: 10px;">
        <caption id="colors">
        <b>Farbnamen und RGB-Werte</b>
        </caption>
        <tr>
          <td class="square" style="background-color: #000000">&nbsp;</td>
          <td>Black = 000000 (Schwarz)
          <td class="square" style="background-color: #008000">&nbsp;</td>
          <td>Green = 008000 (Gr&uuml;n)
        </tr>
        <tr>
          <td class="square" style="background-color: #C0C0C0">&nbsp;</td>
          <td>Silver = C0C0C0 (Silber)
          <td class="square" style="background-color: #00FF00">&nbsp;</td>
          <td>Lime = 00FF00 (Gelbgr&uuml;n)
        </tr>
        <tr>
          <td class="square" style="background-color: #808080">&nbsp;</td>
          <td>Gray = 808080 (Grau)
          <td class="square" style="background-color: #808000">&nbsp;</td>
          <td>Olive = 808000 (Oliv)
        </tr>
        <tr>
          <td class="square" style="background-color: #FFFFFF">&nbsp;</td>
          <td>White = FFFFFF (Wei&szlig;)
          <td class="square" style="background-color: #FFFF00">&nbsp;</td>
          <td>Yellow = FFFF00 (Gelb)
        </tr>
        <tr>
          <td class="square" style="background-color: #800000">&nbsp;</td>
          <td>Maroon = 800000 (Dunkelrot)
          <td class="square" style="background-color: #000080">&nbsp;</td>
          <td>Navy = 000080 (Dunkelblau)
        </tr>
        <tr>
          <td class="square" style="background-color: #FF0000">&nbsp;</td>
          <td>Red = FF0000 (Rot)
          <td class="square" style="background-color: #0000FF">&nbsp;</td>
          <td>Blue = 0000FF (Blau)
        </tr>
        <tr>
          <td class="square" style="background-color: #800080">&nbsp;</td>
          <td>Purple = 800080 (Lila)
          <td class="square" style="background-color: #008080">&nbsp;</td>
          <td>Teal = 008080 (Blaugr&uuml;n)
        </tr>
        <tr>
          <td class="square" style="background-color: #FF00FF">&nbsp;</td>
          <td>Fuchsia = FF00FF (Pink)
          <td class="square" style="background-color: #00FFFF">&nbsp;</td>
          <td>Aqua = 00FFFF (Hellblau)
        </tr>
      </table>
      <h2>Bemerkungen</h2>
      <p>Wenn das Wort <strong>OFF</strong> im ersten Parameter enthalten ist, wird das Fenster zerst&ouml;rt.</p>
      <p>Jedes Script kann bis zu 10 Progress-Fenster und 10 SplashImage-Fenster anzeigen. Jedem Fenster wird eine Nummer zugewiesen, w&auml;hrend es erstellt wird. Standardm&auml;&szlig;ig ist diese Nummer eine 1 (das erste Fenster). Ansonsten kann vor dem ersten Parameter die Fensternummer mit einem Doppelpunkt angegeben werden. Zum Beispiel w&uuml;rde der Progress-Befehl mit 2:Off das zweite Progress-Fenster deaktivieren, mit 2:75 den Balken auf 75% setzen, mit 2: ein oder mehrere Textfelder &auml;ndern und mit 2:B ein neues randloses Progress-Fenster erstellen. Ebenso w&uuml;rde der SplashImage-Befehl mit 2:Off das zweite SplashImage-Fenster deaktivieren, mit 2: ein oder mehrere Textfelder &auml;ndern und mit 2:C:\Eigene Bilder\Bild1.jpg ein neues zweites SplashImage-Fenster erstellen.</p>
      <p>Wenn das erstellte Fenster gr&ouml;&szlig;er als der Desktop ist, wird es automatisch auf die passende Gr&ouml;&szlig;e verkleinert.</p>
      <p>Damit ein leerer Fortschrittsbalken angezeigt wird, muss <em>Nebentext</em> und <em>Haupttext</em> weggelassen und folgende Optionen eingef&uuml;gt werden: b zx0 zy0. F&uuml;r ein leeres Bild gilt das selbe, jedoch ist nur die B-Option notwendig.</p>
      <p>Wenn in Windows XP oder h&ouml;her ein nicht-klassisches Design aktiv ist, befinden sich im Inneren des Fortschrittsbalkens m&ouml;glicherweise mehrere Segmente, anstatt einen durchgehenden Balken. Um das zu verhindern, muss eine Balkenfarbe direkt angegeben werden, wie z. B. cbBlue.</p>
      <p>Verwendet dezimale (nicht hexadezimale) Zahlen bei den Optionsbuchstaben, sofern nicht anders angegeben.</p>
      <p>Befehle wie <a href="WinSet.htm">WinSet</a> und <a href="WinMove.htm">WinMove</a> k&ouml;nnen verwendet werden, um die Eigenschaften eines vorhandenen Fensters zu &auml;ndern, ohne es neu erstellen zu m&uuml;ssen.</p>
      <p>Ein GUI-Fenster kann ein Progress- oder SplashImage-Fenster mithilfe von <a href="Gui.htm#OwnDialogs">Gui +OwnDialogs</a> in Besitz nehmen. Dadurch befindet sich das SplashImage- oder Progress-Fenster immer vor das &uuml;bergeordnete Fenster. Dar&uuml;ber hinaus wird das Progress- oder SplashImage-Fenster automatisch zerst&ouml;rt, sobald das dazugeh&ouml;rige GUI-Fenster zerst&ouml;rt wird.</p>
      <h2>Verwandte Befehle</h2>
      <p><a href="Gui.htm">GUI</a>, <a href="SplashTextOn.htm">SplashTextOn</a>, <a href="ToolTip.htm">ToolTip</a></p>
      <h2>Beispiele</h2>
      <pre class="NoIndent">Progress, b w200, Eigener Untertext, Eigener Haupttext, Eigener Titel
Progress, 50 <em>; Setzt die Balkenposition auf 50%.</em>
Sleep, 4000
Progress, Off

<em>; Erstellt ein Fenster, nur um Text in Schriftgr&ouml;&szlig;e 18 und in der Schriftart Courier New anzuzeigen:</em>
Progress, m2 b fs18 zh0, Ein beliebiger Text.`nDie 2. Zeile., , , Courier New

<em>; Erstellt ein einfaches SplashImage-Fenster:</em>
SplashImage, C:\Eigene Bilder\Company Logo.gif

<em>; Erstellt ein randloses SplashImage-Fenster mit gro&szlig;em Text unter dem Bild:</em>
SplashImage, C:\Eigene Bilder\Company Logo.gif, b fs18, Das ist unser Firmenlogo.
Sleep, 4000
SplashImage, Off

<em>; Dieses Beispiel zeigt, wie ein Progress-Fenster ein SplashImage-Fenster &uuml;berdecken kann,
; um einen professionell aussehenden Installer zu erstellen:</em>
IfExist, C:\WINDOWS\system32\ntimage.gif, SplashImage, %A_WinDir%\system32\ntimage.gif, A,,, Installation
Loop, %A_WinDir%\system32\*.*
{
    Progress, %a_index%, %A_LoopFileName%, Installiere ..., Installationsvorgang
    Sleep, 50
    If a_index = 100
        break
}
<em>; Auf der <a href="Gui.htm#Examples">GUI-Seite</a> ganz unten befindet sich ein &auml;hnliches Beispiel. Der Vorteil von diesem ist,
; dass nur ein Fenster verwendet wird und der Benutzer mehr Einfluss auf die Gestaltung des Fensters hat.</em></pre>
    </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>