<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>Progress/SplashImage</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>

<h1>Progress / SplashImage</h1>

<p>Erstellt oder aktualisiert ein Fenster mit einem Fortschrittsbalken oder Bild.</p>

<pre class="Syntax">SplashImage, Off
SplashImage [, Bilddatei, Optionen, Nebentext, Haupttext, Fenstertitel, Schriftart]

Progress, Off
Progress, ProgressParam1 [, Nebentext, Haupttext, Fenstertitel, Schriftart]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td>Bilddatei</td>
    <td><p>Wenn das Wort OFF enthalten ist, dann wird das Fenster zerst&ouml;rt. Wenn das Wort SHOW enthalten ist, dann wird das Fenster angezeigt, wenn es zurzeit versteckt ist.</p>
      <p>Ansonsten ist der Dateinamen eines BMP, GIF oder JPG-Bildes enthalten, dass angezeigt wird (um andere Dateiformate wie PNG, TIF und ICO anzuzeigen, erstellt ein benutzerdefiniertes <a href="Gui.htm">Gui</a>-Fenster mit einem Picture-Steuerelement).</p>
      <p><span class="ver">[AHK_L 59+]:</span> Jedes Bildformat, das von Gui unterst&uuml;tzt wird, kann mit SplashImage verwendet werden.</p>
      <p>Die <em>Bilddatei</em> befindet sich im <a href="../Variables.htm#WorkingDir">A_WorkingDir</a>-Verzeichnis, solange kein absoluter Pfad angegeben ist. Wenn die <em>Bilddatei</em> und <em>Optionen</em> leer sind und das Fenster bereits vorhanden ist, dann bleibt das Bild unver&auml;ndert, aber der Text wird aktualisiert, um neue Strings vom <em>Nebentext</em>, <em>Haupttext</em> und <em>Fenstertitel</em> wiederzugeben.</p>
      <p>Wenn bei neu erstellten Fenstern die <em>Bilddatei</em> leer ist oder ein Problem beim Laden des Bildes auftritt, dann wird das Fenster ohne Bild angezeigt.</p></td>
  </tr>
  <tr>
    <td width="15%">ProgressParam1<br>      </td>
    <td width="85%"><p><u>Wenn das Progress-Fenster bereits existiert</u>: Wenn das Wort OFF in <em>Param1</em> enthalten ist, dann wird das Fenster zerst&ouml;rt. Wenn das Wort SHOW in <em>Param1</em> enthalten ist, dann wird das Fenster angezeigt, wenn es zurzeit versteckt ist.</p>
      <p>Wenn <em>Param1</em> jedoch eine reine Zahl ist, dann wird die Balkenposition mit diesem Wert ge&auml;ndert. Wenn <em>Param1</em> leer ist, dann bleibt die Balkenposition unver&auml;ndert, aber der Text wird aktualisiert, um neue Strings vom <em>Nebentext</em>, <em>Haupttext</em> und <em>Fenstertitel</em> wiederzugeben. Bei beiden Methoden wird das Fenster mit Standardwerten erstellt, wenn das Fenster noch nicht vorhanden ist.</p>
      <p><u>Wenn das Progress-Fenster nicht existiert</u>: Ein neues Progress-Fenster wird erstellt (ersetzt das alte Fenster) und <em>Param1</em> enth&auml;lt einen String mit beliebig vielen Optionen von der unteren Liste.</p>    </td>
  </tr>
  <tr>
    <td>Optionen</td>
    <td>Ein String mit beliebig vielen Optionen aus der Liste weiter unten.</td>
  </tr>
  <tr>
    <td>Nebentext</td>
    <td>Der Text, der unter dem Bild oder Fortschrittsbalken angezeigt wird. Obwohl Zeilenumbruch auftreten wird, k&ouml;nnen neue Zeilen direkt angegeben werden, indem LF-Zeichen (`n) verwendet werden. Um den Text eines vorhandenen Fensters leer zumachen, verwendet <a href="../Variables.htm#Space">%A_Space%</a>. Zum Zwecke der automatischen Berechnung der Fensterh&ouml;he k&ouml;nnen leere Zeilen wie beim <em>Haupttext</em> reserviert werden.</td>
  </tr>
  <tr>
    <td>Haupttext</td>
    <td><p>Der Text, der &uuml;ber dem Bild oder Fortschrittsbalken angezeigt wird (die Schrift ist halbfett). Obwohl Zeilenumbruch auftreten wird, k&ouml;nnen neue Zeilen direkt angegeben werden, indem LF-Zeichen (`n) verwendet werden.</p>
      <p>Wenn leer oder nicht vorhanden, dann wird kein Platz f&uuml;r den <em>Haupttext</em> im Fenster reserviert. Um Platz f&uuml;r eine einzelne Zeile zu reservieren, die sp&auml;ter hinzugef&uuml;gt wird, oder einen vorhandenen Text eines Fensters leer zumachen, verwendet  <a href="../Variables.htm#Space">%A_Space%</a>. Um zus&auml;tzliche Zeilen &uuml;ber der ersten Zeile zu reservieren, f&uuml;gt ein oder mehrere LF-Zeichen (`n) an.</p>
      <p>Nachdem die H&ouml;he des Steuerelementsbereichs vom <em>Haupttext</em> gesetzt wurde, kann sie nicht mehr ge&auml;ndert werden, solange das Fenster nicht neu erstellt wird. </p></td>
  </tr>
  <tr>
    <td>Fenstertitel</td>
    <td>Der Titel des Fensters. Wenn dieser Parameter weggelassen oder das Fenster neu erstellt wird, dann enth&auml;lt der Titel standardm&auml;&szlig;ig den Namen des Scripts (ohne Pfad). Wenn die <strong>B</strong>-Option (randlos) angegeben wurde, dann wird die Titelleiste nicht angezeigt, aber der Fenstertitel kann immer noch von bestimmten Befehlen wie <a href="WinMove.htm">WinMove</a> verwendet werden.</td>
  </tr>
  <tr>
    <td>Schriftart</td>
    <td><p>Die Schriftart f&uuml;r den <em>Haupttext</em> und <em>Nebentext</em>.  Siehe <a href="../misc/FontsStandard.htm">Tabelle f&uuml;r Schriftarten</a>, die verschiedene Schriftarten auflistet, abh&auml;ngig von den Windows-Versionen. Wenn die Schriftart nicht angegeben oder gefunden wird, dann wird die Standard-Schriftart des Betriebssystems verwendet.</p>
      <p>Siehe unteren Abschnitt f&uuml;r Optionen, wie die Gr&ouml;&szlig;e, Breite und Farbe der Schrift ge&auml;ndert wird.</p></td>
  </tr>
</table>

<h2>Gr&ouml;&szlig;e, Position und Verhalten des Fensters</h2>
<p><strong>A</strong>: Das Fenster ist <u>nicht</u> immer im Vordergrund.</p>
<p><strong>B</strong>: Randlos: Das Fenster hat keinen Rahmen und Titelleiste. Damit ein Rahmen, aber keine Titelleiste, vorhanden ist, verwendet <strong>B1</strong> f&uuml;r einen d&uuml;nnen Rahmen oder <strong>B2</strong> f&uuml;r einen Rahmen im Dialogfenster-Style.</p>
<p><strong>M</strong>: Das Fenster kann vom Benutzer bewegt werden (nur wenn es nicht randlos ist). Damit zus&auml;tzlich die Fenstergr&ouml;&szlig;e ge&auml;ndert werden kann (durch Ziehen der Rahmen), verwendet <strong>M1</strong>. Damit zus&auml;tzlich das System-Men&uuml; und die Schaltfl&auml;chen Minimieren/Maximieren/Schlie&szlig;en verf&uuml;gbar sind, verwendet <strong>M2</strong>.</p>
<p><strong>Pn</strong>: Gebt f&uuml;r <strong>n</strong> die Startposition des Balkens im Progress-Fenster an (standardm&auml;&szlig;ig ist es eine 0 oder die Zahl im zul&auml;ssigen Bereich, die am n&auml;chsten an der Null ist). Um die Balkenposition sp&auml;ter zu &auml;ndern, befolgt dieses Beispiel: Progress, 50</p>
<p>  <strong>Rx-y</strong>: Gebt f&uuml;r <strong>x-y</strong> den numerischen Bereich des Balkens im Progress-Fenster an (wenn die <strong>R</strong>-Option nicht vorhanden ist, dann standardm&auml;&szlig;ig 0-100). Zum Beispiel erm&ouml;glicht R0-1000 eine Zahl zwischen 0 und 1000, R-50-50 eine Zahl zwischen -50 und 50 und R-10--5 eine Zahl zwischen -10 und -5. In Windows 95 und NT4 verhalten sich negative Bereiche und Bereiche &uuml;ber 65535 erst korrekt, wenn Internet Explorer 3.0 oder h&ouml;her installiert ist.</p>
<p><strong>T</strong>: Das Fenster erh&auml;lt eine Schaltfl&auml;che in der Taskleiste und ist nicht mehr untergeordnet. Normalerweise ist keine Schaltfl&auml;che vorhanden, weil das Fenster dem Script-Hauptfenster untergeordnet ist. Diese Einstellung verhindert auch, dass <a href="Gui.htm#OwnDialogs">Gui +OwnDialogs</a> eines GUI-Fensters von einem Splash- oder Progress-Fenster &uuml;bernommen wird.</p>
<p><strong>Hn</strong>: Gebt f&uuml;r <strong>n</strong> die H&ouml;he des Client-Bereichs im Fenster an (das ist der Bereich ohne Titelleiste und Rahmen). Wenn nicht angegeben, dann wird die H&ouml;he <u>automatisch</u> auf Basis der Bild-, Balken und Texth&ouml;he berechnet.</p>
<p><strong>Wn</strong>: Gebt f&uuml;r <strong>n</strong> die Breite des Client-Bereichs im Fenster an. Wenn nicht angegeben, dann wird die Breite des Splash-Bildes <u>automatisch</u> berechnet (wenn ein Bild vorhanden ist). Ansonsten standardm&auml;&szlig;ig 300.</p>
<p><strong>Xn</strong>: Gebt f&uuml;r <strong>n</strong> die X-Koordinate der oberen linken Ecke des Fensters an. Wenn nicht angegeben, dann wird das Fenster horizontal auf dem Bildschirm zentriert. </p>
<p><strong>Yn</strong>: Gebt f&uuml;r <strong>n</strong> die Y-Koordinate der oberen linken Ecke des Fensters an. Wenn nicht angegeben, dann wird das Fenster vertikal auf dem Bildschirm zentriert.</p>
<p><strong>Hide</strong>: Das Fenster wird zun&auml;chst versteckt. Verwendet <em>Progress Show</em> oder <em>SplashImage Show</em>, um das Fenster sp&auml;ter anzuzeigen.</p>
<h2>Layout der Objekte im Fenster</h2>
<p><strong>Cxy</strong>: Zentriert: Sobald diese Option fehlt, wird der <em>Nebentext</em> und <em>Haupttext</em> im Fenster zentriert. Verwendet f&uuml;r <strong>x</strong> eine 0, um den <em>Nebentext</em> linksb&uuml;ndig auszurichten. Mit einer 1 wird der Text zentriert gehalten. Das Geiche gilt f&uuml;r <strong>y</strong>, aber f&uuml;r den <em>Haupttext</em> (<strong>y</strong> kann weggelassen werden). Zum Beispiel: c10</p>
<p><strong>ZHn</strong>: H&ouml;he des Objekts: Gebt f&uuml;r <strong>n</strong> die Dicke des Balkens im Progress-Fenster an (standardm&auml;&szlig;ig 20). Gebt f&uuml;r <strong>n</strong> die H&ouml;he des Splash-Bildes an, damit es skaliert werden kann. Verwendet -1, um die H&ouml;he proportional zur Breite (in ZWn angegeben) zu machen (d. h. "Seitenverh&auml;ltnis beibehalten"). Wenn nicht angegeben, dann wird die tats&auml;chliche H&ouml;he des Bildes verwendet. In jedem Fall kann ein Wert von 0 angegeben werden, um das Objekt vollst&auml;ndig wegzulassen, wodurch das Fenster nur den Text mit benutzerdefinierter Schriftart, Gr&ouml;&szlig;e und Farbe anzeigt.</p>
<p><strong>ZWn</strong>: Breite des Objekts (nur f&uuml;r SplashImage-Fenster): Gebt f&uuml;r <strong>n</strong> die Breite an, um das Bild zu skalieren.  Verwendet -1, um die Breite proportional zur H&ouml;he (in ZHn angegeben) zu machen (d. h. "Seitenverh&auml;ltnis beibehalten"). Wenn nicht angegeben, dann wird die tats&auml;chliche Breite des Bildes verwendet.</p>
<p><strong>ZXn</strong>: Gebt f&uuml;r <strong>n</strong> die Abstandsmenge der linken und rechten Fensterseite an. Der Standardwert ist 10, au&szlig;er bei einem SplashImage-Fenster ohne Text, da wird ein Standardwert von 0 verwendet. </p>
<p><strong>ZYn</strong>: Gebt f&uuml;r <strong>n</strong> die Abstandsmenge der oberen und unteren Seite des Fensters und Steuerelements an. Der Standardwert ist 5, au&szlig;er bei einem SplashImage-Fenster ohne Text, da wird ein Standardwert von 0 verwendet. </p>
<p>Hinweis: F&uuml;r einen vertikalen Fortschrittsbalken oder mehr Layout-Flexibilit&auml;t kann der <a href="Gui.htm">Gui</a>-Befehl verwendet werden, wie zum Beispiel:</p>
<pre>Gui, Add, Progress, Vertical vEigenesProgress
Gui, Show
Return
<em>; ... sp&auml;ter ...</em>
GuiControl,, EigenesProgress, +10  <em>; Die Position wird um 10 erh&ouml;ht. Lasst + weg, um eine absolute Position zusetzen.</em></pre>
<h2>Gr&ouml;&szlig;e und Breite der Schrift</h2>
<p><strong>FMn</strong>: Gebt f&uuml;r <strong>n</strong> die Schriftgr&ouml;&szlig;e vom <em>Haupttext</em> an. Standardm&auml;&szlig;ig 0, dass die Gr&ouml;&szlig;e 10 in den meisten Systemen hervorruft. Dieser Standardwert wird nicht von der ausgew&auml;hlten System-Schriftgr&ouml;&szlig;e in "Systemsteuerung &gt; Anzeige" beeinflusst. </p>
<p><strong>FSn</strong>: Gebt f&uuml;r <strong>n</strong> die Schriftgr&ouml;&szlig;e vom <em>Nebentext</em> an. Standardm&auml;&szlig;ig 0, dass die Gr&ouml;&szlig;e 8 in den meisten Systemen hervorruft.</p>
<p><strong>WMn</strong>: Gebt f&uuml;r <strong>n</strong> die Schriftbreite vom <em>Haupttext</em> an. Die Breite sollte zwischen 1 und 1000 liegen. Wenn nicht angegeben, dann wird 600 (halbfett) verwendet.</p>
<p><strong>WSn</strong>: Gebt f&uuml;r <strong>n</strong> die Schriftbreite vom <em>Nebentext</em> an. Die Breite sollte zwischen 1 und 1000 liegen (traditionell ist 700 "fett"). Wenn nicht angegeben, dann wird 400 (normal) verwendet.</p>
<h2>Objektfarben</h2>
<p>Die Farbe kann ein Name aus der unteren Liste <u>oder</u> ein 6-stelliger hexadezimaler RGB-Wert sein. Mit cw1A00FF beispielsweise enth&auml;lt die Hintergrundfarbe des Fensters die Rot-Komponente 1A, Gr&uuml;n-Komponente 00 und Blau-Komponente FF.</p>
<p>F&uuml;gt nach jeder Farboption ein Leerzeichen hinzu, wenn noch mehr Optionen folgen. Zum Beispiel: cbRed ct900000 cwBlue</p>
<p><strong>CBn</strong>: Farbe des Fortschrittsbalkens: Ersetzt <strong>n</strong> mit einer HTML-Prim&auml;rfarbe oder einem 6-stelligen RGB-Farbwert. Wenn nicht angegeben, dann wird die Standard-Balkenfarbe des Systems verwendet. Verwendet das Wort Default, um die Standard-Balkenfarbe des Systems abzurufen.</p>
<p><strong>CTn</strong>: Farbe des Textes: Ersetzt <strong>n</strong> mit einer HTML-Prim&auml;rfarbe oder einem 6-stelligen RGB-Farbwert. Wenn nicht angegeben, dann wird die Standard-Textfarbe des Systems (normalerweise schwarz) verwendet. Verwendet das Wort Default, um die Standard-Textfarbe des Systems abzurufen. </p>
<p><strong>CWn</strong>: Farbe des Fensters (Hintergrund): Ersetzt <strong>n</strong> mit einer HTML-Prim&auml;rfarbe oder einem 6-stelligen RGB-Farbwert. Wenn nicht angegeben, dann wird die Systemfarbe der Schaltfl&auml;chen verwendet (mit dem Wort Default kann diese Farbe sp&auml;ter abgerufen werden). Um den Hintergrund in Windows 2000/XP oder h&ouml;her transparent zumachen, verwendet <a href="WinSet.htm#TransColor">WinSet TransColor</a>.</p>
<table align="center" width="80%" border="0" cellspacing="10" cellpadding="0">
  <caption>
  <b><a name="colors"></a>Farbnamen und RGB-Werte</b><br>
  </caption>
  <tr>
    <td width="16"><img src="../images/clr/black.gif">
    <td>Black = 000000 (Schwarz)
    <td width="16"><img src="../images/clr/green.gif">
    <td>Green = 008000 (Gr&uuml;n)<br>
  </tr>
  <tr>
    <td width="16"><img src="../images/clr/silver.gif">
    <td>Silver = C0C0C0 (Silber)
    <td width="16"><img src="../images/clr/lime.gif">
    <td>Lime = 00FF00 (Gelbgr&uuml;n)<br>
  </tr>
  <tr>
    <td width="16"><img src="../images/clr/gray.gif">
    <td>Gray = 808080 (Grau)
    <td width="16"><img src="../images/clr/olive.gif">
    <td>Olive = 808000 (Oliv)<br>
  </tr>
  <tr>
    <td width="16"><img src="../images/clr/white.gif">
    <td>White = FFFFFF (Wei&szlig;)
    <td width="16"><img src="../images/clr/yellow.gif">
    <td>Yellow = FFFF00 (Gelb)<br>
  </tr>
  <tr>
    <td width="16"><img src="../images/clr/maroon.gif">
    <td>Maroon = 800000 (Dunkelrot)
    <td width="16"><img src="../images/clr/navy.gif">
    <td>Navy = 000080 (Dunkelblau)<br>
  </tr>
  <tr>
    <td width="16"><img src="../images/clr/red.gif">
    <td>Red = FF0000 (Rot)
    <td width="16"><img src="../images/clr/blue.gif">
    <td>Blue = 0000FF (Blau)<br>
  </tr>
  <tr>
    <td width="16"><img src="../images/clr/purple.gif">
    <td>Purple = 800080 (Lila)
    <td width="16"><img src="../images/clr/teal.gif">
    <td>Teal = 008080 (Blaugr&uuml;n)<br>
  </tr>
  <tr>
    <td width="16"><img src="../images/clr/fuchsia.gif">
    <td>Fuchsia = FF00FF (Pink)
    <td width="16"><img src="../images/clr/aqua.gif">
    <td>Aqua = 00FFFF (Hellblau)<br>
  </tr>
</table>
<h2>Bemerkungen</h2>
<p>Wenn das Wort <strong>OFF</strong> im ersten Parameter enthalten ist, dann wird das Fenster zerst&ouml;rt.</p>
<p>Jedes Script kann bis zu 10 Progress-Fenster und 10 SplashImage-Fenster anzeigen. Jedes Fenster hat eine Nummer, die bei der Erstellung zugewiesen wird. Wenn nicht angegeben, dann standardm&auml;&szlig;ig die Nummer 1 (das erste Fenster). Ansonsten kann vor dem ersten Parameter die Fensternummer mit einem Doppelpunkt angegeben werden. Zum Beispiel deaktiviert der Progress-Befehl mit 2:Off das zweite Progress-Fenster, setzt mit 2:75 den Balken auf 75%, &auml;ndert mit 2: beliebig viele Textfelder und erstellt mit 2:B ein neues randloses Progress-Fenster. Ebenso deaktiviert der SplashImage-Befehl mit 2:Off das zweite SplashImage-Fenster, &auml;ndert mit 2: beliebig viele Textfelder und erstellt mit 2:C:\Eigene Bilder\Bild1.jpg ein neues zweites SplashImage-Fenster.</p>
<p>Wenn das Fenster bei der Erstellung gr&ouml;&szlig;er als der Desktop ist, dann wird es automatisch auf die passende Gr&ouml;&szlig;e geschrumpft.</p>
<p>Ein leerer Fortschrittsbalken kann angezeigt werden, indem der <em>Nebentext</em> und <em>Haupttext</em> weggelassen wird und folgende Optionen eingef&uuml;gt werden: b zx0 zy0. Ein leeres Bild kann auf die gleiche Weise angezeigt werden, es ist aber nur die B-Option notwendig. </p>

<p>Wenn in Windows XP oder h&ouml;her das nicht-klassische Design aktiv ist, dann enth&auml;lt der Fortschrittsbalken mehrere Segmente anstelle eines durchgehenden Balkens. Deshalb sollte eine Balkenfarbe wie cbBlue eindeutig angegeben werden.</p>
<p>Verwendet dezimale (nicht hexadezimale) Zahlen f&uuml;r die Optionen, sofern nicht anders angegeben. </p>
<p>Befehle wie <a href="WinSet.htm">WinSet</a> und <a href="WinMove.htm">WinMove</a> k&ouml;nnen verwendet werden, um die Eigenschaften eines vorhandenen Fensters zu &auml;ndern, ohne es neu zu erstellen.</p>
<p>Ein GUI-Fenster kann ein Progress- oder SplashImage-Fenster mithilfe von <a href="Gui.htm#OwnDialogs">Gui +OwnDialogs</a> &uuml;bernehmen. Dadurch befindet sich das SplashImage- oder Progress-Fenster immer vor das &uuml;bergeordnete Fenster. Zus&auml;tzlich wird das Progress- oder SplashImage-Fenster automatisch zerst&ouml;rt, wenn das dazugeh&ouml;rige GUI-Fenster zerst&ouml;rt wird.</p>
<h2>Verwandte Befehle</h2>
<p><a href="Gui.htm">GUI</a>, <a href="SplashTextOn.htm">SplashTextOn</a>, <a href="ToolTip.htm">ToolTip</a> </p>
<h2>Beispiele</h2>
<pre class="NoIndent">Progress, b w200, Eigener Untertext, Eigener Haupttext, Eigener Titel
Progress, 50 <em>; Setzt die Balkenposition auf 50%.</em>
Sleep, 4000
Progress, Off

<em>; Erstellt ein Fenster, nur um einige Texte mit der Gr&ouml;&szlig;e 18 und der Schriftart Courier New anzuzeigen:</em>
Progress, m2 b fs18 zh0, Ein beliebiger Text.`nDie 2. Zeile., , , Courier New

<em>; Erstellt ein einfaches SplashImage-Fenster:</em>
SplashImage, C:\Eigene Bilder\Company Logo.gif

<em>; Erstellt ein randloses SplashImage-Fenster mit gro&szlig;en Texten unter dem Bild:</em>
SplashImage, C:\Eigene Bilder\Company Logo.gif, b fs18, Das ist unser Firmenlogo.
Sleep, 4000
SplashImage, Off

<em>; Hier ist ein funktionierendes Beispiel, wie ein Progress-Fenster ein SplashImage-Fenster &uuml;berdeckt,
; um einen professionell aussehenden Installer zu erstellen:</em>
IfExist, C:\WINDOWS\system32\ntimage.gif, SplashImage, %A_WinDir%\system32\ntimage.gif, A,,, Installation
Loop, %A_WinDir%\system32\*.*
{
    Progress, %a_index%, %A_LoopFileName%, Installiere ..., Installation durchf&uuml;hren
    Sleep, 50
    If a_index = 100
        break
}
<em>; Am Ende der <a href="Gui.htm#Examples">GUI-Seite</a> ist ein vergleichbares Beispiel. Der Vorteil davon ist, dass nur ein Fenster verwendet wird und
; der Benutzer mehr Kontrolle &uuml;ber das Fenster-Layout hat.</em></pre>

</body>
</html>
