<!DOCTYPE HTML>
<html>
<head>
<title>RegExMatch</title>
<meta name="keywords" content="Befehl, Funktion, String">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
      <h1>RegExMatch() <span class="ver">[v1.0.45+]</span></h1>
      <p>&Uuml;berpr&uuml;ft, ob ein Muster (regul&auml;rer Ausdruck) im String vorkommt.</p>
      <pre class="Syntax">Fundposition := RegExMatch(Heuhaufen, NadelRegEx [, Ausgabevariable = "", Startposition = 1])</pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td style="width: 15%;">Fundposition</td>
          <td style="width: 85%;">RegExMatch() gibt die Position von <em>NadelRegEx</em> zur&uuml;ck, das ganz links im <em>Heuhaufen</em>-String vorkommt. Position 1 ist das erste Zeichen. Eine 0 wird zur&uuml;ckgegeben, wenn der Ausdruck nicht gefunden wird. Falls ein Fehler auftritt (z. B. ein Syntaxfehler innerhalb von <em>NadelRegEx</em>), wird ein leerer String zur&uuml;ckgegeben und ErrorLevel auf einen der <a href="#ErrorLevel">unteren</a> Werte gesetzt, anstatt auf 0.</td>
        </tr>
        <tr>
          <td>Heuhaufen</td>
          <td>Der String, dessen Inhalt durchsucht wird.</td>
        </tr>
        <tr>
          <td>NadelRegEx</td>
          <td>Das zu suchende Muster, welches ein Perl-kompatibler regul&auml;rer Ausdruck (PCRE) ist. Die <a href="../misc/RegEx-QuickRef.htm">Optionen</a> des Ausdrucks (falls vorhanden) m&uuml;ssen am Anfang des Strings stehen, gefolgt von einer schlie&szlig;enden Klammer. Zum Beispiel wird mit dem Ausdruck "<span class="red">i)</span>abc.*123" die Unterscheidung von Gro&szlig;- und Kleinschreibung deaktiviert und "abc" gesucht, gefolgt von null oder mehr beliebige Zeichen, gefolgt von "123". Wenn keine Optionen vorhanden sind, ist das ")" optional; zum Beispiel ist ")abc" das gleiche wie "abc".</td>
        </tr>
        <tr>
          <td><span class="CommandSyntax">Ausgabevariable</span></td>
          <td><p><strong>Modus 1 (Standard):</strong> Der Name der <em>Ausgabevariable</em> ohne Anf&uuml;hrungszeichen, in der eine Zeichenfolge von <em>Heuhaufen</em> gespeichert wird, die mit dem angegeben Ausdruck &uuml;bereinstimmt. Falls der Ausdruck nicht gefunden wird (also wenn die Funktion 0 zur&uuml;ckgibt), wird diese Variable sowie alle dazugeh&ouml;rigen Array-Elemente leer gemacht.</p>
            <p id="Array">Sind <a href="../misc/RegEx-QuickRef.htm#subpat">Teilausdr&uuml;cke</a> in <em>NadelRegEx</em> vorhanden, werden ihre &Uuml;bereinstimmungen in ein <a href="../misc/Arrays.htm">Array</a> gespeichert, dessen Basisname <em>Ausgabevariable</em> ist. Wenn die Variable zum Beispiel <em>Match</em> hei&szlig;t, wird der Teilstring, der mit dem ersten Teilausdruck &uuml;bereinstimmt, in <em>Match1</em> gespeichert, der zweite in <em>Match2</em> und so weiter. <a href="#NamedSubPat">Benannte Teilausdr&uuml;cke</a> sind dabei eine Ausnahme: anstelle der Zahl wird deren Namen verwendet. Zum Beispiel wird der Teilstring, der mit dem benannten Teilausdruck <em>(?P&lt;Jahr&gt;\d{4})</em> &uuml;bereinstimmt, in <em>MatchJahr</em> gespeichert. Wenn ein bestimmter Teilausdruck mit gar nichts &uuml;bereinstimmt (oder die Funktion 0 zur&uuml;ckgibt), wird die entsprechende Variable leer gemacht.</p>
            <p>Um innerhalb einer <a href="../Functions.htm">Funktion</a> ein Array zu erstellen, das global anstatt lokal ist, muss der Basisname des Arrays zuvor als globale Variable <a href="../Functions.htm#Global">deklariert</a> werden. Bei <a href="../Functions.htm#AssumeGlobal">global-angesehene</a> Funktionen gilt das Gegenteil.</p>
            <p id="PosMode"><strong>Modus 2 (Position und L&auml;nge):</strong> Wenn der Gro&szlig;buchstabe P in den Optionen von RegEx vorhanden ist (z. B. "<span class="red">P)</span>abc.*123"), wird die <em>L&auml;nge</em> der &Uuml;bereinstimmung in <em>Ausgabevariable</em> gespeichert (oder 0, wenn nichts gefunden wird). Sind <a href="../misc/RegEx-QuickRef.htm#subpat">Teilausdr&uuml;cke</a> vorhanden, wird deren Position und L&auml;nge in zwei Arrays gespeichert: <em>AusgabevariablePos</em> und <em>AusgabevariableLen</em>. Wenn der Basisname der Variable zum Beispiel <em>Match</em> ist, wird die einsbasierte <em>Position</em> des ersten Teilausdrucks (falls gefunden) in <em>MatchPos1</em> sowie dessen L&auml;nge in <em>MatchLen1</em> gespeichert (beide sind leer, wenn keine &Uuml;bereinstimmung gefunden wird oder die Funktion eine 0 zur&uuml;ckgibt). <a href="#NamedSubPat">Benannte Teilausdr&uuml;cke</a> sind dabei eine Ausnahme: anstelle der Zahl wird deren Namen verwendet (z. B. <em>MatchPosJahr</em> und <em>MatchLenJahr</em>).</p>
            <p id="ObjectMode"><strong>Modus 3 (Match-Objekt)</strong> <span class="ver">[v1.1.05+]</span><strong>:</strong> Wenn der Gro&szlig;buchstabe O in den Optionen von RegEx vorhanden ist (z. B. "<span class="red">O)</span>abc.*123"), wird ein <a href="#MatchObject">Match-Objekt</a> in die <em>Ausgabevariable</em> gespeichert. Dieses Objekt kann dazu verwendet werden, Position, L&auml;nge und Wert der gesamten &Uuml;bereinstimmung sowie von jedem <a href="../misc/RegEx-QuickRef.htm#subpat">Teilausdruck</a> abzurufen, falls vorhanden.</p></td>
        </tr>
        <tr>
          <td>Startposition</td>
          <td><p>Ist dieser Parameter nicht vorhanden, wird standardm&auml;&szlig;ig eine 1 verwendet (der Anfang von <em>Heuhaufen</em>). Ansonsten beginnt die Suche mit einer 2 beim zweiten Zeichen, mit einer 3 beim dritten Zeichen und so weiter. Wenn <em>Startposition</em> die L&auml;nge von <em>Heuhaufen</em> &uuml;berschreitet, beginnt die Suche bei einem leeren String am Ende des <em>Heuhaufens</em> (das nat&uuml;rlich zur Folge hat, dass keine &Uuml;bereinstimmung gefunden wird).</p>
            <p>Sobald <em>Startposition</em> kleiner als 1 ist, wird dieser Parameter als Offset vom Ende des <em>Heuhaufens</em> angesehen. Zum Beispiel beginnt die Suche mit einer 0 beim letzten Zeichen und mit -1 beim vorletzten Zeichen. Wenn <em>Startposition</em> das linke Ende des <em>Heuhaufens</em> &uuml;berschreitet, wird alles vom <em>Heuhaufen</em> durchsucht.</p>
            <p>Unabh&auml;ngig von <em>Startposition</em> bezieht sich der R&uuml;ckgabewert immer auf das erste Zeichen des <em>Heuhaufens</em>. Zum Beispiel ist die Position von "abc" in "123abc789" immer 4.</p></td>
        </tr>
      </table>
      <h3 id="ErrorLevel">ErrorLevel</h3>
      <p><span class="ver">[v1.1.04+]</span> Diese Funktion ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen (nicht zu verwechseln mit "keine &Uuml;bereinstimmung gefunden"). F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
      <p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> kann Folgendes enthalten:</p>
      <ul>
        <li>Eine 0 - das hei&szlig;t, dass keine Fehler aufgetreten sind.</li>
        <li>Einen String in folgender Form: <em>Compile error N at offset M: Beschreibung</em>. In diesem String ist <em>N</em> die PCRE-Fehlernummer, <em>M</em> die Position des betroffenen Zeichens innerhalb des regul&auml;ren Ausdrucks und <em>Beschreibung</em> ein Text, der den Fehler beschreibt.</li>
        <li>Eine negative Zahl - das hei&szlig;t, dass ein Fehler beim <em>Ausf&uuml;hren</em> des regul&auml;ren Ausdrucks aufgetreten ist. Obwohl solche Fehler selten sind, sind die am h&auml;ufigsten auftretenden Fehler "zu viele m&ouml;gliche &Uuml;bereinstimmungen mit leeren Strings" (-22), "Rekursion zu tief" (-21) und "Limit der &Uuml;bereinstimmung erreicht" (-8). In so einem Fall sollte das Muster restriktiver gemacht werden. Zum Beispiel kann je nach M&ouml;glichkeit das Sternchen (*) mit einem Fragezeichen (?), Pluszeichen (+) oder einer Begrenzung wie {0,3} ersetzen werden.</li>
      </ul>
      <h3>Optionen</h3>
      <p>Siehe <a href="../misc/RegEx-QuickRef.htm#Options">Optionen</a> f&uuml;r Modifikatoren wie "<span class="red">i)</span>abc", die die Unterscheidung von Gro&szlig;- und Kleinschreibung im Muster "abc" deaktiviert.</p>
      <h3 id="MatchObject">Match-Objekt <span class="ver">v1.1.05+</span></h3>
      <p>Wenn der Gro&szlig;buchstabe O in den Optionen des Ausdrucks vorhanden ist, wird ein Match-Objekt in <em>Ausgabevariable</em> gespeichert. Dieses Objekt hat folgende Eigenschaften:</p>
      <p><strong>Match.Pos(N)</strong>: Gibt die Position der gesamten &Uuml;bereinstimmung oder eines Teilausdrucks zur&uuml;ck.</p>
      <p><strong>Match.Len(N)</strong>: Gibt die L&auml;nge der gesamten &Uuml;bereinstimmung oder eines Teilausdrucks zur&uuml;ck.</p>
      <p><strong>Match.Value(N)</strong>: Gibt die gesamte &Uuml;bereinstimmung oder ein Teilausdruck zur&uuml;ck.</p>
      <p><strong>Match.Name(N)</strong>: Gibt den Namen eines benannten Teilausdrucks zur&uuml;ck, falls vorhanden.</p>
      <p><strong>Match.Count()</strong>: Gibt die Gesamtanzahl an Teilausdr&uuml;cken zur&uuml;ck.</p>
      <p><strong>Match.Mark()</strong>: Gibt <em>NAME</em> des zuletzt gefundenen Teilausdrucks <code>(*MARK:NAME)</code> zur&uuml;ck, falls vorhanden.</p>
      <p><strong>Match[N]</strong>: Wenn <em>N</em> eine 0 oder Nummer/Name eines g&uuml;ltigen Teilausdrucks ist, dann ist diese Schreibweise mit <code>Match.Value(N)</code> vergleichbar. Ansonsten kann <em>N</em> der Name einer der oben genannten Eigenschaften sein. Zum Beispiel sind <code>Match[&quot;Pos&quot;]</code> und <code>Match.Pos</code> das gleiche wie <code>Match.Pos()</code>, sofern es keinen Teilausdruck mit dem Namen "Pos" gibt, denn sonst w&uuml;rden sie das gleiche wie <code>Match.Value("Pos")</code> sein.</p>
      <p><strong>Match.N</strong>: Das Gleiche wie oben, nur dass <em>N</em> eine Zahl oder ein Name ohne Anf&uuml;hrungszeichen ist.</p>
      <p>Bei allen oben genannten Eigenschaften kann <em>N</em> Folgendes sein:</p>
      <ul>
        <li>0 f&uuml;r die gesamte &Uuml;bereinstimmung.</li>
        <li>Die Nummer eines Teilausdrucks, auch einen mit Namen.</li>
        <li>Der Name eines Teilausdrucks.</li>
      </ul>
      <p>Es k&ouml;nnen eckige Klammern anstelle von runden Klammern verwendet werden, wenn <em>N</em> angegeben wurde.</p>
      <h3>Performance</h3>
      <p>Um einen einfachen Teilstring innerhalb eines gr&ouml;&szlig;eren Strings zu suchen, ist es besser, <a href="../Functions.htm#InStr">InStr()</a> zu benutzen, weil es schneller als RegExMatch() ist.</p>
      <p>Zur Verbesserung der Performance werden die 100 aktuellsten regul&auml;ren Ausdr&uuml;cke im Speicher zwischengespeichert (in kompilierter Form).</p>
      <p>Die <a href="../misc/RegEx-QuickRef.htm#Study">S-Option</a> kann mitunter dabei helfen, die Performance eines h&auml;ufig benutzten regul&auml;ren Ausdrucks zu verbessern (z. B. in einer Schleife).</p>
      <h3>Bemerkungen</h3>
      <p id="NamedSubPat">Es ist m&ouml;glich, einen Teilausdruck zu benennen, wie z. B. das Wort <em>Jahr</em> im Ausdruck <em>(?P&lt;Jahr&gt;\d{4})</em>. Solche Namen k&ouml;nnen maximal 32 Zeichen lang sein. Zudem sind nur alphanumerische Zeichen und Unterstriche erlaubt. Die folgende Einschr&auml;nkung gilt nicht f&uuml;r den O-Modus (Match-Objekt): Obwohl benannte Teilausdr&uuml;cke w&auml;hrend der RegEx-Operation selbst auch per Nummer zug&auml;nglich sind (z. B. ist \1 eine R&uuml;ckreferenz auf den String, der zurzeit mit dem ersten Teilausdruck &uuml;bereinstimmt), werden diese <em>nur</em> per Name in das <a href="#Array">Ausgabe-Array</a> gespeichert (nicht per Nummer). Wenn der erste Teilausdruck zum Beispiel "Jahr" hei&szlig;t, wird der &uuml;bereinstimmende Teilstring in <em>AusgabevariableJahr</em> gespeichert, aber <em>Ausgabevariable1</em> bleibt unver&auml;ndert (sie enth&auml;lt weiterhin den vorherigen Wert, falls vorhanden). Wenn jedoch ein <a href="../misc/RegEx-QuickRef.htm#subpat">unbenannter Teilausdruck</a> nach "Jahr" erfolgt, wird dieser in <em>Ausgabevariable2</em> gespeichert, anstatt in <em>Ausgabevariable1</em>.</p>
      <p>Die meisten Zeichen wie abc123 k&ouml;nnen direkt in einem regul&auml;ren Ausdruck verwendet werden. Die Zeichen <strong>\.*?+[{|()^$</strong> m&uuml;ssen allerdings mit einem Backslash vorangestellt werden, um auch diese direkt verwenden zu k&ouml;nnen. Zum Beispiel wird <strong>\.</strong> als direkt vorhandener Punkt und <strong>\\</strong> als direkt vorhandener Backslash angesehen. Diese Zeichen m&uuml;ssen nicht gesch&uuml;tzt werden, wenn \Q...\E verwendet wird. Zum Beispiel: \QDirekt vorhandener Text\E.</p>
      <p>Innerhalb eines regul&auml;ren Ausdrucks k&ouml;nnen bestimmte Sonderzeichen wie Tabulatorzeichen und Zeilenumbr&uuml;che sowohl mit einem Akzent- (`) als auch  mit einem Backslash-Zeichen (\) gesch&uuml;tzt werden. Zum Beispiel ist `t das gleiche wie \t, sofern die <b>x</b>-Option nicht verwendet wird.</p>
      <p>Um die Grundlagen von regul&auml;ren Ausdr&uuml;cken kennenzulernen (oder das Ged&auml;chtnis ein wenig aufzufrischen), siehe <a href="../misc/RegEx-QuickRef.htm">RegEx-Kurz&uuml;bersicht</a>.</p>
      <p>AutoHotkey's regul&auml;re Ausdr&uuml;cke wurden mittels Perl-kompatible regul&auml;re Ausdr&uuml;cke (PCRE) von <a href="http://www.pcre.org/">www.pcre.org</a> implementiert.</p>
      <h3>Verwandte Befehle</h3>
      <p><a href="RegExReplace.htm">RegExReplace()</a>, <a href="../misc/RegEx-QuickRef.htm">RegEx-Kurz&uuml;bersicht</a>, <a href="../misc/RegExCallout.htm">Callouts in regul&auml;ren Ausdr&uuml;cken</a>, <a href="../Functions.htm#InStr">InStr()</a>, <a href="IfInString.htm">IfInString</a>, <a href="StringGetPos.htm">StringGetPos</a>, <a href="../Functions.htm#SubStr">SubStr()</a>, <a href="SetTitleMatchMode.htm#RegEx">SetTitleMatchMode RegEx</a>, <a href="http://www.autohotkey.com/forum/topic16164.html">Global matching and Grep (Forum-Link)</a></p>
      <p>H&auml;ufige Quellen von Textdaten: <a href="FileRead.htm">FileRead</a>, <a href="URLDownloadToFile.htm">UrlDownloadToFile</a>, <a href="../misc/Clipboard.htm">Clipboard</a>, <a href="GuiControls.htm#Edit">GUI-Eingabefelder</a></p>
      <h3>Beispiele</h3>
      <pre class="NoIndent">Fundposition := RegExMatch("xxxabc123xyz", "abc.*xyz")  <em>; Gibt 4 zur&uuml;ck - die Position, auf der die &Uuml;bereinstimmung gefunden wurde.</em>
Fundposition := RegExMatch("abc123123", "123$")  <em>; Gibt 7 zur&uuml;ck, weil das $ die &Uuml;bereinstimmung dazu zwingt, am Ende vorzukommen.</em>
Fundposition := RegExMatch("abc123", "i)^ABC")  <em>; Gibt 1 zur&uuml;ck, da eine &Uuml;bereinstimmung durch i-Option (keine Unterscheidung zwischen Gro&szlig;- und Kleinschreibung) gefunden wurde.</em>
Fundposition := RegExMatch("abcXYZ123", "abc(.*)123", SubPat)  <em>; Gibt 1 zur&uuml;ck und speichert "XYZ" in SubPat1.</em>
Fundposition := RegExMatch("abc123abc456", "abc\d+", "", 2)  <em>; Gibt 7 anstelle von 1 zur&uuml;ck, wegen der 2 in der Startposition.</em>

<em>; Allgemeine RegEx-Beispiele k&ouml;nnen in der <a href="../misc/RegEx-QuickRef.htm">RegEx-Kurz&uuml;bersicht</a> gefunden werden.</em></pre>
    </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>