<!DOCTYPE HTML>
<html>
<head>
<title>RegRead</title>
<meta name="keywords" content="Befehl, Registrierung">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <article>
      <h1>RegRead</h1>
      <p>Liest einen Wert aus der Registrierung.</p>
      <pre class="Syntax">RegRead, Ausgabevariable, Hauptschl&uuml;ssel, Unterschl&uuml;ssel [, Wertname]</pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td>Ausgabevariable</td>
          <td>Der Name der Variable, in der der ermittelte Wert gespeichert wird. Falls der Wert nicht abgerufen werden kann, wird die Variable leer gemacht und <a href="../misc/ErrorLevel.htm">ErrorLevel</a> auf 1 gesetzt.</td>
        </tr>
        <tr>
          <td style="width: 15%;">Hauptschl&uuml;ssel</td>
          <td style="width: 85%;">Muss entweder HKEY_LOCAL_MACHINE (HKLM), HKEY_USERS (HKU), HKEY_CURRENT_USER (HKCU), HKEY_CLASSES_ROOT (HKCR) oder HKEY_CURRENT_CONFIG (HKCC) sein. F&uuml;r den Zugriff auf eine Remoteregistrierung muss der Computername und ein Doppelpunkt wie folgt vorangestellt werden: \\workstation01:HKEY_LOCAL_MACHINE</td>
        </tr>
        <tr>
          <td>Unterschl&uuml;ssel</td>
          <td>Der Name des Unterschl&uuml;ssels (z. B. Software\BeliebigeAnwendung).</td>
        </tr>
        <tr>
          <td>Wertname</td>
          <td>Der Name des zu ermittelnden Wertes. Ist dieser Parameter nicht vorhanden, wird der Standardwert von <em>Unterschl&uuml;ssel</em> abgerufen. Dieser wird in RegEdit als "(Standard)" angezeigt. Wenn kein Standardwert vorhanden ist (d. h., wenn in RegEdit "Wert nicht festgelegt" anzeigt wird), wird die <em>Ausgabevariable</em> leer gemacht und ErrorLevel auf 1 gesetzt.</td>
        </tr>
      </table>
      <h3>ErrorLevel</h3>
      <p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
      <p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird bei Misserfolg auf 1 (z. B. nicht vorhandener Schl&uuml;ssel oder Wert) oder bei Erfolg auf 0 gesetzt.</p>
      <p><a href="../Variables.htm#LastError">A_LastError</a> wird auf das Ergebnis der Systemfunktion GetLastError() gesetzt.</p>
      <h3>Bemerkungen</h3>
      <p>Zurzeit werden nur folgende Wert-Typen unterst&uuml;tzt: REG_SZ, REG_EXPAND_SZ, REG_MULTI_SZ, REG_DWORD und REG_BINARY.</p>
      <p>REG_DWORD-Werte werden immer als positive Dezimalzahlen ausgedr&uuml;ckt.</p>
      <p>Auch wenn nicht mehr als 64 KB an Daten aus REG_BINARY-Werten gelesen werden k&ouml;nnen, sind die anderen Typen unbegrenzt. In Windows 95/98/ME sind allerdings alle Typen auf 64 KB begrenzt (die Registrierung von Win9x ist nicht in der Lage, gr&ouml;&szlig;ere Werte zu speichern).</p>
      <p>Das Ergebnis eines REG_BINARY-Schl&uuml;ssels ist ein String mit Hex-Zeichen. Zum Beispiel wird der REG_BINARY-Wert 01,a9,ff,77 als String 01A9FF77 gelesen.</p>
      <p>Das Ergebnis eines REG_MULTI_SZ-Schl&uuml;ssels besteht aus mehreren Komponenten, die jeweils mit einem Zeilenumbruchzeichen (`n) enden. Wenn keine Komponenten vorhanden sind, wird die <em>Ausgabevariable</em> leer gemacht. Siehe <a href="FileSelectFile.htm">FileSelectFile</a> f&uuml;r ein Beispiel, wie einzelne Komponenten aus der <em>Ausgabevariable</em> extrahieren werden k&ouml;nnen. Hinweis: Windows 95 unterst&uuml;tzt nicht den REG_MULTI_SZ-Werttyp.</p>
      <p>Mit der <a href="LoopReg.htm">Registrierungs-Schleife</a> k&ouml;nnen mehrere Registrierungsschl&uuml;ssel und -werte abgerufen und bearbeitet werden.</p>
      <p>Bei den Bemerkungen zur <a href="LoopReg.htm">Registrierungs-Schleife</a> wird n&auml;her gebracht, wie man auf die Registrierung eines Remotecomputers zugreifen kann.</p>
      <p>Mit <a href="SetRegView.htm">SetRegView</a> k&ouml;nnen Eintr&auml;ge von den 64-Bit-Bereichen der Registrierung in einem 32-Bit-Script oder umgekehrt gelesen und geschrieben werden.</p>
      <h3>Verwandte Befehle</h3>
      <p><a href="RegDelete.htm">RegDelete</a>, <a href="RegWrite.htm">RegWrite</a>, <a href="LoopReg.htm">Registrierungs-Schleife</a>, <a href="SetRegView.htm">SetRegView</a>, <a href="IniRead.htm">IniRead</a></p>
      <h3>Beispiel</h3>
      <pre class="NoIndent">RegRead, Ausgabevariable, HKEY_LOCAL_MACHINE, SOFTWARE\Microsoft\Windows\CurrentVersion, ProgramFilesDir
MsgBox, Programmdateien befinden sich in: %Ausgabevariable%</pre>
      <p>&nbsp;</p>
      <pre class="NoIndent"><em>; Das folgende Beispiel ermittelt den TYP eines Registrierungswertes (z. B. REG_SZ oder REG_DWORD).</em>
MsgBox % RegSchl&uuml;sseltyp("HKCU", "Environment", "TEMP")
Return

RegSchl&uuml;sseltyp(Hauptschl&uuml;ssel, Unterschl&uuml;ssel, Wertname)  <em>; Diese Funktion gibt den Typ des angegebenen Wertes zur&uuml;ck.</em>
{
    Loop, %Hauptschl&uuml;ssel%, %Unterschl&uuml;ssel%
        If (A_LoopRegName = Wertname)
            Return A_LoopRegType
    Return "Fehler"
}</pre>
    </article>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>