<!DOCTYPE HTML>
<html>
<head>
<title>RegWrite</title>
<meta name="keywords" content="Befehl, Registrierung">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <article>
      <h1>RegWrite</h1>
      <p>Schreibt einen Wert in die Registrierung.</p>
      <pre class="Syntax">RegWrite, Werttyp, Hauptschl&uuml;ssel, Unterschl&uuml;ssel [, Wertname, Wert]</pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td>Werttyp</td>
          <td>Muss entweder REG_SZ, REG_EXPAND_SZ REG_MULTI_SZ, REG_DWORD oder REG_BINARY sein. </td>
        </tr>
        <tr>
          <td style="width: 15%;">Hauptschl&uuml;ssel</td>
          <td style="width: 85%;">Muss entweder HKEY_LOCAL_MACHINE (HKLM), HKEY_USERS (HKU), HKEY_CURRENT_USER (HKCU), HKEY_CLASSES_ROOT (HKCR) oder HKEY_CURRENT_CONFIG (HKCC) sein. F&uuml;r den Zugriff auf eine Remoteregistrierung muss der Computername und ein Doppelpunkt wie folgt vorangestellt werden: \\workstation01:HKEY_LOCAL_MACHINE</td>
        </tr>
        <tr>
          <td>Unterschl&uuml;ssel</td>
          <td>Der Name des Unterschl&uuml;ssels (z. B. Software\BeliebigeAnwendung). Falls der <em>Unterschl&uuml;ssel</em> nicht vorhanden ist, wird er erstellt (einschlie&szlig;lich seine Elternelemente, falls n&ouml;tig). Ist der <em>Unterschl&uuml;ssel</em> leer, wird der Wert direkt in den <em>Hauptschl&uuml;ssel</em> geschrieben (obwohl einige Betriebssysteme sich weigern k&ouml;nnten, in die oberste Ebene von HKEY_CURRENT_USER zu schreiben).</td>
        </tr>
        <tr>
          <td>Wertname</td>
          <td>Der Name des zu schreibenden Wertes. Ist dieser Parameter nicht vorhanden, wird der Standardwert von <em>Unterschl&uuml;ssel</em> verwendet. Dieser wird in RegEdit als "(Standard)" angezeigt.</td>
        </tr>
        <tr>
          <td>Wert</td>
          <td>Der zu schreibende Wert. Ist dieser Parameter nicht vorhanden, wird je nach <em>Werttyp</em> standardm&auml;&szlig;ig ein leerer String oder eine 0 verwendet. Falls der Text zu lang ist, kann dieser in mehreren kurzen Zeilen aufgeteilt werden (<a href="../Scripts.htm#continuation">Fortsetzungsbereich</a>), um die Lesbarkeit und Wartbarkeit zu verbessern.</td>
        </tr>
      </table>
      <h3>ErrorLevel</h3>
      <p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
      <p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird bei Misserfolg auf 1 und bei Erfolg auf 0 gesetzt.</p>
      <p><a href="../Variables.htm#LastError">A_LastError</a> wird auf das Ergebnis der Systemfunktion GetLastError() gesetzt.</p>
      <h3>Bemerkungen</h3>
      <p>Wenn der <em>Werttyp</em> REG_DWORD enth&auml;lt, sollte der <em>Wert</em> zwischen -2147483648 und 4294967295 (0xFFFFFFFF) liegen.</p>
      <p>
      <p>Auch wenn nicht mehr als 64 KB an Daten aus REG_BINARY-Werten gelesen werden k&ouml;nnen, sind die anderen Typen unbegrenzt. In Windows 95/98/ME sind allerdings alle Typen auf 64 KB begrenzt. Wenn das Limit von 64 KB gilt, werden Daten &uuml;ber dem Limit nicht geschrieben. Das hei&szlig;t, dass nur die ersten 64 KB eines sehr gro&szlig;en Strings in die Registrierung gespeichert werden.</p>
      <p>Der zu schreibende Wert eines REG_BINARY-Schl&uuml;ssels muss ein String mit Hex-Zeichen sein. Zum Beispiel ist es mithilfe des Strings 01A9FF77 m&ouml;glich, einen REG_BINARY-Wert von 01,a9,ff,77 zu schreiben.</p>
      <p>Der zu schreibende Wert eines REG_MULTI_SZ-Schl&uuml;ssels muss aus mehreren Komponenten bestehen, die jeweils mit einen Zeilenumbruchzeichen (`n) enden. Optional kann die letzte Komponente auch mit Zeilenumbruchzeichen enden. Leere Komponenten sind nicht erlaubt. Das hei&szlig;t, dass zwei Zeilenumbruchzeichen nicht hintereinander erfolgen d&uuml;rfen (`n`n), denn das w&uuml;rde bedeuten, dass ein Wert in die Registrierung geschrieben wird, der k&uuml;rzer als erwartet ist. Hinweis: Windows 95 unterst&uuml;tzt nicht den REG_MULTI_SZ-Werttyp.</p>
      <p>Mit der <a href="LoopReg.htm">Registrierungs-Schleife</a> k&ouml;nnen mehrere Registrierungsschl&uuml;ssel und -werte abgerufen und bearbeitet werden.</p>
      <p>Bei den Bemerkungen zur <a href="LoopReg.htm">Registrierungs-Schleife</a> wird n&auml;her gebracht, wie man auf die Registrierung eines Remotecomputers zugreifen kann.</p>
      <p>Mit <a href="SetRegView.htm">SetRegView</a> k&ouml;nnen Eintr&auml;ge von den 64-Bit-Bereichen der Registrierung in einem 32-Bit-Script oder umgekehrt gelesen und geschrieben werden.</p>
      <h3>Verwandte Befehle</h3>
      <p><a href="RegDelete.htm">RegDelete</a>, <a href="RegRead.htm">RegRead</a>, <a href="LoopReg.htm">Registrierungs-Schleife</a>, <a href="SetRegView.htm">SetRegView</a>, <a href="IniWrite.htm">IniWrite</a></p>
      <h3>Beispiele</h3>
      <pre class="NoIndent">RegWrite, REG_SZ, HKEY_LOCAL_MACHINE, SOFTWARE\Testschl&uuml;ssel, Wertname, Testwert
RegWrite, REG_BINARY, HKEY_CURRENT_USER, Software\TEST_APP, TEST_NAME, 01A9FF77
RegWrite, REG_MULTI_SZ, HKEY_CURRENT_USER, Software\TEST_APP, TEST_NAME, Zeile1`nZeile2</pre>
    </article>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>