<!DOCTYPE HTML>
<html>
<head>
<title>Reload</title>
<meta name="keywords" content="Befehl, Ablaufsteuerung">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <article>
    <h1>Reload</h1>
    <p>Ersetzt die aktuell ausgef&uuml;hrte Instanz des Scripts mit einer neuen Instanz.</p>
    <pre class="Syntax">Reload </pre>
    <p>Dieser Befehl ist f&uuml;r Scripts n&uuml;tzlich, die h&auml;ufig ge&auml;ndert werden. Wenn diesem Befehl ein Hotkey zugewiesen wird, dann kann der Benutzer das Script einfach neu starten, nachdem er seine &Auml;nderungen in einem Editor abgespeichert hat.</p>
    <p>Jeder <a href="../Scripts.htm#cmd">Parameter einer Befehlszeile</a>, der ans originale Script &uuml;bergeben wurde, wird nicht an die neue Instanz &uuml;bergeben. Um solche Parameter zu &uuml;bergeben, verwendet nicht Reload. Verwendet stattdessen <a href="Run.htm">Run</a> in Verbindung mit <a href="../Variables.htm#AhkPath">A_AhkPath</a> und <a href="../Variables.htm#ScriptFullPath">A_ScriptFullPath</a> (und <a href="../Variables.htm#IsCompiled">A_IsCompiled</a>, wenn das Script jemals in kompilierter Form verwendet wird). Es kann auch der String <em>/restart</em> als erster Parameter eingef&uuml;gt werden (d. h. nach dem Namen der ausf&uuml;hrbaren Datei), um das gleiche Verhalten von Reload durchzuf&uuml;hren. Siehe auch: <a href="../Scripts.htm#cmd">Befehlszeilenoptionen und Syntax</a>.</p>
    <p>Wenn das Script neu startet, dann wird dieses im originalen Arbeitsverzeichnis ausgef&uuml;hrt (welches beim ersten Start wirksam war). Das hei&szlig;t, dass <a href="SetWorkingDir.htm">SetWorkingDir</a> nicht das Arbeitsverzeichnis &auml;ndert, das f&uuml;r die neue Instanz verwendet wird.</p>
    <p>Wenn das Script nicht neu geladen werden kann (z. B. wegen eines Syntax-Fehlers), dann wird die originale Instanz des Scripts fortgef&uuml;hrt. Daher sollten nach dem Reload-Befehl bestimmte Aktionen im Falle eines Fehlers angegeben werden (z. B. <a href="Return.htm">Return</a>, um die aktuelle Subroutine zu verlassen). Damit die originale Instanz den Fehler erkennt, befolgt dieses Beispiel:</p>
    <pre>Reload
Sleep 1000 <em>; Wenn erfolgreich, dann schlie&szlig;t Reload diese Instanz w&auml;hrend Sleep, die Zeile darunter wird also nie erreicht.</em>
MsgBox, 4,, Das Script konnte nicht neu geladen werden. M&ouml;chten sie das Script &ouml;ffnen, um es zu bearbeiten?
IfMsgBox, Yes, Edit
Return</pre>
    <h3>Verwandte Befehle</h3>
    <p><a href="Edit.htm">Edit</a></p>
    <h3>Beispiel</h3>
    <pre class="NoIndent">^!r::Reload  <em>; Strg+Alt+R wird als Hotkey dem Script zugewiesen, um es neu zu starten.</em></pre>
  </article>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>