<!DOCTYPE HTML>
<html>
<head>
<title>Reload</title>
<meta name="keywords" content="Befehl, Ablaufsteuerung">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
      <h1>Reload</h1>
      <p>Ersetzt die aktuell laufende Instanz des Scripts mit einer neuen Instanz.</p>
      <pre class="Syntax">Reload </pre>
      <p>Dieser Befehl ist f&uuml;r Scripts n&uuml;tzlich, die h&auml;ufig ge&auml;ndert werden. Wenn diesem Befehl ein Hotkey zugewiesen wird, kann der Benutzer das Script einfach neu starten, nachdem er seine &Auml;nderungen in einem Editor abgespeichert hat.</p>
      <p>Jeder <a href="../Scripts.htm#cmd">Befehlszeilenparameter</a>, der ans originale Script &uuml;bergeben wurde, wird nicht an die neue Instanz &uuml;bergeben. Damit solche Parameter &uuml;bergeben werden, sollte nicht Reload, sondern <a href="Run.htm">Run</a> in Verbindung mit <a href="../Variables.htm#AhkPath">A_AhkPath</a> und <a href="../Variables.htm#ScriptFullPath">A_ScriptFullPath</a> (und <a href="../Variables.htm#IsCompiled">A_IsCompiled</a>, wenn das Script kompiliert ist) verwendet werden. Zudem kann der String <code>/restart</code> als erster Parameter eingef&uuml;gt werden (d. h. nach dem Namen der ausf&uuml;hrbaren Datei), um den Programm mitzuteilen, das gleiche Verhalten von Reload durchzuf&uuml;hren. Siehe auch: <a href="../Scripts.htm#cmd">Befehlszeilenoptionen und Syntax</a>.</p>
      <p>Bei einem Neustart des Scripts wird es im originalen Arbeitsverzeichnis ausgef&uuml;hrt (das wirksam war, als das Script zum ersten Mal gestartet wurde). Das hei&szlig;t, dass <a href="SetWorkingDir.htm">SetWorkingDir</a> nicht in der Lage ist, das Arbeitsverzeichnis zu &auml;ndern, das f&uuml;r die neue Instanz verwendet wird.</p>
      <p>Wenn das Script nicht neu geladen werden kann (z. B. wegen eines Syntax-Fehlers), wird die originale Instanz des Scripts fortgesetzt. Daher sollten nach dem Reload-Befehl bestimmte Aktionen erfolgen, die im Falle eines Fehlers durchgef&uuml;hrt werden sollen (z. B. <a href="Return.htm">Return</a>, um die aktuelle Subroutine zu verlassen). Die originale Instanz kann den Fehler wie folgt erkennen:</p>
      <pre>Reload
Sleep 1000 <em>; Bei Erfolg wird Reload diese Instanz w&auml;hrend Sleep schlie&szlig;en, so dass die Zeile darunter nie erreicht werden kann.</em>
MsgBox, 4,, Das Script konnte nicht neu geladen werden. M&ouml;chten Sie das Script zur Bearbeitung &ouml;ffnen?
IfMsgBox, Yes, Edit
Return</pre>
      <h3>Verwandte Befehle</h3>
      <p><a href="Edit.htm">Edit</a></p>
      <h3>Beispiel</h3>
      <pre class="NoIndent">^!r::Reload  <em>; Strg+Alt+R als Hotkey zuweisen, um das Script neu zu starten.</em></pre>
    </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>