<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>SendMode</title>
<meta name="keywords" content="Befehl, Tastatur, Maus, Performance">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
<div id="content">
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>SendMode <span class="ver">[v1.0.43+]</span></h1>

<p>Macht <a href="Send.htm">Send</a> gleichbedeutend mit SendInput oder SendPlay, anstatt mit SendEvent (Standard). Verwendet diese bestimmte Methode auch f&uuml;r Click und MouseMove/Click/Drag.</p>

<pre class="Syntax">SendMode Input|Play|Event|InputThenPlay</pre>
<p>Der erste Parameter ist ein folgendes Wort:</p>
<p><strong>Event</strong>: Das ist der Standardwert f&uuml;r alle Scripts. Verwendet die <a href="Send.htm#SendEvent">SendEvent</a>-Methode f&uuml;r <a href="Send.htm">Send</a>, <a href="Send.htm">SendRaw</a>, <a href="Click.htm">Click</a> und <a href="MouseMove.htm">MouseMove</a>/<a href="MouseClick.htm">Click</a>/<a href="MouseClickDrag.htm">Drag</a>.</p>
<p><strong>Input</strong>: Wechselt auf die <a href="Send.htm#SendInput">SendInput</a>-Methode f&uuml;r <a href="Send.htm">Send</a>, <a href="Send.htm">SendRaw</a>, <a href="Click.htm">Click</a> und <a href="MouseMove.htm">MouseMove</a>/<a href="MouseClick.htm">Click</a>/<a href="MouseClickDrag.htm">Drag</a>. Bekannte Einschr&auml;nkungen:</p>
<ul>
  <li>Windows Explorer ignoriert SendInput-Simulation von bestimmten Navigationshotkeys wie Alt+LeftArrow. Als &Uuml;bergangsl&ouml;sung kann entweder <em>SendEvent !{Left}</em> oder <em>SendInput {Backspace}</em> verwendet werden.</li>
</ul>
<p><strong>InputThenPlay</strong> <span class="ver">[v1.0.43.02+]:</span> Wie oben, nur dass der Input-Modus zum Play-Modus und nicht zum Event-Modus zur&uuml;ckkehrt, falls SendInput <a href="Send.htm#SendInputUnavail">nicht verf&uuml;gbar</a> ist. Dadurch kehrt auch der <a href="Send.htm#SendInput">SendInput-Befehl</a> zum Play-Modus zur&uuml;ck, wenn SendInput nicht verf&uuml;gbar ist.</p>
<p><strong><a name="Play"></a>Play</strong>: Wechselt auf die <a href="Send.htm#SendPlay">SendPlay</a>-Methode f&uuml;r <a href="Send.htm">Send</a>, <a href="Send.htm">SendRaw</a>, <a href="Click.htm">Click</a> und <a href="MouseMove.htm">MouseMove</a>/<a href="MouseClick.htm">Click</a>/<a href="MouseClickDrag.htm">Drag</a>.<br> Bekannte Einschr&auml;nkungen:</p>
<ul>
  <li>Zeichen, die nicht in der aktuellen Tastaturbelegung existieren (z. B. &Ocirc; in Englisch), k&ouml;nnen nicht gesendet werden. Als &Uuml;bergangsl&ouml;sung dient <a href="Send.htm#SendEvent">SendEvent</a>.</li>
  <li> Das Ziehen mit der Maus funktioniert m&ouml;glicherweise nicht in RichEdit-Steuerelemente (und m&ouml;glicherweise andere) wie die von WordPad und Metapad. Um einen alternativen Modus f&uuml;r das Ziehen zu verwenden, befolgt dieses Beispiel: <em><a href="Send.htm#SendEvent">SendEvent</a> {Click 6, 52, down}{Click 45, 52, up}</em></li>
  <li>Simulierte Mausraddrehungen erzeugen Bewegung nur in einer Richtung (in der Regel nach unten, nach oben jedoch nur in einigen Anwendungen). Au&szlig;erdem funktioniert die Raddrehung m&ouml;glicherweise in einigen Anwendungen wie MS Word und Editor nicht. Um einen alternativen Modus f&uuml;r das Drehen zu verwenden, befolgt dieses Beispiel: <em><a href="Send.htm#SendEvent">SendEvent</a> {WheelDown 5}</em></li>
  <li>Wenn <em>SendMode Play</em> im automatischen Ausf&uuml;hrungsbereich verwendet wird (oberster Teil des Scripts), dann sind alle neu belegten Tasten davon betroffen und verlieren m&ouml;glicherweise an Funktionalit&auml;t. Siehe <a href="../misc/Remap.htm#SendPlay">Neubelegungseinschr&auml;nkungen mit SendPlay</a> f&uuml;r Details.</li>
</ul>
<h3>Bemerkungen</h3>
<p>Da SendMode auch den Modus von <a href="Click.htm">Click</a> und <a href="MouseMove.htm">MouseMove</a>/<a href="MouseClick.htm">Click</a>/<a href="MouseClickDrag.htm">Drag</a> &auml;ndert, kann der Wunsch aufkeimen, einen anderen Modus f&uuml;r ein bestimmtes Mausereignis zu verwenden. Mit <a href="Send.htm#Click">{Click}</a> ist das ziemlich einfach zu bewerkstelligen. Zum Beispiel:</p>
<pre>SendEvent {Click 100, 200}  <em>; SendEvent verwendet die alte, traditionelle Methode des Klickens.</em></pre>
<p>Wenn SendMode im automatischen Ausf&uuml;hrungsbereich verwendet wird (oberster Teil des Scripts), dann wird auch die <a href="../misc/Remap.htm">Neubelegung von Tastatur und Maus</a> davon beeinflusst. Insbesondere, wenn <em>SendMode Play</em> mit der Neubelegung verwendet wird, siehe <a href="../misc/Remap.htm#SendPlay">Neubelegungseinschr&auml;nkungen mit SendPlay</a>.</p>
<p>Jeder neu gestartete <a href="../misc/Threads.htm">Thread</a> (z. B. ein <a href="../Hotkeys.htm">Hotkey</a>, ein <a href="Menu.htm">benutzerdefinierter Men&uuml;punkt</a> oder eine <a href="SetTimer.htm">zeitlich festgelegte</a> Subroutine) beginnt mit der Standardeinstellung des Befehls. Diese Standardeinstellung kann ge&auml;ndert werden, indem dieser Befehl im automatischen Ausf&uuml;hrungsbereich (am Anfang des Scripts) verwendet wird.</p>
<h3>Verwandte Befehle</h3>
<p><a href="Send.htm">Send</a>, <a href="SetKeyDelay.htm">SetKeyDelay</a>, <a href="SetMouseDelay.htm">SetMouseDelay</a>, <a href="Click.htm">Click</a>, <a href="MouseClick.htm">MouseClick</a>, <a href="MouseClickDrag.htm">MouseClickDrag</a>, <a href="MouseMove.htm">MouseMove</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent">SendMode Input
SendMode InputThenPlay</pre>
</div>
</div>
</body>
</html>