<!DOCTYPE HTML>
<html>
<head>
<title>SetKeyDelay</title>
<meta name="keywords" content="Befehl, Tastatur, Performance">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
    <h1>SetKeyDelay</h1>
    <p>Bestimmt die Verz&ouml;gerung, die nach jeder Tastatureingabe von <a href="Send.htm">Send</a> und <a href="ControlSend.htm">ControlSend</a> auftreten wird.</p>
    <pre class="Syntax">SetKeyDelay [, Verz&ouml;gerung, Druckdauer, Play]</pre>
    <h3>Parameter</h3>
    <table class="info">
      <tr>
        <td style="width: 15%;">Verz&ouml;gerung</td>
        <td style="width: 85%;"><p>Zeit in Millisekunden (kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein). Verwendet -1 f&uuml;r keine Verz&ouml;gerung und 0 f&uuml;r die kleinst m&ouml;gliche Verz&ouml;gerung (sobald jedoch der <em>Play</em>-Parameter vorhanden ist, erzeugt sowohl 0 als auch -1 keine Verz&ouml;gerung). Lasst diesen Parameter leer, um die aktuelle <em>Verz&ouml;gerung</em> beizubehalten.</p>
          <p>Wenn SetKeyDelay nie im Script benutzt wird, dann wird f&uuml;r die <em>Verz&ouml;gerung</em> des traditionellen SendEvent-Modus standardm&auml;&szlig;ig 10 verwendet. Beim <a href="Send.htm#SendPlayDetail">SendPlay-Modus</a> verwendet die <em>Verz&ouml;gerung</em> standardm&auml;&szlig;ig -1. Die <em>Druckdauer</em> ist standardm&auml;&szlig;ig bei beiden Modi -1.</p></td>
      </tr>
      <tr>
        <td>Druckdauer<br></td>
        <td><p id="dur">Bestimmte Spiele und andere spezialisierte Anwendungen ben&ouml;tigen m&ouml;glicherweise eine Verz&ouml;gerung innerhalb jeder Tastatureingabe, d. h. nach dem Dr&uuml;cken der Taste, aber vor dem Loslassen.</p>
          <p>Verwendet -1 f&uuml;r keine Verz&ouml;gerung (Standard) und 0 f&uuml;r die kleinst m&ouml;gliche Verz&ouml;gerung (sobald jedoch der <em>Play</em>-Parameter vorhanden ist, erzeugen sowohl 0 als auch -1 keine Verz&ouml;gerung). Wenn dieser Parameter weggelassen wird, dann bleibt die aktuelle <em>Druckdauer</em> unver&auml;ndert.</p>
          <p>Hinweis: Die <em>Druckdauer</em> erzeugt zudem eine Verz&ouml;gerung nach jeder Zustands&auml;nderung eines Modifikators (STRG, ALT, UMSCHALT und WIN) und wird ben&ouml;tigt, damit die Tasten gesendet werden.</p>
          <p>Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein.</p></td>
      </tr>
      <tr>
        <td>Play<br>
          <span class="ver">[v1.0.43+]</span></td>
        <td>Das Wort <em>Play</em> gilt f&uuml;r die oben genannten Einstellungen im <a href="Send.htm#SendPlayDetail">SendPlay-Modus</a>, jedoch nicht f&uuml;r den traditionellen SendEvent-Modus. Wenn ein Script diesen Parameter nie verwendet, dann ist die SendPlay-Verz&ouml;gerung immer -1/-1.</td>
      </tr>
    </table>
    <h3>Bemerkungen</h3>
    <p><strong>Hinweis:</strong> SetKeyDelay wird nicht von <a href="Send.htm#SendInputDetail">SendInput</a> ber&uuml;cksichtigt: in diesem Modus gibt es keine Verz&ouml;gerung zwischen den Tastatureingaben. Das Gleiche gilt f&uuml;r <a href="Send.htm">Send</a>, wenn <a href="SendMode.htm">SendMode Input</a> aktiv ist.</p>
    <p>Eine kurze Verz&ouml;gerung (Ruhephase) erfolgt automatisch nach jeder Tastatureingabe mit <a href="Send.htm">Send</a> oder <a href="ControlSend.htm">ControlSend</a>. Das geschieht, um die Zuverl&auml;ssigkeit der Scripts zu verbessern, da manchmal ein Fenster nicht mit einer Flut von Tastatureingaben mithalten kann.</p>
    <p>Durch die Granularit&auml;t (k&ouml;rnige Beschaffenheit) der Zeiterfassung im Betriebssystem werden Verz&ouml;gerungen m&ouml;glicherweise auf das n&auml;chstm&ouml;gliche Vielfache von 10 oder 15 aufgerundet. Zum Beispiel ist eine Verz&ouml;gerung zwischen 1 und 10 in den meisten XP-Systemen (und wahrscheinlich auch in NT & 2000) gleichbedeutend mit 10 oder 15.</p>
    <p>Beim Send/SendEvent-Modus f&uuml;hrt eine Verz&ouml;gerung von 0 Sleep(0) intern aus, die den Rest der Script-Zeitscheibe f&uuml;r einen anderen Prozess zur&uuml;ckgibt. Wenn es keine gibt, dann erm&ouml;glicht Sleep(0) keine Ruhephase. Eine Verz&ouml;gerung von -1 wird hingegen nie ruhen. F&uuml;r eine bessere Zuverl&auml;ssigkeit ist 0 als eine Alternative zu -1 empfehlenswert.</p>
    <p>Wenn die Verz&ouml;gerung auf -1 gesetzt wird, dann spielt die Prozess-Priorit&auml;t eine gro&szlig;e Rolle, weil sie bestimmt, wie schnell Tastatureingaben gesendet werden k&ouml;nnen, wenn der traditionelle <a href="SendMode.htm">SendEvent-Modus</a> verwendet wird. Um die Script-Priorit&auml;t zu erh&ouml;hen, verwendet <code><a href="Process.htm">Process</a>, Priority,, High</code>. Obwohl dadurch die Tastatureingaben schneller gesendet werden, als vom <a href="WinActivate.htm">aktiven Fenster</a> verarbeitet, werden sie automatisch vom System zwischengespeichert. Zwischengespeicherte Tastatureingaben werden auch weiterhin an das Zielfenster gesendet, nachdem der <a href="Send.htm">Send</a>-Befehl abgearbeitet wurde (selbst wenn das Fenster nicht l&auml;nger aktiv ist). Das ist f&uuml;r gew&ouml;hnlich harmlos, denn jede nachfolgende gesendete Tastatureingabe ans selbe Fenster wird in der Warteschlange f&uuml;r zwischengespeicherte Tastatureingaben ganz nach hinten gesetzt.</p>
    <p>Die interne Variable <strong>A_KeyDelay</strong> enth&auml;lt die aktuelle Einstellung der <em>Verz&ouml;gerung</em> im Send/SendEvent-Modus. Es gibt keine interne Variable f&uuml;r die <em>Druckdauer</em> oder <em>Verz&ouml;gerung</em> von <a href="Send.htm#SendPlayDetail">SendPlay</a>.</p>
    <p>Jeder neu gestartete <a href="../misc/Threads.htm">Thread</a> (z. B. ein <a href="../Hotkeys.htm">Hotkey</a>, ein <a href="Menu.htm">benutzerdefinierter Men&uuml;punkt</a> oder eine <a href="SetTimer.htm">zeitlich festgelegte</a> Subroutine) beginnt mit der Standardeinstellung des Befehls. Diese Standardeinstellung kann ge&auml;ndert werden, indem dieser Befehl im automatischen Ausf&uuml;hrungsbereich (am Anfang des Scripts) verwendet wird.</p>
    <h3>Verwandte Befehle</h3>
    <p><a href="Send.htm">Send</a>, <a href="ControlSend.htm">ControlSend</a>, <a href="SendMode.htm">SendMode</a>, <a href="SetMouseDelay.htm">SetMouseDelay</a>, <a href="SetControlDelay.htm">SetControlDelay</a>, <a href="SetWinDelay.htm">SetWinDelay</a>, <a href="SetBatchLines.htm">SetBatchLines</a>, <a href="Click.htm">Click</a></p>
    <h3>Beispiel</h3>
    <pre class="NoIndent">SetKeyDelay, 0</pre>
  </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>