<!DOCTYPE HTML>
<html>
<head>
<title>SetMouseDelay</title>
<meta name="keywords" content="Befehl, Maus, Performance">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
    <h1>SetMouseDelay</h1>
    <p>Bestimmt die Verz&ouml;gerung, die nach jeder Mausbewegung auftreten wird.</p>
    <pre class="Syntax">SetMouseDelay, Verz&ouml;gerung [, Play] </pre>
    <h3>Parameter</h3>
    <table class="info">
      <tr>
        <td style="width: 15%;">Verz&ouml;gerung</td>
        <td style="width: 85%;">Zeit in Millisekunden (kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein). Verwendet -1 f&uuml;r keine Verz&ouml;gerung und 0 f&uuml;r die kleinst m&ouml;gliche Verz&ouml;gerung (sobald jedoch der <em>Play</em>-Parameter vorhanden ist, erzeugt sowohl 0 als auch -1 keine Verz&ouml;gerung). Wenn nicht gesetzt, dann standardm&auml;&szlig;ig eine Verz&ouml;gerung von 10 f&uuml;r den traditionellen SendEvent-Modus und eine Verz&ouml;gerung von -1 f&uuml;r den <a href="Send.htm#SendPlayDetail">SendPlay Modus</a>.</td>
      </tr>
      <tr>
        <td>Play<br>
          <span class="ver">[v1.0.43+]</span></td>
        <td>Das Wort <em>Play</em> gilt f&uuml;r die Verz&ouml;gerung im <a href="Send.htm#SendPlayDetail">SendPlay-Modus</a>, jedoch nicht f&uuml;r den traditionellen Send/SendEvent-Modus. Wenn ein Script diesen Parameter nie verwendet, dann ist die SendPlay-Verz&ouml;gerung immer -1.</td>
      </tr>
    </table>
    <h3>Bemerkungen</h3>
    <p>Eine kurze Verz&ouml;gerung (Ruhephase) erfolgt nach jedem Mausereignis mit <a href="Click.htm">Click</a> und <a href="MouseMove.htm">MouseMove</a>/<a href="MouseClick.htm">Click</a>/<a href="MouseClickDrag.htm">Drag</a> (au&szlig;er im <a href="SendMode.htm">SendInput-Modus</a>). Das geschieht, um die Zuverl&auml;ssigkeit der Scripts zu verbessern, da manchmal ein Fenster nicht mit einer Flut von Mausereignissen mithalten kann.</p>
    <p>Durch die Granularit&auml;t (k&ouml;rnige Beschaffenheit) der Zeiterfassung im Betriebssystem werden Verz&ouml;gerungen m&ouml;glicherweise auf das n&auml;chstm&ouml;gliche Vielfache von 10 oder 15 aufgerundet. Zum Beispiel ist eine Verz&ouml;gerung zwischen 1 und 10 in den meisten XP-Systemen (und wahrscheinlich auch in NT & 2000) gleichbedeutend mit 10 oder 15.</p>
    <p>Eine Verz&ouml;gerung von 0 f&uuml;hrt Sleep(0) intern aus, die den Rest der Script-Zeitscheibe f&uuml;r einen anderen Prozess zur&uuml;ckgibt. Wenn es keine gibt, dann erm&ouml;glicht Sleep(0) keine Ruhephase. Eine Verz&ouml;gerung von -1 wird hingegen nie ruhen.</p>
    <p>Der interne Variable <strong>A_MouseDelay</strong> enth&auml;lt die aktuelle Einstellung des Send/SendEvent-Modus (es gibt keine interne Variable f&uuml;r den <a href="Send.htm#SendPlayDetail">SendPlay-Modus</a>).</p>
    <p>Jeder neu gestartete <a href="../misc/Threads.htm">Thread</a> (z. B. ein <a href="../Hotkeys.htm">Hotkey</a>, ein <a href="Menu.htm">benutzerdefinierter Men&uuml;punkt</a> oder eine <a href="SetTimer.htm">zeitlich festgelegte</a> Subroutine) beginnt mit der Standardeinstellung des Befehls. Diese Standardeinstellung kann ge&auml;ndert werden, indem dieser Befehl im automatischen Ausf&uuml;hrungsbereich (am Anfang des Scripts) verwendet wird.</p>
    <h3>Verwandte Befehle</h3>
    <p><a href="SetDefaultMouseSpeed.htm">SetDefaultMouseSpeed</a>, <a href="Click.htm">Click</a>, <a href="MouseMove.htm">MouseMove</a>, <a href="MouseClick.htm">MouseClick</a>, <a href="MouseClickDrag.htm">MouseClickDrag</a>, <a href="SendMode.htm">SendMode</a>, <a href="SetKeyDelay.htm">SetKeyDelay</a>, <a href="SetControlDelay.htm">SetControlDelay</a>, <a href="SetWinDelay.htm">SetWinDelay</a>, <a href="SetBatchLines.htm">SetBatchLines</a></p>
    <h3>Beispiel</h3>
    <pre class="NoIndent">SetMouseDelay, 0</pre>
  </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>