<!DOCTYPE HTML>
<html>
<head>
<title>SetWinDelay</title>
<meta name="keywords" content="Befehl, Fenster, Performance">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
      <h1>SetWinDelay</h1>
      <p>Bestimmt die Verz&ouml;gerung, die nach jedem Fenster-Befehl wie <a href="WinActivate.htm">WinActivate</a> auftreten wird.</p>
      <pre class="Syntax">SetWinDelay, Verz&ouml;gerung</pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td style="width: 15%;">Verz&ouml;gerung</td>
          <td style="width: 85%;">Zeit in Millisekunden (kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein). Mit -1 erfolgt &uuml;berhaupt keine Verz&ouml;gerung und mit 0 die kleinst m&ouml;gliche Verz&ouml;gerung. Ist dieser Parameter nicht vorhanden, gilt standardm&auml;&szlig;ig eine Verz&ouml;gerung von 100.</td>
        </tr>
      </table>
      <h3>Bemerkungen</h3>
      <p>Nach jedem Fenster-Befehl, au&szlig;er <a href="IfWinActive.htm">IfWinActive</a> und <a href="IfWinExist.htm">IfWinExist</a>, erfolgt automatisch eine kurze Verz&ouml;gerung (Sleep), um die Zuverl&auml;ssigkeit der Scripts zu verbessern. Manchmal ben&ouml;tigt ein Fenster eine Ruhephase, nachdem es erstellt, aktiviert, minimiert usw. wurde, damit das Fenster die Chance hat, sich selbst zu aktualisieren und auf dem n&auml;chsten Befehl reagieren zu k&ouml;nnen, den das Script versucht hat, zu senden.</p>
      <p>Obwohl eine Verz&ouml;gerung von -1 (keine Verz&ouml;gerung) erlaubt ist, ist es empfohlen, einen Wert gr&ouml;&szlig;er gleich 0 zu verwenden, damit das Script auch unter hoher CPU-Last korrekt ausgef&uuml;hrt wird.</p>
      <p>Eine Verz&ouml;gerung von 0 bewirkt die interne Ausf&uuml;hrung von Sleep(0), die den Rest der Script-Zeitscheibe f&uuml;r einen anderen Prozess zur&uuml;ckgibt. Ist keiner vorhanden, wird Sleep(0) &uuml;berhaupt nicht ausgef&uuml;hrt.</p>
      <p>Wenn die CPU langsam oder unter hoher Last ist, oder die Fensteranimation aktiviert ist, sind m&ouml;glicherweise h&ouml;here Verz&ouml;gerungswerte notwendig.</p>
      <p>Die interne Variable <strong>A_WinDelay</strong> enth&auml;lt die aktuelle Einstellung.</p>
      <p>Jeder neu gestartete <a href="../misc/Threads.htm">Thread</a> (z. B. ein <a href="../Hotkeys.htm">Hotkey</a>, ein <a href="Menu.htm">benutzerdefinierter Men&uuml;punkt</a> oder eine <a href="SetTimer.htm">zeitlich festgelegte</a> Subroutine) beginnt mit der Standardeinstellung des Befehls. Diese Standardeinstellung kann ge&auml;ndert werden, indem dieser Befehl im automatischen Ausf&uuml;hrungsbereich (am Anfang des Scripts) verwendet wird.</p>
      <h3>Verwandte Befehle</h3>
      <p><a href="SetControlDelay.htm">SetControlDelay</a>, <a href="SetKeyDelay.htm">SetKeyDelay</a>, <a href="SetMouseDelay.htm">SetMouseDelay</a>, <a href="SetBatchLines.htm">SetBatchLines</a>, <a href="SendMode.htm">SendMode</a></p>
      <h3>Beispiel</h3>
      <pre class="NoIndent">SetWinDelay, 10</pre>
    </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>
