<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>SetWinDelay</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
</head>
<body>

<h1>SetWinDelay</h1>

<p>Bestimmt die Verz&ouml;gerung, die nach jedem Fenster-Befehl wie <a href="WinActivate.htm">WinActivate</a> auftreten wird.</p>

<pre class="Syntax">SetWinDelay, Verz&ouml;gerung </pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">Verz&ouml;gerung</td>
    <td width="85%">Zeit in Millisekunden (kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein). Verwendet -1 f&uuml;r keine Verz&ouml;gerung und 0 f&uuml;r die kleinste m&ouml;gliche Verz&ouml;gerung. Wenn nicht gesetzt, dann wird eine Standardverz&ouml;gerung von 100 verwendet.</td>
  </tr>
</table>

<h3>Bemerkungen</h3>
<p>Eine kurze Verz&ouml;gerung (Ruhephase) erfolgt automatisch nach jedem Fenster-Befehl, au&szlig;er bei <a href="IfWinActive.htm">IfWinActive</a> oder <a href="IfWinExist.htm">IfWinExist</a>. Das geschieht, um die Zuverl&auml;ssigkeit der Scripts zu verbessern, weil ein Fenster manchmal eine kurze Ruhephase ben&ouml;tigt, nachdem es erstellt, aktiviert, minimiert usw. wurde, damit die Chance besteht, sich selbst zu aktualisieren und auf dem n&auml;chsten Befehl zu reagieren, der vom Script versuchsweise gesendet wird.</p>
<p>Obwohl eine Verz&ouml;gerung von -1 (keine Verz&ouml;gerung) erlaubt ist, wird mindestens ein Wert von 0 empfohlen, um das Vertrauen zu st&auml;rken, dass das Script auch unter hoher CPU-Auslastung noch richtig ausgef&uuml;hrt wird.</p>
<p>Eine Verz&ouml;gerung von 0 f&uuml;hrt Sleep(0) intern aus, die den Rest der Script-Zeitscheibe f&uuml;r einen anderen Prozess zur&uuml;ckgibt. Wenn es keine gibt, dann erm&ouml;glicht Sleep(0) keine Ruhephase.</p>
<p>Wenn die CPU langsam ist oder belastet wird, oder die Fensteranimation aktiviert ist, dann werden m&ouml;glicherweise h&ouml;here Verz&ouml;gerungswerte ben&ouml;tigt. </p>
<p>Die interne Variable <strong>A_WinDelay</strong> enth&auml;lt die aktuelle Einstellung.</p>
<p>Jeder neu gestartete <a href="../misc/Threads.htm">Thread</a> (z. B. ein <a href="../Hotkeys.htm">Hotkey</a>, ein <a href="Menu.htm">benutzerdefinierter Men&uuml;punkt</a> oder eine <a href="SetTimer.htm">zeitlich festgelegte</a> Subroutine) beginnt mit der Voreinstellung f&uuml;r diesen Befehl. Die Voreinstellung l&auml;sst sich &auml;ndern, wenn dieser Befehl im automatischen Ausf&uuml;hrungsbereich (am Anfang des Scripts) ausgef&uuml;hrt wird.</p>
<h3>Verwandte Befehle</h3>
<p><a href="SetControlDelay.htm">SetControlDelay</a>, <a href="SetKeyDelay.htm">SetKeyDelay</a>,<a href="SetMouseDelay.htm"> SetMouseDelay</a>,<a href="SetBatchLines.htm"> SetBatchLines</a>, <a href="SendMode.htm">SendMode</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">SetWinDelay, 10</pre>

</body>
</html>
