<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>SoundSet</title>
<meta name="keywords" content="Befehl, Sound">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<div id="wrapper">
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>SoundSet</h1>

<p>&Auml;ndert diverse Einstellungen eines Audioger&auml;ts (Stummschalten, Gesamtlautst&auml;rke usw.)</p>

<pre class="Syntax">SoundSet, Einstellung [, Komponententyp, Kontrolltyp, Ger&auml;tenummer]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">Einstellung</td>
    <td width="85%"><p>Eine Prozentzahl zwischen -100 und 100 (kann auch eine Flie&szlig;kommazahl oder ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein). Wenn die Zahl mit einem Plus- oder Minuszeichen beginnt, dann wird die <strong>aktuelle Einstellung</strong> mit der angegebenen Menge nach oben oder nach unten reguliert. Andernfalls wird die <em>Einstellung</em> direkt gesetzt.</p>
      <p>Bei <em>Kontrolltypen</em> mit nur zwei m&ouml;glichen Einstellungen (n&auml;mlich ONOFF, MUTE, MONO, LOUDNESS, STEREOENH und BASSBOOST) wird die Einstellung mit einer positiven Zahl aktiviert und mit einer Null deaktiviert. Wenn die Zahl allerdings mit einem Plus- oder Minuszeichen beginnt, dann wird die Einstellung umgeschaltet (jeweils auf dem entgegengesetzten Zustand).</p></td>
  </tr>
  <tr>
    <td>Komponententyp</td>
    <td><p>Ist dieser Parameter leer oder nicht vorhanden, wird standardm&auml;&szlig;ig das Wort ERROR verwendet. Ansonsten ist es ein folgendes Wort: MASTER (gleichbedeutend mit SPEAKERS), DIGITAL, LINE, MICROPHONE, SYNTH, CD, TELEPHONE, PCSPEAKER, WAVE, AUX, ANALOG, HEADPHONES oder N/A. Wenn das Audioger&auml;t den angegebenen <em>Komponententyp</em> nicht hat, dann kennzeichnet ErrorLevel das Problem.</p>
      <p>Die Komponente mit der Bezeichnung Auxiliary kann in einigen Mixern nur mit ANALOG und nicht mit AUX aufgerufen werden.</p>
    <p>Wenn ein Ger&auml;t mehrere Instanzen vom <em>Komponententyp</em> hat (zum Beispiel zwei vom Typ LINE), dann enth&auml;lt der erste Typ normalerweise die Wiedergabeeinstellungen und der zweite Typ die Aufnahmeeinstellungen. Um auf eine Instanz au&szlig;er der Ersten zuzugreifen, f&uuml;gt dem Parameter einen Doppelpunkt und eine Nummer an. Zum Beispiel: Analog:2 ist die zweite Instanz der analogen Komponente.</p></td>
  </tr>
  <tr>
    <td>Kontrolltyp</td>
    <td>Ist dieser Parameter leer oder nicht vorhanden, wird standardm&auml;&szlig;ig das Wort VOLUME verwendet. Ansonsten ist es ein folgendes Wort: VOLUME (oder VOL), ONOFF, MUTE, MONO, LOUDNESS, STEREOENH, BASSBOOST, PAN, QSOUNDPAN, BASS, TREBLE, EQUALIZER oder die Nummer eines g&uuml;ltigen Kontrolltyps (siehe <a href="#Ex">Soundkartenanalyse-Script</a>). Wenn der <em>Komponententyp</em> den angegebenen <em>Kontrolltyp</em> nicht hat, dann kennzeichnet ErrorLevel das Problem.</td>
  </tr>
  <tr>
    <td>Ger&auml;tenummer</td>
    <td>Wenn dieser Parameter weggelassen wird, dann standardm&auml;&szlig;ig eine 1 (das erste Audioger&auml;t), welches in der Regel das Standardger&auml;t f&uuml;r die Aufnahme und Wiedergabe ist. Verwendet eine Zahl gr&ouml;&szlig;er als 1, um ein anderes Audioger&auml;t zu bearbeiten. Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein.</td>
  </tr>
</table>
<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 0 gesetzt, wenn der Befehl erfolgreich war. Ansonsten enth&auml;lt ErrorLevel einen folgenden Satz:</p>
<table class="info" style="width:436px">
  <tr>
    <td width="426">Invalid Control Type or Component Type (ung&uuml;ltiger Kontrolltyp oder Komponententyp)</td>
  </tr>
  <tr>
    <td>Can't Open Specified Mixer (der angegebene Mixer konnte nicht ge&ouml;ffnet werden)</td>
  </tr>
  <tr>
    <td>Mixer Doesn't Support This Component Type (der Mixer unterst&uuml;tzt nicht diesen Komponententyp)</td>
  </tr>
  <tr>
    <td>Mixer Doesn't Have That Many of That Component Type (der Mixer hat nicht so viele Komponententypen)</td>
  </tr>
  <tr>
    <td>Component Doesn't Support This Control Type (die Komponente unterst&uuml;tzt nicht diesen Kontrolltyp)</td>
  </tr>
  <tr>
    <td>Can't Get Current Setting (aktuelle Einstellung konnte nicht ermittelt werden)</td>
  </tr>
  <tr>
    <td>Can't Change Setting (aktuelle Einstellung konnte nicht ge&auml;ndert werden)</td>
  </tr>
</table>
<h3>Bemerkungen</h3>
<p>In Windows Vista oder h&ouml;her beeinflussen SoundSet und SoundGet nur das Script selbst (das kann in einer zuk&uuml;nftigen Version behoben werden). Es gibt mindestens zwei &Uuml;bergangsl&ouml;sungen:</p>
<p>1) die Kompatibilit&auml;tseinstellung der Datei "AutoHotkey.exe" (oder des <a href="../Scripts.htm#ahk2exe">kompilierte Scripts</a>) auf "Windows XP" setzen.</p>
<p>2) Tastatureingaben senden, die die Lautst&auml;rke regeln k&ouml;nnen, um die Gesamtlautst&auml;rke des Systems zu &auml;ndern. Zum Beispiel:</p>
<pre>Send {Volume_Up}  <em>; Erh&ouml;ht die Gesamtlautst&auml;rke um 1 Stufe (normalerweise 5%).</em>
Send {Volume_Down 3}  <em>; Verringert die Gesamtlautst&auml;rke um 3 Stufen.</em>
Send {Volume_Mute}  <em>; Gesamtlautst&auml;rke stumm schalten bzw. Stummschaltung aufheben.</em></pre>
<p>Um die Einsatzm&ouml;glichkeiten des installierten Audioger&auml;ts (Mixer) festzustellen (z. B. verf&uuml;gbare Komponenten- und Kontrolltypen), f&uuml;hrt das <a href="#Ex">Soundkartenanalyse-Script</a> aus.</p>
<p>Wenn SoundSet die Lautst&auml;rke eines Komponenten &auml;ndert, dann werden alle Kan&auml;le der Komponente (z.B: links und rechts) auf die gleiche Stufe gesetzt. Das hei&szlig;t, dass jede au&szlig;ermittig eingestellte "Balance" verloren geht. Das kann bei WAVE-Komponenten verhindert werden, wenn stattdessen mit <a href="SoundSetWaveVolume.htm">SoundSetWaveVolume</a> die Lautst&auml;rke ge&auml;ndert wird, um die vorhandene Balance zu bewahren.</p>
<p>Verwendet <a href="SoundGet.htm">SoundGet</a>, um den aktuellen Wert einer Einstellung zu abzurufen.</p>
<h3>Verwandte Befehle</h3>
<p><a href="SoundGet.htm">SoundGet</a>, <a href="SoundGetWaveVolume.htm">SoundGetWaveVolume</a>, <a href="SoundSetWaveVolume.htm">SoundSetWaveVolume</a>, <a href="SoundPlay.htm">SoundPlay</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent"><em>; EINFACHE BEISPIELE:</em>
SoundSet, 50  <em>; Setzt die Gesamtlautst&auml;rke auf 50%</em>
SoundSet +10  <em>; Erh&ouml;ht die Gesamtlautst&auml;rke um10%</em>
SoundSet -10  <em>; Verringert die Gesamtlautst&auml;rke um 10%</em>
SoundSet, 1, Microphone, mute  <em>; Schaltet das Mikrofon auf stumm.</em>
SoundSet, +1, , mute  <em>; Stummschaltung umschalten (auf dem entgegengesetzten Zustand setzen)</em>
SoundSet, +20, Master, bass  <em>; Erh&ouml;ht den Bass um 20%.</em>
If ErrorLevel
    MsgBox, Die BASS-Einstellung wird nicht f&uuml;r MASTER unterst&uuml;tzt.</pre>
<p>&nbsp;</p>
<pre class="NoIndent"><a name="Ex"></a><em>; SOUNDKARTENANALYSE
; Mit dem folgenden Script k&ouml;nnen die Einsatzm&ouml;glichkeiten der Soundkarte festgestellt werden (Komponententypen und Kontrolltypen).
; Es zeigt die Ergebnisse in einem einfachen ListView.</em>

SetBatchLines -1
SplashTextOn,,, Informationen der Soundkarte ermitteln ...

<em>; Die meisten reinen Zahlen unten existieren wahrscheinlich in keinem Mixer, werden aber der Vollst&auml;ndigkeit halber abgefragt.
; Die Zahlen entsprechen den folgenden Elementen (in Reihenfolge): CUSTOM, BOOLEANMETER, SIGNEDMETER, PEAKMETER,
; UNSIGNEDMETER, BOOLEAN, BUTTON, DECIBELS, SIGNED, UNSIGNED, PERCENT, SLIDER, FADER, SINGLESELECT, MUX,
; MULTIPLESELECT, MIXER, MICROTIME, MILLITIME</em>
Kontrolltypen = VOLUME,ONOFF,MUTE,MONO,LOUDNESS,STEREOENH,BASSBOOST,PAN,QSOUNDPAN,BASS,TREBLE,EQUALIZER,0x00000000, 0x10010000,0x10020000,0x10020001,0x10030000,0x20010000,0x21010000,0x30040000,0x30020000,0x30030000,0x30050000,0x40020000,0x50030000,0x70010000,0x70010001,0x71010000,0x71010001,0x60030000,0x61030000

Komponententypen = MASTER,HEADPHONES,DIGITAL,LINE,MICROPHONE,SYNTH,CD,TELEPHONE,PCSPEAKER,WAVE,AUX,ANALOG,N/A

<em>; Erstellt eine ListView und bereitet sie auf die Hauptschleife vor:</em>
Gui, Add, Listview, w400 h400 vEigenesListView, Komponententyp|Kontrolltyp|Einstellung|Mixer
LV_ModifyCol(4, "Integer")
SetFormat, Float, 0.2  <em>; Begrenzt die maximale Anzahl an Dezimalstellen eines Prozentwertes auf 2.</em>

Loop  <em>; F&uuml;r jede vorhandene Mixernummer im System die Einsatzm&ouml;glichkeiten abfragen.</em>
{
    Mixer := A_Index
    SoundGet, Einstellung,,, %Mixer%
    If ErrorLevel = Can't Open Specified Mixer  <em>; Jeder anderer Fehler kennzeichnet den Mixer als Vorhanden.</em>
        break

    <em>; F&uuml;r jeden Komponententyp im Mixer die Instanzen und Kontrolltypen abfragen:</em>
    Loop, parse, Komponententypen, `,
    {
        Komponente := A_LoopField
        <em>; Zuerst &uuml;berpr&uuml;fen, ob dieser Komponententyp auch im Mixer vorhanden ist:</em>
        SoundGet, Einstellung, %Komponente%,, %Mixer%
        If ErrorLevel = Mixer Doesn't Support This Component Type
            continue  <em>; Eine neue Iteration starten, um auf den n&auml;chsten Komponententyp zu kommen.</em>
        Loop  <em>; F&uuml;r jede Instanz des Komponententyps die Kontrolltypen abfragen.</em>
        {
            Instanz := A_Index
            <em>; Zuerst &uuml;berpr&uuml;fen, ob diese Instanz der Instanz auch im Mixer vorhanden ist:</em>
            SoundGet, Einstellung, %Komponente%:%Instanz%,, %Mixer%
            <em>; Beide auf folgende Fehler &uuml;berpr&uuml;fen, damit dieses Script auf &auml;ltere Betriebssysteme l&auml;uft:</em>
            If ErrorLevel in Mixer Doesn't Have That Many of That Component Type,Invalid Control Type or Component Type
                break  <em>; Keine weiteren Instanzen des Komponententyps.</em>
            <em>; Ermittelt die aktuelle Einstellung von jedem Kontrolltyp, der in der Instanz der Komponente vorhanden ist:</em>
            Loop, parse, Kontrolltypen, `,
            {
                Kontrolle := A_LoopField
                SoundGet, Einstellung, %Komponente%:%Instanz%, %Kontrolle%, %Mixer%
                <em>; Beide auf folgende Fehler &uuml;berpr&uuml;fen, damit dieses Script auf &auml;ltere Betriebssysteme l&auml;uft:</em>
                If ErrorLevel in Component Doesn't Support This Control Type,Invalid Control Type or Component Type
                    continue
                If ErrorLevel  <em>; Irgendein unerwarteter Fehler, der in den Ergebnissen angezeigt wird.</em>
                    Einstellung := ErrorLevel
                Komponentenstring := Komponente
                If Instanz &gt; 1
                    Komponentenstring = %Komponentenstring%:%Instanz%
                LV_Add("", Komponentenstring, Kontrolle, Einstellung, Mixer)
            }  <em>; F&uuml;r jeden Kontrolltyp.</em>
        }  <em>; F&uuml;r jede Komponenteninstanz.</em>
    }  <em>; F&uuml;r jeden Komponententyp.</em>
}  <em>; F&uuml;r jeden Mixer.</em>

Loop % LV_GetCount("Col")  <em>; Die Gr&ouml;&szlig;e jeder Spalte automatisch anpassen, damit der Inhalt passt.</em>
    LV_ModifyCol(A_Index, "AutoHdr")

SplashTextOff
Gui, Show
Return

GuiClose:
ExitApp</pre>
</div>
</body>
</html>