<!DOCTYPE HTML>
<html>
<head>
<title>SoundSet</title>
<meta name="keywords" content="Befehl, Sound">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
      <h1>SoundSet</h1>
      <p>&Auml;ndert diverse Einstellungen eines Audioger&auml;ts (Stummschalten, Gesamtlautst&auml;rke und so weiter).</p>
      <p class="red">Funktionalit&auml;t ist in Windows Vista und h&ouml;her eingeschr&auml;nkt; siehe <a href="#Vista">Bemerkungen</a>.</p>
	  <pre class="Syntax">SoundSet, Einstellung [, Komponententyp, Kontrolltyp, Ger&auml;tenummer]</pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td style="width: 15%;">Einstellung</td>
          <td style="width: 85%;"><p>Eine Prozentzahl zwischen -100 und 100 (kann eine Flie&szlig;kommazahl oder ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein). Wenn die Zahl mit einem Plus- oder Minuszeichen beginnt, wird die <strong>aktuelle Einstellung</strong> mit der angegebenen Menge nach oben oder nach unten reguliert. Andernfalls wird die <em>Einstellung</em> direkt gesetzt.</p>
            <p>Bei <em>Kontrolltypen</em> mit nur zwei m&ouml;glichen Einstellungen (ONOFF, MUTE, MONO, LOUDNESS, STEREOENH und BASSBOOST) bewirkt eine positive Zahl, dass die Einstellung aktiviert wird, und eine 0, dass sie deaktiviert wird. Wenn die Zahl allerdings mit einem Plus- oder Minuszeichen beginnt, wird die Einstellung umgeschaltet (jeweils auf dem entgegengesetzten Zustand).</p></td>
        </tr>
        <tr>
          <td>Komponententyp</td>
          <td><p>Ist dieser Parameter leer oder nicht vorhanden, gilt standardm&auml;&szlig;ig das Wort MASTER. Ansonsten ist es eins der folgenden W&ouml;rter: MASTER (gleichbedeutend mit SPEAKERS), DIGITAL, LINE, MICROPHONE, SYNTH, CD, TELEPHONE, PCSPEAKER, WAVE, AUX, ANALOG, HEADPHONES oder N/A. Wenn das Audioger&auml;t den angegebenen <em>Komponententyp</em> nicht hat, wird ErrorLevel das Problem kennzeichnen.</p>
            <p>Es ist in einigen Mixern m&ouml;glich, dass die Komponente mit der Bezeichnung Auxiliary &uuml;ber ANALOG anstatt &uuml;ber AUX aufrufbar ist.</p>
            <p>Wenn ein Ger&auml;t mehr als eine Instanz vom <em>Komponententyp</em> hat (zum Beispiel zwei vom Typ LINE), enth&auml;lt der erste Typ f&uuml;r gew&ouml;hnlich die Wiedergabeeinstellungen und der zweite Typ die Aufnahmeeinstellungen. Um neben der ersten Instanz auch auf andere Instanzen zugreifen zu k&ouml;nnen, kann nach diesem Parameter ein Doppelpunkt und eine Nummer angef&uuml;gt werden. Zum Beispiel ist Analog:2 die zweite Instanz der analogen Komponente.</p></td>
        </tr>
        <tr>
          <td>Kontrolltyp</td>
          <td>Ist dieser Parameter leer oder nicht vorhanden, gilt standardm&auml;&szlig;ig das Wort VOLUME. Ansonsten ist es eins der folgenden W&ouml;rter: VOLUME (oder VOL), ONOFF, MUTE, MONO, LOUDNESS, STEREOENH, BASSBOOST, PAN, QSOUNDPAN, BASS, TREBLE, EQUALIZER oder die Nummer eines g&uuml;ltigen Kontrolltyps (siehe <a href="SoundSet.htm#Ex">Soundkartenanalyse-Script</a>). Wenn der <em>Komponententyp</em> den angegebenen <em>Kontrolltyp</em> nicht hat, wird ErrorLevel das Problem kennzeichnen.</td>
        </tr>
        <tr>
          <td>Ger&auml;tenummer</td>
          <td>Ist dieser Parameter nicht vorhanden, gilt standardm&auml;&szlig;ig eine 1 (das erste Audioger&auml;t), das f&uuml;r gew&ouml;hnlich das Standardger&auml;t des Systems f&uuml;r Aufnahme und Wiedergabe ist. Mit einer Zahl gr&ouml;&szlig;er als 1 kann ein anderes Audioger&auml;t bearbeitet werden. Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein.</td>
        </tr>
      </table>
      <h3>ErrorLevel</h3>
      <p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
      <p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 0 gesetzt, wenn der Befehl erfolgreich war. Ansonsten wird es auf einen der folgenden S&auml;tze gesetzt:</p>
      <table class="info" style="width: 436px;">
        <tr>
          <td>Invalid Control Type or Component Type (ung&uuml;ltiger Kontrolltyp oder Komponententyp)</td>
        </tr>
        <tr>
          <td>Can't Open Specified Mixer (der angegebene Mixer konnte nicht ge&ouml;ffnet werden)</td>
        </tr>
        <tr>
          <td>Mixer Doesn't Support This Component Type (der Mixer unterst&uuml;tzt nicht diesen Komponententyp)</td>
        </tr>
        <tr>
          <td>Mixer Doesn't Have That Many of That Component Type (der Mixer hat nicht so viele Komponententypen)</td>
        </tr>
        <tr>
          <td>Component Doesn't Support This Control Type (die Komponente unterst&uuml;tzt nicht diesen Kontrolltyp)</td>
        </tr>
        <tr>
          <td>Can't Get Current Setting (aktuelle Einstellung konnte nicht ermittelt werden)</td>
        </tr>
        <tr>
          <td>Can't Change Setting (aktuelle Einstellung konnte nicht ge&auml;ndert werden)</td>
        </tr>
      </table>
      <h3>Bemerkungen</h3>
      <p id="Vista">In Windows Vista oder h&ouml;her haben SoundSet und SoundGet nur Einfluss auf das Script selbst. Das wird m&ouml;glicherweise in einer zuk&uuml;nftigen Version behoben. Eine einfache &Uuml;bergangsl&ouml;sung ist es, lautst&auml;rke-spezifische Tastatureingaben zu senden, um die Gesamtlautst&auml;rke des Systems zu &auml;ndern, wie im Beispiel unten. Weitere &Uuml;bergangsl&ouml;sungen befinden sich in <a href="SoundGet.htm#Vista">SoundGet - Bemerkungen</a>.</p>
      <pre>Send {Volume_Up}  <em>; Erh&ouml;ht die Gesamtlautst&auml;rke um 1 Stufe (normalerweise 5%).</em>
Send {Volume_Down 3}  <em>; Verringert die Gesamtlautst&auml;rke um 3 Stufen.</em>
Send {Volume_Mute}  <em>; Gesamtlautst&auml;rke stumm schalten bzw. Stummschaltung aufheben.</em></pre>
        </li>
      </ul>
      <p>Um die F&auml;higkeiten der installierten Audioger&auml;te (Mixer) zu ermitteln (z. B. welche Komponenten- und Kontrolltypen verf&uuml;gbar sind), kann das <a href="SoundSet.htm#Ex">Soundkartenanalyse-Script</a> ausgef&uuml;hrt werden.</p>
      <p>Wenn SoundSet die Lautst&auml;rke eines Komponenten &auml;ndert, werden alle Kan&auml;le dieser Komponente (z.B: links und rechts) auf die gleiche Stufe gesetzt. Das hei&szlig;t, dass jede zuvor eingestellte au&szlig;ermittige "Balance" verloren geht. Bei der WAVE-Komponente kann das verhindert werden, indem <a href="SoundSetWaveVolume.htm">SoundSetWaveVolume</a> stattdessen verwendet wird. Dieser Befehl versucht, die vorhandene Balance beim &Auml;ndern der Lautst&auml;rke beizubehalten.</p>
      <p>Mit <a href="SoundGet.htm">SoundGet</a> kann der aktuelle Wert einer Einstellung abgerufen werden.</p>
      <h3>Verwandte Befehle</h3>
      <p><a href="SoundGet.htm">SoundGet</a>, <a href="SoundGetWaveVolume.htm">SoundGetWaveVolume</a>, <a href="SoundSetWaveVolume.htm">SoundSetWaveVolume</a>, <a href="SoundPlay.htm">SoundPlay</a></p>
      <h3>Beispiele</h3>
      <pre class="NoIndent"><em>; EINFACHE BEISPIELE:</em>
SoundSet, 50  <em>; Setzt die Gesamtlautst&auml;rke auf 50%</em>
SoundSet +10  <em>; Erh&ouml;ht die Gesamtlautst&auml;rke um 10%</em>
SoundSet -10  <em>; Verringert die Gesamtlautst&auml;rke um 10%</em>
SoundSet, 1, Microphone, mute  <em>; Schaltet das Mikrofon auf stumm.</em>
SoundSet, +1, , mute  <em>; Stummschaltung umschalten (jeweils auf den entgegengesetzten Zustand)</em>
SoundSet, +20, Master, bass  <em>; Erh&ouml;ht die Bassst&auml;rke um 20%.</em>
If ErrorLevel
    MsgBox, Die BASS-Einstellung wird nicht f&uuml;r MASTER unterst&uuml;tzt.</pre>
      <p>&nbsp;</p>
      <pre class="NoIndent" id="Ex"><em>; SOUNDKARTENANALYSE
; Mit dem folgenden Script k&ouml;nnen die F&auml;higkeiten deiner Soundkarte ermittelt werden (Komponententypen und Kontrolltypen).
; Die Ergebnisse werden in einer einfachen ListView angezeigt.</em>

SetBatchLines -1
SplashTextOn,,, Informationen der Soundkarte ermitteln ...

<em>; Die meisten unten genannten reine Zahlen gibt es wahrscheinlich nicht in jedem Mixer, allerdings werden sie der Vollst&auml;ndigkeit halber abgefragt.
; Die Zahlen beziehen sich auf folgende Elemente (in Reihenfolge): CUSTOM, BOOLEANMETER, SIGNEDMETER, PEAKMETER,
; UNSIGNEDMETER, BOOLEAN, BUTTON, DECIBELS, SIGNED, UNSIGNED, PERCENT, SLIDER, FADER, SINGLESELECT, MUX,
; MULTIPLESELECT, MIXER, MICROTIME, MILLITIME</em>
Kontrolltypen = VOLUME,ONOFF,MUTE,MONO,LOUDNESS,STEREOENH,BASSBOOST,PAN,QSOUNDPAN,BASS,TREBLE,EQUALIZER,0x00000000, 0x10010000,0x10020000,0x10020001,0x10030000,0x20010000,0x21010000,0x30040000,0x30020000,0x30030000,0x30050000,0x40020000,0x50030000,0x70010000,0x70010001,0x71010000,0x71010001,0x60030000,0x61030000

Komponententypen = MASTER,HEADPHONES,DIGITAL,LINE,MICROPHONE,SYNTH,CD,TELEPHONE,PCSPEAKER,WAVE,AUX,ANALOG,N/A

<em>; Erstellt eine ListView und bereitet diese auf die Hauptschleife vor:</em>
Gui, Add, Listview, w400 h400 vEigeneListView, Komponententyp|Kontrolltyp|Einstellung|Mixer
LV_ModifyCol(4, "Integer")
SetFormat, Float, 0.2  <em>; Begrenzt die maximale Dezimalstellenanzahl eines Prozentwertes auf 2.</em>

Loop  <em>; Ruft von jedem Mixer, der im System vorkommt, dessen F&auml;higkeiten ab.</em>
{
    Mixer := A_Index
    SoundGet, Einstellung,,, %Mixer%
    If ErrorLevel = Can't Open Specified Mixer  <em>; Jeder anderer Fehler kennzeichnet, dass der Mixer vorhanden ist.</em>
        break

    <em>; Ruft von jedem Komponententyp, der in diesem Mixer vorkommt, dessen Instanzen und Kontrolltypen ab:</em>
    Loop, parse, Komponententypen, `,
    {
        Komponente := A_LoopField
        <em>; Zuerst &uuml;berpr&uuml;fen, ob dieser Komponententyp auch im Mixer vorkommt:</em>
        SoundGet, Einstellung, %Komponente%,, %Mixer%
        If ErrorLevel = Mixer Doesn't Support This Component Type
            continue  <em>; Startet f&uuml;r den n&auml;chsten Komponententyp eine neue Iteration.</em>
        Loop  <em>; Ruft von jeder Instanz diesen Komponententyps dessen Kontrolltypen ab.</em>
        {
            Instanz := A_Index
            <em>; Zuerst &uuml;berpr&uuml;fen, ob diese Instanz dieser Instanz auch im Mixer vorkommt:</em>
            SoundGet, Einstellung, %Komponente%:%Instanz%,, %Mixer%
            <em>; Das &Uuml;berpr&uuml;fen beider folgenden Fehler erlaubt diesem Script, auf &auml;ltere Betriebssysteme zu laufen:</em>
            If ErrorLevel in Mixer Doesn't Have That Many of That Component Type,Invalid Control Type or Component Type
                break  <em>; Keine weiteren Instanzen von diesem Komponententyp.</em>
            <em>; Ermittelt die aktuelle Einstellung von jedem Kontrolltyp, der in dieser Instanz von dieser Komponente vorkommt:</em>
            Loop, parse, Kontrolltypen, `,
            {
                Kontrolle := A_LoopField
                SoundGet, Einstellung, %Komponente%:%Instanz%, %Kontrolle%, %Mixer%
                <em>; Das &Uuml;berpr&uuml;fen beider folgenden Fehler erlaubt diesem Script, auf &auml;ltere Betriebssysteme zu laufen:</em>
                If ErrorLevel in Component Doesn't Support This Control Type,Invalid Control Type or Component Type
                    continue
                If ErrorLevel  <em>; Irgendein unerwarteter Fehler, der demzufolge in den Ergebnissen angezeigt wird.</em>
                    Einstellung := ErrorLevel
                Komponentenstring := Komponente
                If Instanz &gt; 1
                    Komponentenstring = %Komponentenstring%:%Instanz%
                LV_Add("", Komponentenstring, Kontrolle, Einstellung, Mixer)
            }  <em>; F&uuml;r jeden Kontrolltyp.</em>
        }  <em>; F&uuml;r jede Komponenteninstanz.</em>
    }  <em>; F&uuml;r jeden Komponententyp.</em>
}  <em>; F&uuml;r jeden Mixer.</em>

Loop % LV_GetCount("Col")  <em>; Passt die Gr&ouml;&szlig;e jeder Spalte automatisch am Inhalt an.</em>
    LV_ModifyCol(A_Index, "AutoHdr")

SplashTextOff
Gui, Show
Return

GuiClose:
ExitApp</pre>
    </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>