<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>SoundGet</title>
<meta name="keywords" content="Befehl, Sound">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../navbar/NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(1);</script>


<h1>SoundGet</h1>

<p>Ermittelt diverse Einstellungen eines Audioger&auml;ts (Stummschalten, Gesamtlautst&auml;rke usw.)</p>

<pre class="Syntax">SoundGet, Ausgabevariable [, Komponententyp, Kontrolltyp, Ger&auml;tenummer]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">Ausgabevariable</td>
    <td width="85%">Der Name der Variable, in der die abgerufene Einstellung gespeichert wird, welche entweder eine Flie&szlig;kommazahl zwischen 0 und 100 oder das Wort ON oder OFF ist (nur f&uuml;r die <em>Kontrolltypen</em> ONOFF, MUTE, MONO, LOUDNESS, STEREOENH und BASSBOOST). Die Variable wird leer gemacht, wenn ein Problem beim Abrufen der Einstellung aufgetreten ist. Das Format der Flie&szlig;kommazahl (eine Zahl mit Dezimalstellen) wird durch <a href="SetFormat.htm">SetFormat</a> festgelegt.</td>
  </tr>
  <tr>
    <td>Komponententyp</td>
    <td><p>Ist dieser Parameter leer oder nicht vorhanden, wird standardm&auml;&szlig;ig das Wort ERROR verwendet. Ansonsten ist es ein folgendes Wort: MASTER (gleichbedeutend mit SPEAKERS), DIGITAL, LINE, MICROPHONE, SYNTH, CD, TELEPHONE, PCSPEAKER, WAVE, AUX, ANALOG, HEADPHONES oder N/A. Wenn das Audioger&auml;t den angegebenen <em>Komponententyp</em> nicht hat, dann kennzeichnet ErrorLevel das Problem.</p>
      <p>Die Komponente mit der Bezeichnung Auxiliary kann in einigen Mixern nur mit ANALOG und nicht mit AUX aufgerufen werden.</p>
    <p>Wenn ein Ger&auml;t mehrere Instanzen vom <em>Komponententyp</em> hat (zum Beispiel zwei vom Typ LINE), dann enth&auml;lt der erste Typ normalerweise die Wiedergabeeinstellungen und der zweite Typ die Aufnahmeeinstellungen. Um auf eine Instanz au&szlig;er der Ersten zuzugreifen, f&uuml;gt dem Parameter einen Doppelpunkt und eine Nummer an. Zum Beispiel: Analog:2 ist die zweite Instanz der analogen Komponente.</p>    </td>
  </tr>
  <tr>
    <td>Kontrolltyp</td>
    <td>Ist dieser Parameter leer oder nicht vorhanden, wird standardm&auml;&szlig;ig das Wort VOLUME verwendet. Ansonsten ist es ein folgendes Wort: VOLUME (oder VOL), ONOFF, MUTE, MONO, LOUDNESS, STEREOENH, BASSBOOST, PAN, QSOUNDPAN, BASS, TREBLE, EQUALIZER oder die Nummer eines g&uuml;ltigen Kontrolltyps (siehe <a href="SoundSet.htm#Ex">Soundkartenanalyse-Script</a>). Wenn der <em>Komponententyp</em> den angegebenen <em>Kontrolltyp</em> nicht hat, dann kennzeichnet ErrorLevel das Problem.</td>
  </tr>
  <tr>
    <td>Ger&auml;tenummer</td>
    <td>Wenn dieser Parameter weggelassen wird, dann standardm&auml;&szlig;ig eine 1 (das erste Audioger&auml;t), welches in der Regel das Standardger&auml;t f&uuml;r die Aufnahme und Wiedergabe ist. Verwendet eine Zahl gr&ouml;&szlig;er als 1, um ein anderes Audioger&auml;t zu bearbeiten. Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein.</td>
  </tr>
</table>
<h3>ErrorLevel</h3>
<p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird auf 0 gesetzt, wenn der Befehl erfolgreich war. Ansonsten enth&auml;lt ErrorLevel einen folgenden Satz:</p>
<table class="info" style="width:436px">
  <tr>
    <td width="426">Invalid Control Type or Component Type (ung&uuml;ltiger Kontrolltyp oder Komponententyp)</td>
  </tr>
  <tr>
    <td>Can't Open Specified Mixer (der angegebene Mixer konnte nicht ge&ouml;ffnet werden)</td>
  </tr>
  <tr>
    <td>Mixer Doesn't Support This Component Type (der Mixer unterst&uuml;tzt nicht diesen Komponententyp)</td>
  </tr>
  <tr>
    <td>Mixer Doesn't Have That Many of That Component Type (der Mixer hat nicht so viele Komponententypen)</td>
  </tr>
  <tr>
    <td>Component Doesn't Support This Control Type (die Komponente unterst&uuml;tzt nicht diesen Kontrolltyp)</td>
  </tr>
  <tr>
    <td>Can't Get Current Setting (aktuelle Einstellung konnte nicht ermittelt werden)</td>
  </tr>
</table>
<h3>Bemerkungen</h3>
<p>In Windows Vista oder h&ouml;her ermittelt SoundGet die Einstellungen des Scripts und nicht des aktiven Fensters. Dieses Problem wird m&ouml;glicherweise in einer zuk&uuml;nftigen Version behoben. Als &Uuml;bergangsl&ouml;sung kann die Kompatibilit&auml;tseinstellung der Datei "AutoHotkey.exe" (oder des <a href="../Scripts.htm#ahk2exe">kompilierte Scripts</a>) auf "Windows XP" gesetzt werden.</p>
<p>Um die Einsatzm&ouml;glichkeiten des installierten Audioger&auml;ts (Mixer) festzustellen (z. B. verf&uuml;gbare Komponenten- und Kontrolltypen), f&uuml;hrt das <a href="SoundSet.htm#Ex">Soundkartenanalyse-Script</a> aus.</p>
<p>Verwendet <a href="SoundSet.htm">SoundSet</a>, um eine Einstellung zu &auml;ndern.</p>
<h3>Verwandte Befehle</h3>
<p><a href="SoundSet.htm">SoundSet</a>, <a href="SoundGetWaveVolume.htm">SoundGetWaveVolume</a>, <a href="SoundSetWaveVolume.htm">SoundSetWaveVolume</a>, <a href="SoundPlay.htm">SoundPlay</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent">SoundGet, master_volume
MsgBox, Gesamtlautst&auml;rke liegt bei %master_volume% Prozent.

SoundGet, master_mute, , mute
MsgBox, Gesamtlautst&auml;rke ist zurzeit %master_mute%.

SoundGet, bass_level, Master, bass
If ErrorLevel
    MsgBox, Fehlerbeschreibung: %ErrorLevel%
Else
    MsgBox, The BASS-Pegel f&uuml;r MASTER liegt bei %bass_level% Prozent.

SoundGet, microphone_mute, Microphone, mute
If microphone_mute = Off
    MsgBox, Das Mikrofon ist nicht stummgeschaltet.</pre>

</body>
</html>