<!DOCTYPE HTML>
<html>
<head>
<title>SysGet</title>
<meta name="keywords" content="Befehl, Systemumgebung">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <article>
    <h1>SysGet</h1>
    <p>Ermittelt die Bildschirmaufl&ouml;sung, Multi-Monitor-Informationen, Dimensionen von Systemobjekten und andere Systemeigenschaften.</p>
    <pre class="Syntax">SysGet, Ausgabevariable, Unterbefehl [, Param3]</pre>
    <h3>Parameter</h3>
    <table class="info">
      <tr>
        <td style="width: 15%;">Ausgabevariable</td>
        <td style="width: 85%;">Der Name der Variable, in der das Ergebnis gespeichert wird.</td>
      </tr>
      <tr>
        <td>Unterbefehl</td>
        <td>Siehe untere Liste. </td>
      </tr>
      <tr>
        <td>Param3</td>
        <td>Dieser Parameter wird weggelassen, sofern nicht anders angegeben.</td>
      </tr>
    </table>
    <h3>Unterbefehle</h3>
    <p><strong>MonitorCount</strong>: Ermittelt die Gesamtzahl an Monitoren. Im Gegensatz zum unten erw&auml;hnten SM_CMONITORS enth&auml;lt <em>MonitorCount</em> alle Monitore, selbst solche, die nicht vom Desktop verwendet werden. In Windows 95/NT ist die Anzahl immer 1.</p>
    <p><strong>MonitorPrimary</strong>: Ermittelt die Nummer des prim&auml;ren Monitors, die eine 1 in einem Single-Monitor-System sein wird. In Windows 95/NT ist der prim&auml;re Monitor immer 1.</p>
    <p><strong>Monitor [, N] </strong>: Ermittelt die Begrenzungskoordinaten des Monitors mit der Nummer <strong>N</strong> (wenn <strong>N</strong> weggelassen wird, dann wird der prim&auml;re Monitor verwendet). Die Informationen werden in vier Variablen gespeichert und beginnen alle mit <em>Ausgabevariable</em>. Wenn <strong>N</strong> zu hoch ist oder ein Problem beim Abrufen der Informationen auftritt, dann werden Variablen leer gemacht. Zum Beispiel:<br>
      SysGet, Mon2, Monitor, 2 <br>
      MsgBox, Links: %Mon2Left% -- Oben: %Mon2Top% -- Rechts: %Mon2Right% -- Unten: %Mon2Bottom%.</p>
    <p>Um eine Reihe von globalen anstelle von lokalen Variablen innerhalb einer <a href="../Functions.htm">Funktion</a> zu erstellen, <a href="../Functions.htm#Global">deklariert</a> Mon2 als globale Variable, bevor dieser Befehl verwendet wird (Das Gegenteil davon gilt f&uuml;r <a href="../Functions.htm#AssumeGlobal">global-angesehene</a> Funktionen).</p>
    <p><strong>MonitorWorkArea [, N]</strong>: Das Gleiche wie oben, nur mit der Ausnahme, dass der Bereich durch die Taskleiste und andere registrierte Desktop-Toolbars reduziert ist.</p>
    <p><strong>MonitorName [, N]</strong>: Ermittelt den Systemnamen des Monitors mit der Nummer <strong>N</strong> (wenn <strong>N</strong> weggelassen wird, dann wird der prim&auml;re Monitor verwendet).</p>
    <p><strong>(Numerisch)</strong>: Gebt f&uuml;r den <em>Unterbefehl</em> eine Nummer aus der unteren Tabelle an, um den entsprechenden Wert abzurufen. Das folgende Beispiel speichert die Anzahl an Maustasten in eine Variable namens "Maustastenanzahl":<br>
      SysGet, Maustastenanzahl, 43</p>
    <h3>H&auml;ufig verwendet</h3>
    <table class="info">
      <tr>
        <th>Nummer</th>
        <th>Beschreibung</th>
      </tr>
      <tr>
        <td>80</td>
        <td>SM_CMONITORS: Anzahl der Anzeigemonitore auf dem Desktop (ohne "nichts anzeigende Pseudo-Monitore"). <b>Windows 95/NT: </b>Der abgerufene Wert ist immer 0.</td>
      </tr>
      <tr>
        <td>43</td>
        <td>SM_CMOUSEBUTTONS: Anzahl der Tasten auf der Maus (0, wenn keine Maus installiert ist).</td>
      </tr>
      <tr>
        <td>16, 17 </td>
        <td>SM_CXFULLSCREEN, SM_CYFULLSCREEN: Breite und H&ouml;he des Client-Bereichs eines Vollbild-Fensters auf dem prim&auml;ren Anzeigemonitor (in Pixel).</td>
      </tr>
      <tr>
        <td>61, 62 </td>
        <td>SM_CXMAXIMIZED, SM_CYMAXIMIZED: Standard-Abmessungen eines maximierten im Vordergrund liegenden Fensters auf dem prim&auml;ren Anzeigemonitor (in Pixel).</td>
      </tr>
      <tr>
        <td>59, 60 </td>
        <td>SM_CXMAXTRACK, SM_CYMAXTRACK: Maximale Standard-Abmessungen eines Fensters, dass eine Titelleiste und skalierbare Rahmen hat (in Pixel). Diese Ma&szlig;e beziehen sich auf dem gesamten Desktop. Beim Verkleinern des Fensterrahmens mit einem Ziehvorgang kann der Benutzer diese Abmessungen nicht &uuml;berschreiten.</td>
      </tr>
      <tr>
        <td>28, 29 </td>
        <td>SM_CXMIN, SM_CYMIN: Minimale Breite und H&ouml;he des Fensters (in Pixel).</td>
      </tr>
      <tr>
        <td>57, 58 </td>
        <td>SM_CXMINIMIZED, SM_CYMINIMIZED: Abmessungen eines minimierten Fensters (in Pixel).</td>
      </tr>
      <tr>
        <td>34, 35 </td>
        <td>SM_CXMINTRACK, SM_CYMINTRACK: Die minimale Standardbreite und -h&ouml;he des Fensters (in Pixel). Beim Verkleinern des Fensterrahmens mit einem Ziehvorgang kann der Benutzer diese Abmessungen nicht unterschreiten. Ein Fenster kann diese Werte &uuml;berschreiben, wenn die WM_GETMINMAXINFO-Nachricht verarbeitet wird.</td>
      </tr>
      <tr>
        <td>0, 1 </td>
        <td>SM_CXSCREEN, SM_CYSCREEN: Breite und H&ouml;he des Bildschirms vom prim&auml;ren Anzeigemonitor (in Pixel). Diese Werte sind das gleiche wie die internen Variablen <a href="../Variables.htm#Screen">A_ScreenWidth</a> und <a href="../Variables.htm#Screen">A_ScreenHeight</a>. </td>
      </tr>
      <tr>
        <td>78, 79 </td>
        <td>SM_CXVIRTUALSCREEN, SM_CYVIRTUALSCREEN: Breite und H&ouml;he des virtuellen Bildschirms (in Pixel). Der virtuelle Bildschirm ist ist das Begrenzungsrechteck aller Anzeigemonitore. Die Ma&szlig;e von SM_XVIRTUALSCREEN, SM_YVIRTUALSCREEN sind die Koordinaten der oberen linken Ecke des virtuellen Bildschirms. <b>Windows NT, Windows 95: </b>Der abgerufene Wert ist immer 0.</td>
      </tr>
      <tr>
        <td>19</td>
        <td>SM_MOUSEPRESENT: Ungleich 0, wenn eine Maus installiert ist, ansonsten 0.</td>
      </tr>
      <tr>
        <td>75</td>
        <td>SM_MOUSEWHEELPRESENT: Ungleich 0, wenn eine Maus mit Mausrad installiert ist, ansonsten 0. <b>Windows 95: </b>Der abgerufene Wert ist immer 0.</td>
      </tr>
      <tr>
        <td>63</td>
        <td>SM_NETWORK: Ist ein Netzwerk vorhanden, wird das am wenigsten signifikante Bit gesetzt, andernfalls wird es gel&ouml;scht. Die anderen Bits werden f&uuml;r die zuk&uuml;nftige Verwendung reserviert.</td>
      </tr>
      <tr>
        <td>8193</td>
        <td> SM_REMOTECONTROL: Diese Systemma&szlig;e werden in einer Terminaldienstumgebung verwendet. Ungleich 0, wenn die aktuelle Sitzung ferngesteuert wird, ansonsten 0. <b>Windows 2000/NT, Windows Me/98/95: </b>Der abgerufene Wert ist immer 0.</td>
      </tr>
      <tr>
        <td>4096</td>
        <td> SM_REMOTESESSION: Diese Systemma&szlig;e werden in einer Terminaldienstumgebung verwendet. Wenn der aufrufende Prozess mit einer Terminal-Services-Clientsitzung verbunden ist, dann ist der R&uuml;ckgabewert ungleich 0. Wenn der aufrufende Prozess mit einer Terminal-Services-Konsolensitzung verbunden ist, dann ist der R&uuml;ckgabewert 0. Die Konsolensitzung ist nicht unbedingt die physische Konsole. <b>Windows NT 4.0 SP3 und niedriger, Windows Me/98/95: </b>Der abgerufene Wert ist immer 0.</td>
      </tr>
      <tr>
        <td>70</td>
        <td> SM_SHOWSOUNDS: Ungleich 0, wenn der Benutzer w&uuml;nscht, dass eine Anwendung die Informationen visuell zur Verf&uuml;gung stellt, wo sie sonst nur in auditiver Form bereitgestellt w&uuml;rden, ansonsten 0. </td>
      </tr>
      <tr>
        <td>8192</td>
        <td> SM_SHUTTINGDOWN: Ungleich 0, wenn die aktuelle Sitzung heruntergefahren wird, ansonsten 0. <b>Windows 2000/NT, Windows Me/98/95: </b>Der abgerufene Wert ist immer 0.</td>
      </tr>
      <tr>
        <td>23</td>
        <td>SM_SWAPBUTTON: Ungleich 0, wenn die Funktionen f&uuml;r die linke und rechte Maustaste vertauscht sind, ansonsten 0.</td>
      </tr>
      <tr>
        <td>76, 77 </td>
        <td> SM_XVIRTUALSCREEN, SM_YVIRTUALSCREEN: Koordinaten f&uuml;r die linke obere Ecke des virtuellen Bildschirms. Der virtuelle Bildschirm ist ist das Begrenzungsrechteck aller Anzeigemonitore. Die Ma&szlig;e von SM_CXVIRTUALSCREEN, SM_CYVIRTUALSCREEN (weiter oben) sind hingegen die Breite und H&ouml;he des virtuellen Bildschirms. <b>Windows NT, Windows 95: </b>Der abgerufene Wert ist immer 0.</td>
      </tr>
    </table>
    <h3>Selten verwendet</h3>
    <table class="info">
      <tr>
        <th>Nummer</th>
        <th>Beschreibung</th>
      </tr>
      <tr>
        <td>56</td>
        <td>SM_ARRANGE: Mit SM_ARRANGE wird angegeben, wie das System minimierte Fenster anordnet. Siehe MSDN f&uuml;r mehr Informationen.</td>
      </tr>
      <tr>
        <td>67</td>
        <td> SM_CLEANBOOT: Gibt an, wie das System gestartet wurde:<br>
          0 Normales Hochfahren<br>
          1 Sicheres Hochfahren<br>
          2 Sicheres Hochfahren mit Netzwerk</td>
      </tr>
      <tr>
        <td>5, 6 </td>
        <td> SM_CXBORDER, SM_CYBORDER: Die Breite und H&ouml;he einer Fensterbegrenzung (in Pixel). Das ist mit SM_CXEDGE f&uuml;r Fenster im 3D-Look gleichwertig. </td>
      </tr>
      <tr>
        <td>13, 14 </td>
        <td>SM_CXCURSOR, SM_CYCURSOR: Die Breite und H&ouml;he des Mauszeigers (in Pixel). Das System kann keine Mauszeiger in anderen Gr&ouml;&szlig;en erstellen.</td>
      </tr>
      <tr>
        <td>36, 37 </td>
        <td> SM_CXDOUBLECLK, SM_CYDOUBLECLK: Die Breite und H&ouml;he des Rechtecks rund um den Standort des ersten Klicks einer Doppelklick-Sequenz (in Pixel). Der zweite Klick muss f&uuml;r das System innerhalb dieses Rechtecks erfolgen, damit die Klicks als ein Doppelklick betrachtet werden. Die zwei Klicks m&uuml;ssen auch innerhalb einer bestimmten Zeit auftreten.</td>
      </tr>
      <tr>
        <td>68, 69 </td>
        <td>SM_CXDRAG, SM_CYDRAG: Die Breite und H&ouml;he des Rechtecks, mit dessen Hilfe der Beginn einer Ziehen-Operation ermittelt wird. Diese Werte sind in Pixel. Erm&ouml;glicht dem Benutzer die Maustaste einfach zudr&uuml;cken und wieder loszulassen, ohne aus Versehen eine Ziehen-Operation zu beginnen.</td>
      </tr>
      <tr>
        <td>45, 46 </td>
        <td>SM_CXEDGE, SM_CYEDGE: Abmessungen eines 3D-Rahmens (in Pixel). Sie sind die 3D-Gegenst&uuml;cke von SM_CXBORDER und SM_CYBORDER.</td>
      </tr>
      <tr>
        <td>7, 8 </td>
        <td>SM_CXFIXEDFRAME, SM_CYFIXEDFRAME (gleichbedeutend mit SM_CXDLGFRAME, SM_CYDLGFRAME): Rahmendicke eines Fensters, das eine Titelleiste hat aber nicht skalierbar ist (in Pixel). SM_CXFIXEDFRAME ist die H&ouml;he der horizontalen Abgrenzung und SM_CYFIXEDFRAME die Breite der vertikalen Abgrenzung.</td>
      </tr>
      <tr>
        <td>83, 84 </td>
        <td>SM_CXFOCUSBORDER, SM_CYFOCUSBORDER: Breite (in Pixel) vom linken und rechten Rand und die H&ouml;he vom oberen und unteren Rand des Fokusrechtecks eines Steuerelements. <b>Windows 2000/NT, Windows Me/98/95:&nbsp;&nbsp;</b>Der abgerufene Wert ist immer 0.</td>
      </tr>
      <tr>
        <td>21, 3 </td>
        <td>SM_CXHSCROLL, SM_CYHSCROLL: Die Breite des Pfeil-Bitmaps auf einer horizontalen Bildlaufleiste und die H&ouml;he einer horizontalen Bildlaufleiste (in Pixel).</td>
      </tr>
      <tr>
        <td>10</td>
        <td>SM_CXHTHUMB: Die Breite der Positionsanzeige auf einer horizontale Bildlaufleiste (in Pixel).</td>
      </tr>
      <tr>
        <td>11, 12 </td>
        <td>SM_CXICON, SM_CYICON: Standard-Breite und -H&ouml;he eines Icons (in Pixel).</td>
      </tr>
      <tr>
        <td>38, 39 </td>
        <td>SM_CXICONSPACING, SM_CYICONSPACING: Die Abmessungen einer Gitterzelle f&uuml;r Elemente in der Ansicht f&uuml;r gro&szlig;e Symbole (in Pixel). Jedes Element passt in ein Rechteck dieser Gr&ouml;&szlig;e, wenn angeordnet. Diese Werte sind immer gr&ouml;&szlig;er oder gleich SM_CXICON bzw. SM_CYICON.</td>
      </tr>
      <tr>
        <td>71, 72 </td>
        <td>SM_CXMENUCHECK, SM_CYMENUCHECK: Die Abmessungen der Markierungs-Bitmap im Standardmen&uuml; (in Pixel).</td>
      </tr>
      <tr>
        <td>54, 55 </td>
        <td>SM_CXMENUSIZE, SM_CYMENUSIZE: Die Abmessungen der Schaltfl&auml;chen in der Men&uuml;leiste, wie z. B. die Schlie&szlig;en-Schaltfl&auml;che eines anh&auml;ngenden Fensters in einem Multiple Document Interface (in Pixel).</td>
      </tr>
      <tr>
        <td>47, 48 </td>
        <td>SM_CXMINSPACING SM_CYMINSPACING: Die Abmessungen einer Gitterzelle f&uuml;r f&uuml;r minimierte Fenster (in Pixel). Jedes minimierte Fenster passt in ein Rechteck dieser Gr&ouml;&szlig;e, wenn angeordnet. Diese Werte sind immer gr&ouml;&szlig;er oder gleich SM_CXMINIMIZED bzw. SM_CYMINIMIZED.</td>
      </tr>
      <tr>
        <td>30, 31 </td>
        <td>SM_CXSIZE, SM_CYSIZE: Die Breite und H&ouml;he der Schaltfl&auml;chen in der Titelleiste (in Pixel).</td>
      </tr>
      <tr>
        <td>32, 33 </td>
        <td>SM_CXSIZEFRAME, SM_CYSIZEFRAME: Rahmendicke eines Fensters, das skalierbar ist (in Pixel). SM_CXSIZEFRAME ist die Breite der horizontalen Abgrenzung und SM_CYSIZEFRAME die H&ouml;he der vertikalen Abgrenzung. Gleichbedeutend mit SM_CXFRAME und SM_CYFRAME.</td>
      </tr>
      <tr>
        <td>49, 50 </td>
        <td>SM_CXSMICON, SM_CYSMICON: Empfohlene Abmessungen eines kleinen Icons (in Pixel). Kleine Icons werden normalerweise in der Titelleiste und in der Ansicht f&uuml;r kleine Icons angezeigt.</td>
      </tr>
      <tr>
        <td>52, 53 </td>
        <td>SM_CXSMSIZE, SM_CYSMSIZE: Abmessungen der Schaltfl&auml;chen in der kleinen Titelleiste (in Pixel).</td>
      </tr>
      <tr>
        <td>2, 20 </td>
        <td>SM_CXVSCROLL, SM_CYVSCROLL: Die Breite einer vertikalen Bildlaufleiste und die H&ouml;he des Pfeil-Bitmaps auf einer horizontalen Bildlaufleiste (in Pixel).</td>
      </tr>
      <tr>
        <td>4</td>
        <td>SM_CYCAPTION: Die H&ouml;he einer normalen Titelleiste (in Pixel).</td>
      </tr>
      <tr>
        <td>18</td>
        <td>SM_CYKANJIWINDOW: F&uuml;r Windows-Versionen mit Doppel-Byte-Zeichensatz (DBCS) ist dies die H&ouml;he des Kanji-Fensters unten auf dem Bildschirm.</td>
      </tr>
      <tr>
        <td>15</td>
        <td>SM_CYMENU: Die H&ouml;he einer einzeiligen Men&uuml;leiste (in Pixel).</td>
      </tr>
      <tr>
        <td>51</td>
        <td>SM_CYSMCAPTION: Die H&ouml;he einer kleinen Titelleiste (in Pixel).</td>
      </tr>
      <tr>
        <td>9</td>
        <td>SM_CYVTHUMB: Die H&ouml;he der Positionsanzeige auf einer vertikalen Bildlaufleiste (in Pixel).</td>
      </tr>
      <tr>
        <td>42</td>
        <td> SM_DBCSENABLED: Ungleich 0, wenn User32.dll DBCS unterst&uuml;tzt, ansonsten 0. <b>Windows&nbsp;Me/98/95:&nbsp;&nbsp;</b>Ungleich 0, wenn die Version mit dem Doppel-Byte-Zeichensatz (DBCS) von User.exe installiert ist, ansonsten 0.</td>
      </tr>
      <tr>
        <td>22</td>
        <td>SM_DEBUG: Ungleich 0, wenn die Debugging-Version von User.exe installiert ist, ansonsten 0.</td>
      </tr>
      <tr>
        <td>82</td>
        <td> SM_IMMENABLED: Ungleich 0, wenn die Funktionen vom Input Method Manager (IMM) / Input Method Editor (IME) aktiviert sind, ansonsten 0. <b>Windows&nbsp;NT, Windows&nbsp;Me/98/95:&nbsp;&nbsp;</b>Der abgerufene Wert ist immer 0.
          <p>SM_IMMENABLED zeigt an, ob das System bereit ist, einen unicode-basierten IME auf eine Unicode-Anwendung anzuwenden. Um sicherzustellen, dass ein sprachabh&auml;ngiger IME funktioniert, &uuml;berpr&uuml;ft SM_DBCSENABLED und den ANSI-Zeichensatz des Systems. Andernfalls kann die ANSI-zu-Unicode-Konvertierung nicht richtig ausgef&uuml;hrt werden, oder einige Komponenten wie Schriftarten oder Registrierungseinstellungen sind nicht vorhanden. </p></td>
      </tr>
      <tr>
        <td>87</td>
        <td>SM_MEDIACENTER: Ungleich 0, wenn das aktuelle Betriebssystem die Windows XP Media Center Edition ist, ansonsten 0.</td>
      </tr>
      <tr>
        <td>40</td>
        <td>SM_MENUDROPALIGNMENT: Ungleich 0, wenn ausklappbare Men&uuml;s mit den entsprechenden Men&uuml;punkten rechts ausgerichtet sind, ansonsten 0.</td>
      </tr>
      <tr>
        <td>74</td>
        <td>SM_MIDEASTENABLED: Ungleich 0, wenn die Sprachen Hebr&auml;isch und Arabisch im System aktiviert sind, ansonsten 0.</td>
      </tr>
      <tr>
        <td>41</td>
        <td>SM_PENWINDOWS: Ungleich 0, wenn Microsoft Windows f&uuml;r Pen-Programmier-Erweiterungen installiert ist, ansonsten 0.</td>
      </tr>
      <tr>
        <td>44</td>
        <td>SM_SECURE: Ungleich 0, wenn Sicherheitsfunktionen eingeschaltet sind, ansonsten 0.</td>
      </tr>
      <tr>
        <td>81</td>
        <td>SM_SAMEDISPLAYFORMAT: Ungleich 0, wenn alle Anzeigemonitore das gleiche Farbformat haben, ansonsten 0. Beachtet, dass zwei Anzeigemonitore die gleiche Farbtiefe haben k&ouml;nnen, aber unterschiedliche Farbformate. Zum Beispiel k&ouml;nnen die roten, gr&uuml;nen und blauen Pixel mit unterschiedlicher Anzahl von Bits kodiert werden, oder solche Bits k&ouml;nnen an verschiedenen Orten in einem Pixelfarbwert gefunden werden. <b>Windows NT, Windows 95:&nbsp;&nbsp;</b>Der abgerufene Wert ist immer 0.</td>
      </tr>
      <tr>
        <td>73</td>
        <td>SM_SLOWMACHINE: Immer 0 in Windows NT/2000/XP oder h&ouml;her. Ungleich 0 in Windows 95/98/ME, wenn der Computer mindestens eine folgende Eigenschaft hat: einen 386-Prozessor, weniger als 6MB RAM oder eine Grafikkarte, die scheinbar langsam ist.</td>
      </tr>
      <tr>
        <td>86</td>
        <td>SM_TABLETPC: Ungleich 0, wenn das aktuelle Betriebssystem die Windows XP Tablet PC Edition ist, ansonsten 0.</td>
      </tr>
    </table>
    <h3>Bemerkungen</h3>
    <p>Die internen Variablen <a href="../Variables.htm#Screen">A_ScreenWidth</a> und <a href="../Variables.htm#Screen">A_ScreenHeight</a> enthalten die Abmessungen des prim&auml;ren Monitors (in Pixel).</p>
    <h3>Verwandte Befehle</h3>
    <p><a href="DllCall.htm">DllCall</a>, <a href="WinGet.htm">WinGet</a></p>
    <h3>Beispiele</h3>
    <pre class="NoIndent"><em>; Beispiel #1:</em>
SysGet, Maustastenanzahl, 43
SysGet, VirtuelleBildschirmbreite, 78
SysGet, VirtuelleBildschirmh&ouml;he, 79

<em>; Beispiel #2: Das ist ein funktionierendes Script, das Informationen &uuml;ber jeden Monitor anzeigt:</em>
SysGet, Monitorenanzahl, MonitorCount
SysGet, MonitorPrim&auml;r, MonitorPrimary
MsgBox, Monitorenanzahl:`t%Monitorenanzahl%`nPrim&auml;rer Monitor:`t%MonitorPrim&auml;r%
Loop, %Monitorenanzahl%
{
    SysGet, Monitorname, MonitorName, %A_Index%
    SysGet, Monitor, Monitor, %A_Index%
    SysGet, MonitorArbeitsbereich, MonitorWorkArea, %A_Index%
    MsgBox, Monitor:`t#%A_Index%`nName:`t%Monitorname%`nLinks:`t%MonitorLeft% (%MonitorArbeitsbereichLeft% work)`nOben:`t%MonitorTop% (%MonitorArbeitsbereichTop% work)`nRechts:`t%MonitorRight% (%MonitorArbeitsbereichRight% work)`nUnten:`t%MonitorBottom% (%MonitorArbeitsbereichBottom% work)
}</pre>
  </article>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>