<!DOCTYPE HTML>
<html>
<head>
<title>TrayTip</title>
<meta name="keywords" content="Befehl, Grafische Benutzeroberfl&auml;che">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <article>
      <h1>TrayTip</h1>
      <p>Erstellt eine Sprechblase in der N&auml;he des Tray-Icons. Ben&ouml;tigt Windows 2000/XP oder h&ouml;her.</p>
      <pre class="Syntax">TrayTip [, Titel, Text, Sekunden, Optionen]</pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td>Titel</td>
          <td><p>Sind keine Parameter vorhanden, werden alle derzeit angezeigten TrayTip-Fenster entfernt.</p>
            <p>Andernfalls ist dieser Parameter der Fenstertitel, der bis zu 73 Zeichen lang sein kann (alle Zeichen danach werden nicht angezeigt).</p>
            <p>Falls <em>Titel</em> leer ist, wird die Titelzeile des TrayTip-Fensters komplett weggelassen, indem es vertikal gek&uuml;rzt wird.</p></td>
        </tr>
        <tr>
          <td style="width: 15%;">Text</td>
          <td style="width: 85%;"><p>Ist dieser Parameter leer oder nicht vorhanden, werden alle derzeit angezeigten TrayTip-Fenster entfernt.</p>
            <p>Andernfalls kann eine Nachricht angegeben werden, die unter dem <em>Titel</em> angezeigt wird. Es werden nur die ersten 265 Zeichen vom <em>Text</em> angezeigt. Die Zeilenumbruchszeichen CR (`r) oder LF (` n) k&ouml;nnen verwendet werden, um mehrere Textzeilen zu erstellen. Zum Beispiel: Zeile1`nZeile2</p>
            <p>Falls der <em>Text</em> zu lang ist, kann er in mehreren kurzen Zeilen aufgeteilt werden (<a href="../Scripts.htm#continuation">Fortsetzungsbereich</a>), um die Lesbarkeit und Wartbarkeit zu verbessern.</p></td>
        </tr>
        <tr>
          <td style="width: 15%;">Sekunden</td>
          <td style="width: 85%;"><p>Die ungef&auml;hre Anzahl an Sekunden, wie lange das Fenster angezeigt werden soll, bevor es danach wieder vom Betriebssystem entfernt wird. Die Angabe einer Zahl kleiner als 10 oder gr&ouml;&szlig;er als 30 bewirkt, dass stattdessen die minimale (10) oder maximale (30) Anzeigedauer verwendet wird. Ist dieser Parameter leer oder nicht vorhanden, wird &uuml;blicherweise die minimale Zeit verwendet. Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein.</p>
            <p>Die tats&auml;chliche Zeit&uuml;berschreitung weicht von dem ab, was angegeben wurde. Eine Erkl&auml;rung von Microsoft: "Wenn der Benutzer keine Aktionen auf dem Computer ausf&uuml;hrt, ber&uuml;cksichtigt das System diese Zeit bei der Berechnung des Timeouts nicht." (technische Details <a href="http://msdn.microsoft.com/library/default.asp?url=/library/en-us/shellcc/platform/shell/reference/structures/notifyicondata.asp">hier</a>). Zur genauen Bestimmung der Anzeigedauer des TrayTip-Fensters kann der <a href="Sleep.htm">Sleep</a>-Befehl, gefolgt von TrayTip ohne Parameter, verwendet werden, oder <a href="SetTimer.htm">SetTimer</a>, wie im unteren Beispielabschnitt gezeigt.</p></td>
        </tr>
        <tr>
          <td>Optionen</td>
          <td><p>Es ist m&ouml;glich, ein kleines Icon links neben dem <em>Titel</em> anzuzeigen, sobald eine der folgenden Zahlen angegeben wird:</p>
            <p>1: Info-Icon<br>
              2: Warnung-Icon<br>
              3: Fehler-Icon</p>
            <p>Ist dieser Parameter nicht vorhanden, gilt standardm&auml;&szlig;ig eine 0 (kein Icon). Dieser Parameter kann ein <a href="../Variables.htm#Expressions">Ausdruck</a> sein.<br>
            </p></td>
        </tr>
      </table>
      <h3>Bemerkungen</h3>
      <p>TrayTip ben&ouml;tigt Windows 2000/XP oder h&ouml;her. In Windows 9x/NT funktioniert dieser Befehl nicht.</p>
      <p>Besitzt das Script kein Tray-Icon (durch <a href="_NoTrayIcon.htm">#NoTrayIcon</a> oder <code><a href="Menu.htm">Menu</a>, Tray, NoIcon</code>), kann das TrayTip-Fenster nicht angezeigt werden. Au&szlig;erdem wird TrayTip nicht funktionieren, wenn der folgende REG_DWORD-Wert vorhanden und auf 0 gesetzt ist:<br>
        HKCU\Software\Microsoft\Windows\CurrentVersion\Explorer\Advanced &gt;&gt; EnableBalloonTips</p>
      <p>Das Betriebssystem spielt &uuml;blicherweise einen Sound ab, sobald das TrayTip-Fenster angezeigt wird. Dieser Sound kann deaktiviert werden, indem eine 16 mit dem <em>Optionen</em>-Parameter addiert wird (z. B.: 16 - kein Sound, kein Icon; 17 - kein Sound, aber Info-Icon; und so weiter)</p>
      <p>Beachte zudem, dass ein ToolTip angezeigt wird, sobald sich der Mauszeiger &uuml;ber das Tray-Icon des Scripts befindet. Der Inhalt des Tooltips kann wie folgt ge&auml;ndert werden: <code><a href="Menu.htm">Menu</a>, Tray, Tip, Neuer Text</code>.</p>
      <h3>Verwandte Befehle</h3>
      <p><a href="ToolTip.htm">ToolTip</a>, <a href="SetTimer.htm">SetTimer</a>, <a href="Menu.htm">Menu</a>, <a href="SplashTextOn.htm">SplashTextOn</a>, <a href="MsgBox.htm">MsgBox</a>, <a href="InputBox.htm">InputBox</a>, <a href="FileSelectFile.htm">FileSelectFile</a>, <a href="FileSelectFolder.htm">FileSelectFolder</a></p>
      <h3>Beispiele</h3>
      <pre class="NoIndent">TrayTip, Eigener Titel, Mehrzeiliger`nText, 20, 17

<em>; Bietet die M&ouml;glichkeit, die Anzeigedauer genauer zu bestimmen,
; ohne dabei Sleep zu verwenden (das den aktuellen Thread stoppen w&uuml;rde):</em>
#Persistent
TrayTip, Zeitlich festgelegter TrayTip, Wird f&uuml;r 5 Sekunden angezeigt.
SetTimer, TrayTipEntfernen, 5000
Return

TrayTipEntfernen:
SetTimer, TrayTipEntfernen, Off
TrayTip
Return

<em>; Damit ein TrayTip dauerhaft angezeigt wird, kann ein Timer verwendet werden, der diesen regelm&auml;&szlig;ig aktualisiert:</em>
SetTimer, TrayTipAktualisieren, 1000
Gosub, TrayTipAktualisieren <em>; Einmal aufrufen, um es sofort zu starten.</em>
Return

TrayTipAktualisieren:
TrayTip, Aktualisierter TrayTip, Das ist ein dauerhaft angezeigter TrayTip., , 16
Return</pre>
    </article>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>