<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>WinMove</title>
<meta name="keywords" content="Befehl, Fenster">
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../../NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(2);</script>


<h1>WinMove</h1>

<p>Ver&auml;ndert die Position und/oder Gr&ouml;&szlig;e des angegebenen Fensters.</p>

<pre class="Syntax">WinMove, X, Y
WinMove, Fenstertitel, Fenstertext, X, Y [, Breite, H&ouml;he, Titelausnahme, Textausnahme]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">X, Y</td>
    <td width="85%"><p>Die Koordinaten X und Y der oberen linken Ecke der neuen Position vom Zielfenster, die <a href="../Variables.htm#Expressions">Ausdr&uuml;cke</a> sein k&ouml;nnen. Das obere linke Pixel des Bildschirms befindet sich auf 0, 0.</p>
    <p>Wenn nur diese Parameter angegeben werden, dann wird das <a href="../LastFoundWindow.htm">zuletzt gefundene Fenster</a> als Zielfenster verwendet.</p>
    <p>Ansonsten kann X und/oder Y weggelassen werden, um die aktuelle Position zu verwenden.</p></td>
  </tr>
  <tr>
    <td>Fenstertitel</td>
    <td>Der Titel oder Teiltitel des Fensters (das &Uuml;bereinstimmungsverhalten wird mit <a href="SetTitleMatchMode.htm">SetTitleMatchMode</a> bestimmt). Wenn dieser und die anderen 3 Fensterparameter weggelassen werden, wird das <a href="../LastFoundWindow.htm">zuletzt gefundene Fenster</a> verwendet. Sobald dieser den Buchstaben A enth&auml;lt und die anderen 3 Fensterparameter weggelassen werden, wird das aktive Fenster verwendet. Bei Verwendung einer Fensterklasse muss ahk_class ExakterKlassenname angegeben werden (wird von Windows Spy angezeigt). Bei Verwendung einer <a href="Process.htm">Prozess-Kennung (PID)</a> muss ahk_pid %VariableMitPID% angegeben werden. Bei Verwendung einer <a href="GroupAdd.htm">Fenstergruppe</a> muss ahk_group Gruppenname angegeben werden. Bei Verwendung einer <a href="WinGet.htm">eindeutigen ID-Nummer</a> eines Fensters muss ahk_id %VariableMitID% angegeben werden. Die Suche kann durch Angabe <a href="../LastFoundWindow.htm#multi">mehrerer Kriterien</a> eingeschr&auml;nkt werden. Zum Beispiel: <em>Eigene Datei.txt ahk_class Notepad</em></td>
  </tr>
  <tr>
    <td>Fenstertext</td>
    <td>In diesem Parameter kann ein Teilstring angegeben werden, der in einem Textelement des Zielfensters vorkommt (werden mit Windows Spy angezeigt). Versteckte Textelemente werden auch erkannt, sofern <a href="DetectHiddenText.htm">DetectHiddenText</a> aktiv ist.</td>
  </tr>
  <tr>
    <td>Breite, H&ouml;he</td>
    <td>Die neue Breite und H&ouml;he des Fensters (in Pixel), die <a href="../Variables.htm#Expressions">Ausdr&uuml;cke</a> sein k&ouml;nnen. Wenn einer der Parameter leer ist, weggelassen wird oder das Wort DEFAULT enth&auml;lt, dann wird die Gr&ouml;&szlig;e in dieser Abmessung nicht ver&auml;ndert.</td>
  </tr>
  <tr>
    <td>Titelausnahme</td>
    <td>Ignoriert Fenster, deren Titel diesen Wert enthalten.</td>
  </tr>
  <tr>
    <td>Textausnahme</td>
    <td>Ignoriert Fenster, deren Textelemente diesen Wert enthalten.</td>
  </tr>
</table>

<h3>Bemerkungen</h3>
<p>Wenn die <em>Breite</em> und <em>H&ouml;he</em> klein ist (oder negativ), dann sind die meisten Fenster mit einer Titelleiste in der Regel nicht kleiner als 112 x 27 Pixel (jedoch haben einige Fensterarten verschiedene Mindestgr&ouml;&szlig;en). Wenn die <em>Breite</em> und <em>H&ouml;he</em> gro&szlig; ist, dann &uuml;berschreiten die meisten Fenster die Desktop-Abmessungen nicht mehr als ca. 12 Pixel.</p>
<p>Negative Werte sind f&uuml;r die Koordinaten X und Y erlaubt, um Systeme mit mehreren Monitoren zu unterst&uuml;tzen und ein Fenster au&szlig;erhalb des Bildschirms zu verschieben.</p>
<p>Obwohl WinMove minimierte Fenster nicht verschieben kann, k&ouml;nnen jedoch versteckte Fenster verschoben werden, wenn <a href="DetectHiddenWindows.htm">DetectHiddenWindows</a> aktiv ist.</p>
<p>Die Geschwindigkeit von WinMove wird von <a href="SetWinDelay.htm">SetWinDelay</a> beeinflusst.</p>
<p>Fenstertitel und -texte sind von der Gro&szlig;- und Kleinschreibung abh&auml;ngig. Solange <a href="DetectHiddenWindows.htm">DetectHiddenWindows</a> deaktiviert ist, werden versteckte Fenster nicht wahrgenommen.</p>
<h3>Verwandte Befehle</h3>
<p><a href="ControlMove.htm">ControlMove</a>, <a href="WinGetPos.htm">WinGetPos</a>, <a href="WinHide.htm">WinHide</a>, <a href="WinMinimize.htm">WinMinimize</a>, <a href="WinMaximize.htm">WinMaximize</a>, <a href="WinSet.htm">WinSet</a></p>
<h3>Beispiel</h3>
<pre class="NoIndent">Run, calc.exe
WinWait, Rechner
WinMove, 0, 0 <em>; Verschiebt das zuletzt gefundene Fenster in die obere linke Ecke des Bildschirms.</em>

SplashTextOn, 400, 300, Zwischenablage, Die Zwischenablage enth&auml;lt:`n%clipboard%
WinMove, Zwischenablage, , 0, 0 <em>; Verschiebt das Splash-Fenster in die linke obere Ecke. </em>
Msgbox, OK dr&uuml;cken, damit der SplashText verschwindet.
SplashTextOff

<em>; Die folgende <a href="../Functions.htm">Funktion</a> zentriert das angegebene Fenster auf dem Bildschirm:</em>
FensterZentrieren(Fenstertitel)
{
    WinGetPos,,, Breite, H&ouml;he, %Fenstertitel%
    WinMove, %Fenstertitel%,, (A_ScreenWidth/2)-(Breite/2), (A_ScreenHeight/2)-(H&ouml;he/2)
}</pre>

</body>
</html>