<!DOCTYPE HTML>
<html>
<head>
<title>WinMenuSelectItem</title>
<meta name="keywords" content="Befehl, Fenster, Steuerelement">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <article>
      <h1>WinMenuSelectItem</h1>
      <p>Ruft einen Men&uuml;punkt in der Men&uuml;leiste des angegebenen Fensters auf.</p>
      <pre class="Syntax">WinMenuSelectItem, Fenstertitel, Fenstertext, Men&uuml; [, Untermen&uuml;1, Untermen&uuml;2, Untermen&uuml;3, Untermen&uuml;4, Untermen&uuml;5, Untermen&uuml;6, Titelausnahme, Textausnahme] </pre>
      <h3>Parameter</h3>
      <table class="info">
        <tr>
          <td style="width: 15%;">Fenstertitel</td>
          <td style="width: 85%;">Ein Fenstertitel oder sonstige Kriterien, die das Zielfenster ermitteln sollen. Siehe <a href="../misc/WinTitle.htm">Fenstertitel</a>.</td>
        </tr>
        <tr>
          <td>Fenstertext</td>
          <td>In diesem Parameter kann ein Teilstring angegeben werden, der in einem Textelement des Zielfensters vorkommt (werden mit Windows Spy angezeigt). Versteckte Textelemente werden auch erkannt, sofern <a href="DetectHiddenText.htm">DetectHiddenText</a> aktiv ist.</td>
        </tr>
        <tr>
          <td>Men&uuml;</td>
          <td>Name des Men&uuml;s auf h&ouml;chster Ebene, z. B. Datei, Bearbeiten, Ansicht. Es ist auch m&ouml;glich, die Position des gew&uuml;nschten Men&uuml;punkts anzugeben, indem 1& f&uuml;r das erste Men&uuml; verwendet wird, 2& f&uuml;r das zweite Men&uuml; und so weiter. </td>
        </tr>
        <tr>
          <td>Untermen&uuml;1</td>
          <td>Name des Men&uuml;punkts, das ausgew&auml;hlt werden soll, oder dessen Position (siehe oben).</td>
        </tr>
        <tr>
          <td>Untermen&uuml;2</td>
          <td>Falls <em>Untermen&uuml;1</em> selbst ein Men&uuml; enth&auml;lt, ist dieser Parameter der Name des darin befindlichen Men&uuml;punkts, oder dessen Position.</td>
        </tr>
        <tr>
          <td>Untermen&uuml;3</td>
          <td>Wie oben. </td>
        </tr>
        <tr>
          <td>Untermen&uuml;4</td>
          <td>Wie oben.</td>
        </tr>
        <tr>
          <td>Untermen&uuml;5</td>
          <td>Wie oben.</td>
        </tr>
        <tr>
          <td>Untermen&uuml;6</td>
          <td>Wie oben.</td>
        </tr>
        <tr>
          <td>Titelausnahme</td>
          <td>Ignoriert Fenster, deren Titel diesen Wert enthalten.</td>
        </tr>
        <tr>
          <td>Textausnahme</td>
          <td>Ignoriert Fenster, deren Textelemente diesen Wert enthalten.</td>
        </tr>
      </table>
      <h3>ErrorLevel</h3>
      <p><span class="ver">[v1.1.04+]</span> Dieser Befehl ist in der Lage, bei Misserfolg eine Ausnahme auszul&ouml;sen. F&uuml;r mehr Informationen, siehe <a href="Catch.htm#RuntimeErrors">Laufzeitfehler</a>.</p>
      <p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird bei Misserfolg auf 1 und bei Erfolg auf 0 gesetzt.</p>
      <h3>Bemerkungen</h3>
      <p>Dieser Befehl funktioniert auch, wenn das Zielfenster nicht aktiv ist. Allerdings m&uuml;ssen sich einige Fenster m&ouml;glicherweise in einem <a href="WinRestore.htm">nicht minimierten</a> Zustand befinden.</p>
      <p>Dieser Befehl wird <strong>nicht funktionieren</strong>, wenn die Anwendungen untypische Men&uuml;leisten verwenden, wie z. B. Microsoft Outlook und Outlook Express, die versteckte Werkzeugleisten als Men&uuml;leisten haben. In solchen F&auml;llen kann <a href="ControlSend.htm">ControlSend</a> oder <a href="PostMessage.htm">PostMessage</a> verwendet werden, die in der Lage sein sollten, mit einigen von diesen untypischen Men&uuml;leisten umzugehen.</p>
      <p>Die Men&uuml;namen unterscheiden nicht zwischen Gro&szlig;- und Kleinschreibung (z. B. ist Datei->Speichern das gleiche wie datei->speichern). Au&szlig;erdem ist es nicht notwendig, ein Und-Zeichen (&amp;) zu verwenden, um den unterstrichenen Buchstaben in einem Men&uuml;punkt zu kennzeichnen (z. B. ist &amp;Datei das gleiche wie Datei).</p>
      <p>In den Men&uuml;-Parametern k&ouml;nnen auch Positionen angegeben werden. Diese Methode dient dazu, Men&uuml;s zu unterst&uuml;tzen, die keinen Text enthalten (weil sie vielleicht stattdessen nur Textabbildungen enthalten). Position 1& ist der erste Men&uuml;punkt (z. B. das Datei-Men&uuml;), Position 2& ist der zweite Men&uuml;punkt (z. B. das Bearbeiten-Men&uuml;), und so weiter. Men&uuml;-Trennlinien z&auml;hlen als Men&uuml;punkte zwecks Positionserkennung eines Men&uuml;punkts.</p>
      <p>Fenstertitel und -texte unterscheiden zwischen Gro&szlig;- und Kleinschreibung. Solange <a href="DetectHiddenWindows.htm">DetectHiddenWindows</a> deaktiviert ist, werden versteckte Fenster nicht wahrgenommen.</p>
      <h3>Verwandte Befehle</h3>
      <p><a href="ControlSend.htm">ControlSend</a>, <a href="PostMessage.htm">PostMessage</a></p>
      <h3>Beispiel</h3>
      <pre class="NoIndent"><em>; W&auml;hlt Datei->&Ouml;ffnen im Editor aus:</em>
WinMenuSelectItem, Unbenannt - Editor, , Datei, &Ouml;ffnen

<em>; Wie oben, nur mit Positionsangabe:</em>
WinMenuSelectItem, Unbenannt - Editor, , 1&amp;, 2&amp;</pre>
    </article>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>