<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN"
"http://www.w3.org/TR/html4/loose.dtd">
<html>
<head>
<title>WinSet</title>
<meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
<link href="../css/default.css" rel="stylesheet" type="text/css">
<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-28224374-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>
</head>
<body>
<script src="../../NavScript.js" language="JavaScript1.2" type="text/javascript"></script>
<script language="JavaScript1.2" type="text/javascript">WriteNavLink(2);</script>


<h1>WinSet</h1>

<p>Erm&ouml;glicht eine Vielzahl von Ver&auml;nderungen des angegebenen Fensters, wie z. B. "immer im Vordergrund" und Transparenz.</p>

<pre class="Syntax">WinSet, Attribut, Wert [, Fenstertitel, Fenstertext, Titelausnahme, Textausnahme]</pre>
<h3>Parameter</h3>
<table class="info">
  <tr>
    <td width="15%">Attribut, Wert</td>
    <td width="85%">Siehe untere Liste.</td>
  </tr>
  <tr>
    <td>Fenstertitel</td>
    <td>Der Titel oder Teiltitel des Fensters (das &Uuml;bereinstimmungsverhalten wird mit <a href="SetTitleMatchMode.htm">SetTitleMatchMode</a> bestimmt). Wenn dieser und die n&auml;chsten 3 Parameter nicht vorhanden sind, dann wird das <a href="../LastFoundWindow.htm">zuletzt gefundene Fenster</a> verwendet. Wenn dieser den Buchstaben A enth&auml;lt und die n&auml;chsten 3 Parameter nicht vorhanden sind, dann wird das aktive Fenster verwendet. Bei Verwendung einer Fensterklasse muss ahk_class ExakterKlassenname angegeben werden (wird von Windows Spy angezeigt). Bei Verwendung einer <a href="Process.htm">Prozess-Kennung (PID)</a> muss ahk_pid %VariableMitPID% angegeben werden. Bei Verwendung einer <a href="GroupAdd.htm">Fenstergruppe</a> muss ahk_group Gruppenname angegeben werden. Bei Verwendung einer <a href="WinGet.htm">eindeutigen ID-Nummer</a> eines Fensters muss ahk_id %VariableMitID% angegeben werden. Die Suche kann durch Angabe <a href="../LastFoundWindow.htm#multi">mehrerer Kriterien</a> eingeschr&auml;nkt werden. Zum Beispiel: <em>Eigene Datei.txt ahk_class Notepad</em></td>
  </tr>
  <tr>
    <td>Fenstertext</td>
    <td>Wenn vorhanden, dann muss dieser Parameter einen Teil der einzelnen Textelemente des Fensters enthalten (wird von Windows Spy angezeigt). Versteckte Textelemente werden erfasst, wenn <a href="DetectHiddenText.htm">DetectHiddenText</a> aktiv ist.</td>
  </tr>
  <tr>
    <td>Titelausnahme</td>
    <td>Fenstertitel mit diesem Wert werden nicht ber&uuml;cksichtigt.</td>
  </tr>
  <tr>
    <td>Textausnahme</td>
    <td>Fenstertexte mit diesem Wert werden nicht ber&uuml;cksichtigt.</td>
  </tr>
</table>

<h3>Attribut, Wert</h3>
<p><strong><a name="AlwaysOnTop" id="AlwaysOnTop"></a>AlwaysOnTop</strong>, <strong>[On|Off|Toggle]</strong>: Erm&ouml;glicht einem Fenster, immer im Vordergrund zu sein. Mit ON wird die Einstellung aktiviert, mit OFF deaktiviert oder mit TOGGLE jeweils auf dem entgegengesetzten Zustand gesetzt. Wenn nicht vorhanden, dann standardm&auml;&szlig;ig TOGGLE. Das Wort Topmost kann anstelle von AlwaysOnTop verwendet werden.</p>
<p><strong>Bottom</strong>: Sendet das Fenster ans untere Ende des Stapels, also unter alle anderen Fenstern. Der Effekt ist mit dem Dr&uuml;cken von Alt+Escape vergleichbar. Zum Beispiel: WinSet, Bottom,, Fenstertitel</p>
<p><strong>Top</strong>: Sendet das Fenster ans obere Ende des Stapels, ohne es direkt zu <a href="WinActivate.htm">aktivieren</a>. Allerdings wird es durch die Standardeinstellungen vom System wahrscheinlich in meisten F&auml;llen doch aktiviert. Dar&uuml;ber hinaus ist dieser Befehl m&ouml;glicherweise unwirksam, weil das System den Benutzer vor Anwendungen sch&uuml;tzt, die den Fokus versuchsweise stehlen wollen (abh&auml;ngig von den Faktoren, welches Fenster zurzeit aktiv ist und was der Benutzer gerade macht). Aktiviert f&uuml;r das Fenster kurz <a href="#AlwaysOnTop">AlwaysOnTop</a> und deaktiviert AlwaysOnTop wieder, um dieses Problem zu umgehen.</p>
<p><strong>Disable</strong> oder <strong>Enable</strong>: Aktiviert oder deaktiviert jeweils ein Fenster. Wenn ein Fenster deaktiviert ist, dann kann der Benutzer es nicht verschieben oder mit dem Steuerelement interagieren. Dar&uuml;ber hinaus werden deaktivierte Fenster in der Alt-Tab-Liste weggelassen.</p>
<p><strong><a name="Redraw"></a>Redraw</strong>: Versucht, die Darstellung/Inhalte eines Fenster zu aktualisieren, indem das Betriebssystem informiert wird, dass das Fensterrechteck eine Neuzeichnung ben&ouml;tigt. Wenn diese Methode nicht f&uuml;r ein bestimmtes Fenster funktioniert, dann versucht <a href="WinMove.htm">WinMove</a>. Wenn das auch nicht funktioniert, versucht Folgendes:<br> <a href="WinHide.htm">WinHide</a>, Fenstertitel<br> <a href="WinShow.htm">WinShow</a>, Fenstertitel</p>
<p><strong><br> Style, N </strong> <u>oder</u> <strong>ExStyle, N</strong>: Ver&auml;ndert jeweils den Style oder Extended Style eines Fensters. Wenn das erste Zeichen in <strong>N</strong> ein Plus- oder Minuszeichen ist, dann wird der Style in <strong>N</strong> jeweils hinzugef&uuml;gt bzw. entfernt. Wenn das erste Zeichen in <B>N</B> ein Zirkumflex (^) ist, dann wird der Style jeweils auf den entgegengesetzten Zustand gesetzt. Wenn das erste Zeichen eine Ziffer ist, dann wird der Style des Fensters komplett mit <strong>N</strong> &uuml;berschrieben.</p>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird bei Misserfolg auf 1 und bei Erfolg auf 0 gesetzt. Ein Fehler tritt auf, wenn das Zielfenster nicht gefunden wird oder der Style nicht angewendet werden darf (was &ouml;fters in Windows 9x passiert).</p>
<p>Wenn bestimmte Styles angewendet werden, die dass Fenster wieder sichtbar machen, dann ist es m&ouml;glicherweise notwendig, das Fenster mit <em>WinSet Redraw</em> neu zu zeichnen (siehe unten). Au&szlig;erdem bietet die <a href="../misc/Styles.htm">Style-Tabelle</a> noch weitere Style-Nummern. Beispiele:</p>
<pre>WinSet, Style, -0xC00000, A  <em>; Entfernt die Titelleiste des aktiven Fensters (WS_CAPTION).</em>
WinSet, ExStyle, ^0x80, Fenstertitel  <em>; Schaltet das WS_EX_TOOLWINDOW-Attribut um, um das Fenster in der Alt-Tab-Liste hinzuzuf&uuml;gen/zu entfernen.</em></pre>
<h3 id="region">WinSet, Region [, Optionen, Fenstertitel, ...]</h3>
<p>&Auml;ndert die Fensterform auf das angegebene Rechteck, Polygon oder die Ellipse. Wenn der <em>Optionen</em>-Parameter leer ist, dann wird der originale/standardm&auml;&szlig;ige Anzeigebereich des Fensters wiederhergestellt. Andernfalls k&ouml;nnen beliebig viele folgende Optionen angegeben werden, die durch Leerzeichen getrennt werden:</p>
<p><strong>Wn</strong>: Breite des Rechtecks oder der Ellipse. Zum Beispiel: w200<br> <strong>Hn</strong>: H&ouml;he des Rechtecks oder der Ellipse. Zum Beispiel: h300<br> <strong>X-Y</strong>: Jeweils die X- und Y-Koordinate. Zum Beispiel: Bei 200-0 ist die 200 die X-Koordinate und die 0 die Y-Koordinate.<br> <strong>E</strong>: Macht die Region zu einer Ellipse, anstatt zu einem Rechteck. Diese Option ist nur g&uuml;ltig, wenn <strong>B</strong> und <strong>H</strong> vorhanden sind.<br> <strong>R[w-h]</strong>: Macht die Region zu einem Rechteck mit abgerundeten Ecken. Zum Beispiel erm&ouml;glicht R30-30 eine 30x30 Ellipse f&uuml;r jede Ecke. Wenn <strong>w-h</strong> weggelassen wird, dann wird 30-30 verwendet. <strong>R</strong> ist nur g&uuml;ltig, wenn <strong>W</strong> und <strong>H</strong> vorhanden sind.</p>
<p><strong>Rechteck oder Ellipse</strong>: Wenn die <strong>W</strong>- und <strong>H</strong>-Optionen vorhanden sind, dann wird der neue Anzeigebereich ein Rechteck, dessen Ecke nur vom ersten <strong>X-Y</strong>-Paar bestimmt wird. Wenn jedoch die <strong>E</strong>-Option auch vorhanden ist, dann wird der neue Anzeigebereich eine Ellipse anstelle eines Rechtecks. Zum Beispiel: WinSet, Region, 50-0 W200 H250 E, Fenstertitel</p>
<p><strong>Polygon</strong>: Wenn die <strong>W-</strong> und <strong>H</strong>-Optionen nicht vorhanden sind, dann wird der Anzeigebereich zu einem Polygon, das von mehreren <strong>X-Y</strong>-Paaren bestimmt wird (jede Koordinate ist ein Punkt im Fenster, relativ zur oberen linken Ecke). Wenn zum Beispiel 3 Koordinaten angegeben sind, dann ist der neue Anzeigebereich in den meisten F&auml;llen ein Dreieck. Die Reihenfolge der Koordinaten zueinander spielt manchmal eine Rolle. Dar&uuml;ber hinaus kann das Wort <strong>Wind</strong> in den <em>Optionen</em> angegeben werden, um die Kurvenmethode anstelle der alternierenden Methode zu verwenden, um den Bereich des Polygons zu bestimmen.</p>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird bei Misserfolg auf 1 und bei Erfolg auf 0 gesetzt. Fehler treten auf, wenn: 1) das Zielfenster nicht vorhanden ist, 2) beliebig viele <em>Optionen</em> ung&uuml;ltig sind, 3) mehr als 2000 Koordinaten angegeben sind, oder 4) die angegebene Region ung&uuml;ltig ist oder nicht auf das Zielfenster angewendet werden kann.</p>
<p>Siehe die Beispiele weiter unten, wie dieser Befehl verwendet werden kann.</p>
<h3 id="trans">WinSet, Transparent, N, Fenstertitel</h3>
<p>Macht ein Fenster halbtransparent. Verwendet f&uuml;r <em>N</em> eine Zahl zwischen 0 und 255, um den Grad der Transparenz zu kennzeichnen: 0 macht das Fenster unsichtbar, w&auml;hrend 255 es undurchsichtig macht. Mit dem Wort OFF, kann die Transparenz eines Fensters komplett deaktiviert werden. Der Unterschied zu 255 ist, dass dadurch die Performance verbessert und die Systemressourcennutzung verringert werden kann.</p>
<p><a name="TransLimit"></a><strong>Bekannte Einschr&auml;nkungen f&uuml;r Transparent und <a href="#TransColor">TransColor</a></strong>:</p>
<ul>
  <li>Diese Befehle funktionieren nicht in Windows 9x und NT4.</li>
  <li>Diese Befehle haben keine Auswirkungen auf einem Fenster, wenn die Titelleiste und die <a href="#AlwaysOnTop">"immer im Vordergrund"</a>-Eigenschaft fehlt. Um dieses Problem f&uuml;r <a href="Gui.htm">GUI-Fenster</a> zu beheben, entfernt die Titelleiste erst, nachdem das Fenster transparent gemacht wurde. Alternativ erlauben folgende Eigenschaften die Transparenz: <em><a href="Gui.htm#Options">Gui -Caption +ToolWindow</a>.</em></li>
  <li>Wenn "Transparent" auf 255 gesetzt wird, bevor es deaktiviert wird, dann k&ouml;nnen Probleme beim Neuzeichnen des Fensters vermieden werden, wie z. B. ein schwarzer Hintergrund. Wenn das Fenster immer noch nicht korrekt gezeichnet wird, dann siehe <a href="#Redraw">Redraw</a> f&uuml;r eine m&ouml;gliche &Uuml;bergangsl&ouml;sung.</li>
  <li>Um die transparente Farbe (<a href="#TransColor">TransColor</a>) eines Fensters zu ver&auml;ndern, dann ist es vorher m&ouml;glicherweise notwendig, die Transparenz zu deaktivieren.</li>
</ul>
<p><strong>Tipp</strong>: Um die Taskleiste transparent zu machen, verwendet <em>WinSet, Transparent, 150, ahk_class Shell_TrayWnd</em>. Um das Startmen&uuml; transparent zu machen, befolgt dieses Beispiel:</p>
<pre>DetectHiddenWindows, on
WinSet, Transparent, 150, ahk_class BaseBar  <em>; Um die Untermen&uuml;s des Startmen&uuml;s transparent zu machen, f&uuml;gt das untere Script hinzu.</em></pre>
<p>Um alle oder ausgew&auml;hlte Men&uuml;s im gesamten System transparent zu machen, lasst ein Script wie das Folgende immer laufen. Beachtet, dass ein Script seine eigenen Men&uuml;s nicht transparent machen kann, jedoch aber Men&uuml;s von anderen Scripts:</p>
<pre>#Persistent
SetTimer, WatchForMenu, 5
Return  <em>; Ende des automatischen Ausf&uuml;hrungsbereichs.</em>

WatchForMenu:
DetectHiddenWindows, on  <em>; Damit k&ouml;nnen Men&uuml;s eher erkannt werden.</em>
IfWinExist, ahk_class #32768
    WinSet, Transparent, 150  <em>; Verwendet das zuletzt gefundene Fenster.</em>
Return</pre>
<h3 id="TransColor">WinSet, TransColor, Farbe [N], Fenstertitel</h3>
<p>Macht alle Pixel der ausgew&auml;hlten Farbe innerhalb des Zielfensters unsichtbar, dadurch der Inhalt hinter dem Fenster sichtbar wird (funktioniert nicht in Windows 9x und NT4). Wenn der Benutzer auf einem unsichtbaren Pixel klickt, dann gilt dieser Mausklick f&uuml;r den Inhalt dahinter. Ansonsten kann f&uuml;r die <em>Farbe</em> ein Farbname oder RGB-Wert angegeben werden (siehe <a href="Progress.htm#colors">Farbtabelle</a> oder verwendet <a href="PixelGetColor.htm">PixelGetColor</a> im RGB-Modus). Um zus&auml;tzlich einen sichtbaren Fensterbereich teilweise transparent zu machen, h&auml;ngt ein Leerzeichen gefolgt von der Transparenzstufe (0-255) an. Zum Beispiel: <em>WinSet, TransColor, EEAA99 150, Fenstertitel</em></p>
<p>TransColor wird oft verwendet, um Bildschirmanzeigen (OSD) und andere visuelle Effekte zu erzeugen. <a href="Gui.htm#OSD">Weiter unten auf der GUI-Seite</a> ist ein Beispiel f&uuml;r eine Bildschirmanzeige.</p>
<p>Mit dem Wort OFF kann die Transparenz eines Fensters komplett deaktiviert werden. Beide Zeilen haben die gleiche Funktion:<br> WinSet, Transparent, Off, Fenstertitel<br> WinSet, TransColor, Off, Fenstertitel</p>
<p>Bekannte Einschr&auml;nkungen: Siehe die Liste weiter <a href="#TransLimit">oben</a>.</p>
<h3>Bemerkungen</h3>
<p><a href="../misc/ErrorLevel.htm">ErrorLevel</a> wird nicht durch diesen Befehl ver&auml;ndert, wenn nicht anders angegeben.</p>
<p>Obwohl die Transparenz in Windows 2000/XP oder h&ouml;her unterst&uuml;tzt wird, k&ouml;nnen die Transparenzeinstellungen eines Fensters nur in Windows XP oder h&ouml;her abgerufen werden (mit <a href="WinGet.htm">WinGet</a>).</p>
<p>Der <a href="SplashTextOn.htm">SplashText</a> eines Fensters kann wie folgt eingestellt werden, damit es nicht immer im Vordergrund ist:<br> WinSet, AlwaysOnTop, Off, Eigener Splash-Fenstertitel</p>
<p>Fenstertitel und -texte sind von der Gro&szlig;- und Kleinschreibung abh&auml;ngig. Solange <a href="DetectHiddenWindows.htm">DetectHiddenWindows</a> deaktiviert ist, werden versteckte Fenster nicht wahrgenommen.</p>

<h3>Verwandte Befehle</h3>
<p><a href="WinGet.htm">WinGet</a>, <a href="WinHide.htm">WinHide</a>, <a href="WinSetTitle.htm">WinSetTitle</a>, <a href="WinMove.htm">WinMove</a>, <a href="WinActivate.htm">WinActivate</a>, <a href="Control.htm">Control</a></p>
<h3>Beispiele</h3>
<pre class="NoIndent">WinSet, Transparent, 200, Unbenannt - Editor <em>; Macht das Fenster ein wenig transparent.</em>
WinSet, TransColor, White, Unbenannt - Editor <em>; Macht alle wei&szlig;en Pixel unsichtbar.</em>
WinSet, AlwaysOnTop, toggle, Rechner <em>; Schaltet den "Immer im Vordergrund"-Zustand des Rechners um.</em>

<em>; L&auml;ngeres Beispiel:
; Hier sind einige Hotkeys, die den Effekt von "Transparent" und
; "TransColor" veranschaulichen.  HINWEIS: Wenn der Benutzer auf einem Hotkey dr&uuml;ckt, w&auml;hrend sich der Mauszeiger
; &uuml;ber einem Pixel befindet, der durch TransColor unsichtbar ist, dann wird
; stattdessen mit dem Fenster dahinter interagiert!  Au&szlig;erdem funktioniert Win+G
; nur in Windows XP oder h&ouml;her, weil das Abrufen von Transparenzeinstellungen
; in Windows 2000 nicht unterst&uuml;tzt wird:</em>

#t::  <em>; Dr&uuml;ckt Win+T, um die Farbe unter dem Mauszeiger unsichtbar zu machen.</em>
MouseGetPos, MausX, MausY, MausWin
PixelGetColor, MausRGB, %MausX%, %MausY%, RGB
<em>; Es erscheint notwendig, jede vorhandene Transparenz zuerst zu deaktivieren:</em>
WinSet, TransColor, Off, ahk_id %MausWin%
WinSet, TransColor, %MausRGB% 220, ahk_id %MausWin%
Return

#o::  <em>; Dr&uuml;ckt Win+O, um die Transparenz des Fensters unter der Maus zu deaktivieren.</em>
MouseGetPos,,, MausWin
WinSet, TransColor, Off, ahk_id %MausWin%
Return

#g::  <em>; Dr&uuml;ckt Win+G, um die aktuellen Einstellungen des Fensters unter der Maus anzuzeigen.</em>
MouseGetPos,,, MausWin
WinGet, Transparent, Transparent, ahk_id %MausWin%
WinGet, TransColor, TransColor, ahk_id %MausWin%
ToolTip Durchsichtigkeit:`t%Transparent%`nTransparenzfarbe:`t%TransColor%
Return

<em>; Beispiele f&uuml;r "WinSet Region":</em>
WinSet, Region, 50-0 W200 H250, Fenstertitel <em>; Macht alle Fensterbereiche au&szlig;erhalb des Rechtecks unsichtbar.</em>
WinSet, Region, 50-0 W200 H250 R40-40, Fenstertitel <em>; Gleiche wie oben, aber mit abgerundeten Ecken.</em>
WinSet, Region, 50-0 W200 H250 E, Fenstertitel <em>; Eine Ellipse anstelle eines Rechtecks.</em>
WinSet, Region, 50-0 250-0 150-250, Fenstertitel <em>; Ein nach unten gerichtetes Dreieck.</em>
WinSet, Region,, Fenstertitel <em>; Stellt den originalen/standardm&auml;&szlig;igen Anzeigebereich des Fensters wieder her.</em>

<em>; Hier ist eine Region mit einem komplexeren Bereich. Es erstellt ein durchsichtiges Rechteck innerhalb eines Fensters.
; Es sind zwei Rechtecke unten angegeben: ein &Auml;u&szlig;eres und ein Inneres.  Jedes Rechteck besteht aus 5 Koordinaten, weil die erste Koordinate am Ende nochmal benutzt wird, um das Rechteck wieder zuschlie&szlig;en.</em>
WinSet, Region, 0-0 300-0 300-300 0-300 0-0   100-100 200-100 200-200 100-200 100-100, Fenstertitel</pre>

</body>
</html>