<!DOCTYPE HTML>
<html>
<head>
<title>Script-Beispiele</title>
<meta name="keywords" content="">
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link href="../static/theme.css" rel="stylesheet" type="text/css" />
<link href="../static/font.css" rel="stylesheet" type="text/css" />
<script src="../static/ga.js" type="text/javascript"></script>
<!--[if lt IE 9]>
<script src="../static/html5.js"></script>
<![endif]-->
<script src="../navbar/NavScript.js" type="text/javascript"></script>
<style type="text/css">
<!--
p {
	margin-top: 1em;
	margin-bottom: 1em;
}
-->
</style>
</head>
<body>
<script type="text/javascript">WriteHeader(1);</script>
<div id="content">
  <section>
    <div id="article">
    <h1>Script-Beispiele</h1>
    <p><a href="http://www.enovatic.org/products/niftywindows/introduction/">NiftyWindows -- von Enovatic-Solutions</a>: Dieses Script erm&ouml;glicht eine einfache Steuerung von grundlegenden Fensterinteraktionen wie Ziehen, Skalieren, Maximieren, Minimieren und Schlie&szlig;en. Seine st&auml;rkste Funktion wird beim Ziehen mit der rechten Maustaste aktiviert. Jedes Fenster wird in einen k&uuml;nstlichen 9-Zellen-Raster mit drei Spalten und Zeilen unterteilt. Die mittlere Zelle ist die gr&ouml;&szlig;te: damit kann das Fenster gegriffen und frei verschoben werden, indem es mit der rechten Maustaste angeklickt und gehalten wird. Die anderen acht Zellen werden verwendet, um ein Fenster auf der gleichen Weise zu skalieren. NiftyWindows erm&ouml;glicht au&szlig;erdem die Ausrichtung am Raster, "Seitenverh&auml;ltnis beibehalten", ein Fenster bis zur Titelleiste zusammenrollen, Steuerung der Transparenz und andere n&uuml;tzliche Funktionen. </p>
    <p><a href="http://www.autohotkey.com/forum/topic11700.html">Bildschirmlupe -- von Holomind</a>: Diese Bildschirmlupe hat mehrere Vorteile gegen&uuml;ber der Lupe des Betriebssystems, unter anderem: Anpassen des Aktualisierungsintervalls und der Zoomstufe (einschlie&szlig;lich Verkleinern); Antialiasing f&uuml;r eine sch&ouml;nere Ausgabe; au&szlig;erdem ist es Open-Source (folglich gibt es mehrere Varianten zur Auswahl, oder optimiert das Script je nach Bedarf). </p>
    <p><a href="http://www.autohotkey.com/forum/topic11588.html">LiveWindows: Dialogfenster in Miniaturbilder anzeigen -- von Holomind</a>: Mit diesem Script kann der Fortschritt von Downloads, das Kopieren von Dateien und andere Dialogfenster &uuml;berwacht werden, indem eine kleine Kopie von jedem Dialogfenster und dessen Fortschrittsbalken angezeigt wird (Dialogfenster werden automatisch erkannt, selbst wenn sie sich hinter anderen Fenstern befinden). Das Vorschaufenster bleibt immer im Vordergrund, aber verbraucht nur wenig Platz auf dem Bildschirm (dessen Gr&ouml;&szlig;e auch durch Ziehen der Rahmen ge&auml;ndert werden kann). Es kann auch ein beliebiges Fenster &uuml;berwacht werden, indem ein Auswahlrechteck um den gew&uuml;nschten Bereich gezogen wird (mit STRG+UMSCHALT+MAUSTASTE), dr&uuml;ckt danach WIN+W, um diese Auswahl im Vorschaufenster anzuzeigen, welche in Echtzeit aktualisiert wird. </p>
    <p><a href="MouseGestures.htm">Mausgesten -- von deguix</a>: Dieses Script &uuml;berwacht die Mausbewegungen des Benutzers, sobald die rechte Maustaste gedr&uuml;ckt gehalten wird.  Wenn der Benutzer eine erkennbare Form "zeichnet", dann wird ein Programm oder eine andere benutzerdefinierte Aktion ausgef&uuml;hrt (wie Hotkeys).  Siehe beigef&uuml;gte README-Datei, wie Gesten definiert werden k&ouml;nnen. </p>
    <p><a href="ContextSensitiveHelp.htm">Kontextabh&auml;ngige Hilfe in einem beliebigen Editor -- von Rajat</a>:  Damit kann mit STRG+2 (oder ein anderer Hotkey) die Hilfe-Dateiseite f&uuml;r den markierten AutoHotkey-Befehl oder Schl&uuml;sselwort angezeigt werden. Wenn nichts markiert ist, dann wird der Befehlsname vom Anfang der aktuellen Zeile extrahiert. </p>
    <p><a href="EasyWindowDrag.htm">Einfache Fensterverschiebung (ben&ouml;tigt XP/2k/NT)</a>:  Normalerweise kann ein Fenster nur verschoben werden, wenn die Titelleiste angeklickt wird. Dieses Script erweitert diese Funktion, sodass jeder Punkt in einem Fenster angeklickt werden kann. Um diesen Modus zu aktivieren, haltet die FESTSTELL-Taste oder die mittlere Maustaste beim Klicken gedr&uuml;ckt und verschiebt das Fenster danach zur gew&uuml;nschten Position. </p>
    <p><a href="EasyWindowDrag_(KDE).htm">Einfache Fensterverschiebung -- KDE-Style (ben&ouml;tigt XP/2k/NT) -- von Jonny</a>:  Mit diesem Script ist es bedeutend einfacher, ein Fenster zu verschieben oder zu skalieren: 1) Haltet die ALT-Taste gedr&uuml;ckt und klickt mit der linken Maustaste irgendwo auf das Fenster, um es zur gew&uuml;nschten Position zu verschieben; 2) Haltet die ALT-Taste gedr&uuml;ckt und klickt mit der rechten Maustaste irgendwo auf das Fenster, um dessen Gr&ouml;&szlig;e einfach zu &auml;ndern; 3) Dr&uuml;ckt die ALT-Taste zweimal, bevor jedoch der zweite Tastendruck losgelassen wird, klickt mit der linken Maustaste, um das Fenster unter dem Mauszeiger zu minimieren, klickt mit der rechten Maustaste, um es zu maximieren oder klickt mit der mittleren Maustaste, um es zu schlie&szlig;en. </p>
    <p><a href="FavoriteFolders.htm">Einfacher Zugriff auf Lieblingsordner -- von Savage</a>:  Wenn die mittlere Maustaste gedr&uuml;ckt wird, w&auml;hrend bestimmte Fenstertypen aktiv sind, dann zeigt dieses Script ein Men&uuml; mit den Lieblingsordnern an.  Nachdem ein Ordner ausgew&auml;hlt wurde, wechselt das Script innerhalb des aktiven Fensters sofort auf diesen Ordner.  Die folgenden Fenstertypen werden unterst&uuml;tzt: 1) Standard-Dialogfenster zum &Ouml;ffnen oder Speichern von Dateien; 2) Explorer-Fenster; 3) Konsolenfenster (Eingabeaufforderung). Das Men&uuml; kann optional auch f&uuml;r nicht unterst&uuml;tzte Fenstertypen angezeigt werden, in diesem Fall wird der ausgew&auml;hlte Ordner in einem neuen Explorer-Fenster ge&ouml;ffnet. </p>
    <p><a href="IntelliSense.htm">IntelliSense -- von Rajat (ben&ouml;tigt XP/2k/NT)</a>:  Dieses Script &uuml;berwacht die Benutzereingaben beim Bearbeiten eines AutoHotkey-Scripts.  Sobald ein Befehl gefolgt von einem Komma oder eines Leerzeichens eingegeben wird, dann wird als Hilfe die Parameterliste des Befehls angezeigt.  Dar&uuml;ber hinaus kann STRG+F1 (oder ein anderer Hotkey) gedr&uuml;ckt werden, um die Befehlsseite in der Hilfe-Datei anzuzeigen. Um die Parameterliste zu schlie&szlig;en, dr&uuml;ckt Escape oder Enter. </p>
    <p><a href="JoystickMouse.htm">Joystick als Maus verwenden</a>:  Dieses Script wandelt einen Joystick in eine Maus mit drei Tasten um.  Dadurch verh&auml;lt sich jede Joystick-Taste wie eine Maustaste und verbraucht kaum CPU-Zeit. Au&szlig;erdem ist die Zeigergeschwindigkeit abh&auml;ngig davon, wie weit der Joystick vom Zentrum gedr&uuml;ckt wird. Verschiedene Einstellungen k&ouml;nnen auch im oberen Bereich des Scripts angepasst werden. </p>
    <p><a href="JoystickTest.htm">Joystick-Test-Script</a>:  Dieses Script hilft dabei, die Tastennummern und andere Attribute des aktuellen Joysticks zu bestimmen. Es k&ouml;nnte auch erkennen lassen, ob der aktuelle Joystick kalibriert werden muss; das hei&szlig;t, ob der Bewegungsbereich jeder Achse von 0 bis 100 Prozent ist. Falls eine Kalibrierung erforderlich ist, verwendet die Systemsteuerung des Betriebssystems oder die mitgelieferte Software des aktuellen Joysticks. </p>
    <p><a href="KeyboardOnScreen.htm">Bildschirmtastatur (ben&ouml;tigt XP/2k/NT) -- von Jon</a>:  Dieses Script erstellt eine nachgebildete Tastatur am unteren Rand des Bildschirms, das die gedr&uuml;ckten Tasten in Echtzeit anzeigt. Das hat mir geholfen, Eingaben zu machen, ohne dabei auf die Tastatur zu schauen.  Die Gr&ouml;&szlig;e der Bildschirmtastatur kann im oberen Bereich des Scripts angepasst werden. Au&szlig;erdem kann die Tastatur angezeigt oder versteckt werden, wenn das Tray-Icon doppelt angeklickt wird. </p>
    <p><a href="MinimizeToTrayMenu.htm">Fenster in das Tray-Men&uuml; minimieren</a>:  Dieses Script erm&ouml;glicht einem beliebigen Hotkey, ein beliebiges Fenster zu verstecken, damit es als Men&uuml;punkt am Ende des Tray-Men&uuml;s angezeigt wird.  Versteckte Fenster k&ouml;nnen dann wieder einzeln oder alle auf einmal sichtbar gemacht werden, indem der entsprechende Men&uuml;punkt ausgew&auml;hlt wird.  Falls das Script aus irgendeinem Grund beendet wird, werden alle versteckten Fenster wieder automatisch sichtbar gemacht. </p>
    <p><a href="MsgBoxButtonNames.htm">Schaltfl&auml;chennamen der MsgBox &auml;ndern</a>:  Das ist ein funktionierendes Beispiel-Script, das einen Timer verwendet, um die Namen der Schaltfl&auml;chen in einem MsgBox-Dialogfenster zu &auml;ndern. Auch wenn die Schaltfl&auml;chennamen ge&auml;ndert werden, ben&ouml;tigt der IfMsgBox-Befehl weiterhin den urspr&uuml;nglichen Namen der Schaltfl&auml;che. </p>
    <p><a href="Numpad000.htm">Numpad-Taste 000</a>:  Dieses Beispiel-Script wandelt die 000-Sondertaste bei einigen Ziffernbl&ouml;cken in eine Gleichheitstaste.  Diese Aktion kann ge&auml;ndert werden, wenn die Zeile <code>Send, =</code> je nach Bedarf mit einer anderen Zeile ersetzt wird. </p>
    <p><a href="NumpadMouse.htm">Tastatur-Ziffernblock als eine Maus verwenden -- von deguix</a>:  Mit diesem Script kann die Maus wie die echte Maus bewegt werden (vielleicht sogar einfacher bei einigen Aufgaben). Es werden bis zu f&uuml;nf Maustasten sowie das Drehen des Mausrades unterst&uuml;tzt.  Au&szlig;erdem kann damit die Bewegungsgeschwindigkeit, Genauigkeit und "Achseninversion" angepasst werden. </p>
    <p><a href="Seek_(SearchTheStartMenu).htm">Seek -- von Phi</a>:  Die Navigation im Startmen&uuml; kann umst&auml;ndlich sein, besonders wenn viele Programme im Laufe der Zeit installiert wurden. Mit "Seek" kann ein Schl&uuml;sselwort unabh&auml;ngig von der Gro&szlig;- und Kleinschreibung angegeben werden, um &uuml;bereinstimmende Programme und Verzeichnisse im Startmen&uuml; herauszufiltern, damit das gew&uuml;nschte Programm aus der Liste einfach ge&ouml;ffnet werden kann. Dadurch entf&auml;llt das unn&ouml;tige Durchsuchen des Startmen&uuml;s. </p>
    <p><a href="TooltipMouseMenu.htm">ToolTip-Mausmen&uuml; (ben&ouml;tigt XP/2k/NT) -- von Rajat</a>:  Dieses Script zeigt ein aufklappbares Men&uuml; beim kurzen Dr&uuml;cken der mittleren Maustaste an.  Ein Men&uuml;punkt kann mit einem Linksklick ausgew&auml;hlt werden. Das Men&uuml; wird geschlossen, sobald au&szlig;erhalb des Men&uuml;s mit der linken Maustaste geklickt wird.  Als aktuelle Verbesserung kann der Inhalt des Men&uuml;s ge&auml;ndert werden, abh&auml;ngig davon, welcher Fenstertyp aktiv ist (Notepad und Word wurden hier als Beispiele verwendet). </p>
    <p><a href="VolumeOSD.htm">Lautst&auml;rke-Bildschirmanzeige (OSD) -- von Rajat</a>:  Dieses Script erm&ouml;glicht beliebige Hotkeys, die Gesamt- und/oder Wave-Lautst&auml;rke zu erh&ouml;hen oder zu verringern.  Beide Lautst&auml;rken werden als Balkendiagramme mit unterschiedlichen Farben angezeigt. </p>
    <p><a href="WindowShading.htm">Window Shading (ein Fenster bis zur Titelleiste zusammenrollen) -- von Rajat</a>:  Dieses Script verkleinert ein Fenster auf dessen Titelleiste und beim Dr&uuml;cken eines Hotkeys wieder auf seine urspr&uuml;ngliche Gr&ouml;&szlig;e.  Eine beliebige Anzahl an Fenstern kann auf diese Weise verkleinert werden (das Script merkt sich diese).  Wenn das Script aus irgendeinem Grund beendet wird, dann werden die originalen H&ouml;hen aller "zusammengerollten" Fenstern automatisch wiederhergestellt. </p>
    <p><a href="WinLIRC.htm">WinLIRC-Client</a>:  Dieses Script empf&auml;ngt Nachrichten von <a href="http://winlirc.sourceforge.net">WinLIRC</a>, sobald eine Taste der Fernbedienung gedr&uuml;ckt wird. Au&szlig;erdem kann damit Winamp, Windows Media Player und so weiter automatisiert werden. Es ist einfach zu konfigurieren. Wenn zum Beispiel WinLIRC eine Schaltfl&auml;che namens "VolUp" auf der Fernbedienung erkennt, dann wird ein Label namens VolUp erstellt und der Befehl <code>SoundSet +5</code> darunter verwendet, um die Lautst&auml;rke der Soundkarte um 5 % zu erh&ouml;hen. </p>
    <p><a href="http://www.donationcoder.com/Software/Skrommel/">1 Hour Software -- von skrommel</a>: Eine gro&szlig;e Auswahl von n&uuml;tzlichen Scripts, professionell pr&auml;sentiert mit kurzen Beschreibungen und Screenshots. </p>
    <p><a href="http://file.autohotkey.net/Titan/">Scripts von Titan</a>: Diese Sammlung enth&auml;lt n&uuml;tzliche Scripts wie zum Beispiel:<br>
      1) XML-Reader/Writer: Eine einfache Schnittstelle f&uuml;r XML-Dateien, um Werte wie bei JavaScript abzurufen und zu schreiben.<br>
      2) Anker: Dadurch k&ouml;nnen GUI-Steuerelemente am rechten oder unteren Rand eines skalierbaren Fensters h&auml;ngen bleiben.<br>
      3) Funktionen: Eine Sammlung von Wrapper-Funktionen, jeweils f&uuml;r einen AutoHotkey-Befehl mit einer Ausgabevariable.<br>
      4) Wetter: Zeigt das aktuelle Wetter im Tray-Men&uuml; an oder zeigt die Vorhersagen in einem umfangreichen GUI-Fenster an. </p>
    <p><a href="http://www.autohotkey.com/forum/topic12338.html">Scripts von Toralf</a>: Diese Sammlung enth&auml;lt n&uuml;tzliche Scripts wie zum Beispiel:<br>
      1) AHK-Fensterinfo: Zeigt Informationen &uuml;ber Fenster, Steuerelemente und so weiter an.<br>
      2) Elektronische Programm&uuml;bersicht: Zeigt die TV-Programme/Abl&auml;ufe der aktuellen Region (unterst&uuml;tzt mehrere L&auml;nder).<br>
      3) Auto-Syntax-Tidy: &Auml;ndert die Einr&uuml;ckung und Gro&szlig;-/Kleinschreibung von Befehlen im Script, um ein einheitliches Format zu bewahren. </p>
    <p>Scripts von Sean: Diese Sammlung enth&auml;lt n&uuml;tzliche Scripts wie zum Beispiel:<br>
      1) <a href="http://www.autohotkey.com/forum/topic18033.html">Netzwerk-Download/Upload-Z&auml;hler</a>: Zeigt den Download/Upload des Netzwerks in KB mit einem kleinen Fortschrittsbalken an, der immer im Vordergrund ist.<br>
      2) <a href="http://www.autohotkey.com/forum/topic16823.html">StdoutToVar</a>: Leitet die Ausgabe eines Befehls oder einer Anwendung in eine Variable des Scripts um.<br>
      3) <a href="http://www.autohotkey.com/forum/topic18146.html">Erfassen eines Bildschirmrechtecks</a>: Eine aufrufbare Funktion, die ein Bildschirmbereich erfasst und als Datei (BMP/JPG/PNG/GIF/TIF) abspeichert. Es kann auch transparente Fenster und den Mauszeiger erfassen.<br>
      4) <a href="http://www.autohotkey.com/forum/topic18167.html">Color Zoomer/Picker</a>: Vergr&ouml;&szlig;ert den Bereich in der N&auml;he des Mauszeigers, sodass ein einzelnes Pixel ausgew&auml;hlt und dessen Farbe identifiziert werden kann.<br>
      5) <a href="http://www.autohotkey.com/wiki/index.php?title=Internet_Explorer_Control">Steuerelement des Internet Explorers einbetten</a>: Ein MSIE-Steuerelement in das GUI-Fenster eines Scripts einbinden. Das Steuerelement kann eine Web-Seite oder andere browser-kompatible Inhalte anzeigen.</p>
    <p><a href="http://www.autohotkey.com/forum/topic8795.html">SKAN&rsquo;s Tips N Tricks</a>: Enth&auml;lt Beispielcodes und Techniken, um n&uuml;tzliche Effekte und oft nachgefragte F&auml;higkeiten zu erreichen.</p>
    <p><a href="http://www.autohotkey.com/forum/forum-2.html">Forum: Scripts & Functions</a>: Eine durchsuchbare Sammlung von fast 1000 lauff&auml;hige Scripts und Funktionen. Erstellt und gepflegt von AutoHotkey-Benutzern, w&auml;chst und verbessert sich das Archiv st&auml;ndig.</p>
  </div>
  </section>
</div>
<script type="text/javascript">WriteFooter(1);</script>
</body>
</html>